Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: Could not find section in .gitmodules where path=%s
ca: No s'ha pogut trobar la secció en .gitmodules on path=%s

source: Could not update .gitmodules entry %s
ca: No s'ha pogut actualitzar l'entrada de .gitmodules %s

source: Could not remove .gitmodules entry for %s
ca: No s'ha pogut treure l'entrada de .gitmodules per a %s

source: staging updated .gitmodules failed
ca: L'allistament del .gitmodules actualitzat ha fallat

source: Could not create git link %s
ca: No s'ha pogut crear l'enllaç de git %s

source: Could not set core.worktree in %s
ca: No s'ha pogut establir core.worktree en %s

source: Checking out files
ca: Agafant fitxers

source: invalid URL scheme name or missing '://' suffix
ca: esquema d'URL invàlida o manca el sufix '://'

source: invalid %XX escape sequence
ca: seqüència d'escapament %XX invàlida

source: missing host and scheme is not 'file:'
ca: manca l'host i l'esquema no és 'file:'

source: a 'file:' URL may not have a port number
ca: un URL 'file:' no pot tenir un número de port

source: invalid characters in host name
ca: caràcters invàlids en nom de host

source: invalid port number
ca: número de port invàlid

source: invalid '..' path segment
ca: segment de ruta '..' invàlid

source: unable to access '%s': %s
ca: incapaç d'accedir a '%s': %s

source: unable to access '%s'
ca: incapaç d'accedir a '%s'

source: unable to look up current user in the passwd file: %s
ca: incapaç de trobar l'usuari actual en el fitxer passwd: %s

source: no such user
ca: cap usuari així

source: Unmerged paths:
ca: Rutes sense fusionar:

source: (use "git reset %s <file>..." to unstage)
ca: (utilitzeu "git reset %s <fitxer>..." per desallistar)

source: (use "git rm --cached <file>..." to unstage)
ca: (utilitzeu "git rm --cached <fitxer>..." per desallistar)

source: (use "git add <file>..." to mark resolution)
ca: (utilitzeu "git add <file>..." per senyalar resolució)

source: (use "git add/rm <file>..." as appropriate to mark resolution)
ca: (utilitzeu "git add/rm <file>..." segons sigui apropiat per senyalar resolució)

source: (use "git rm <file>..." to mark resolution)
ca: (utilitzeu "git rm <file>..." per senyalar resolució)

source: Changes to be committed:
ca: Canvis que cometre:

source: Changes not staged for commit:
ca: Canvis no allistats per a cometre:

source: (use "git add <file>..." to update what will be committed)
ca: (utilitzeu "git add <file>..." per actualitzar què es cometrà)

source: (use "git add/rm <file>..." to update what will be committed)
ca: (utilitzeu "git add/rm <file>..." per actualitzar què es cometrà)

source: (use "git checkout -- <file>..." to discard changes in working directory)
ca: (utilitzeu "git checkout -- <file>..." per descartar els canvis en el directori de treball)

source: (commit or discard the untracked or modified content in submodules)
ca: (cometeu o descarteu el contingut modificat o no seguit en els submòduls)

source: (use "git %s <file>..." to include in what will be committed)
ca: (utilitzeu "git %s <file>..." per incloure en què es cometrà)

source: both deleted:
ca: suprimit per ambdós:

source: added by us:
ca: afegit per nosaltres:

source: deleted by them:
ca: suprimit per ells:

source: added by them:
ca: afegit per ells:

source: deleted by us:
ca: suprimit per nosaltres:

source: both added:
ca: afegit per ambdós:

source: both modified:
ca: modificat per ambdós:

source: bug: unhandled unmerged status %x
ca: bug: estat no fusionat no manejat %x

source: new file:
ca: fitxer nou:

source: copied:
ca: copiat:

source: deleted:
ca: suprimit:

source: modified:
ca: modificat:

source: renamed:
ca: canviat de nom:

source: typechange:
ca: canviat de tipus:

source: unknown:
ca: desconegut:

source: unmerged:
ca: sense fusionar:

source: new commits,
ca: comissions noves,

source: modified content,
ca: contingut modificat,

source: untracked content,
ca: contingut no seguit,

source: bug: unhandled diff status %c
ca: bug: estat de diferència no manejat %c

source: Submodules changed but not updated:
ca: Submòduls canviats però no actualitzats:

source: Submodule changes to be committed:
ca: Canvis de submòdul que cometre:

source: Do not touch the line above. Everything below will be removed.
ca: No toquis la línia amunt. Tot a baix es traurà.

source: You have unmerged paths.
ca: Teniu rutes sense fusionar.

source: (fix conflicts and run "git commit")
ca: (arregleu els conflictes i executeu "git commit")

source: All conflicts fixed but you are still merging.
ca: Tots els conflictes arreglats però encara esteu fusionant.

source: (use "git commit" to conclude merge)
ca: (utilitzeu "git commit" per concloure la fusió)

source: You are in the middle of an am session.
ca: Esteu en el medi d'una sessió am.

source: The current patch is empty.
ca: El pedaç actual està buit.

source: (fix conflicts and then run "git am --continue")
ca: (arregleu els conflictes i després executeu "git am --continue")

source: (use "git am --skip" to skip this patch)
ca: (utilitzeu "git am --skip" per saltar aquest pedaç)

source: (use "git am --abort" to restore the original branch)
ca: (utilitzeu "git am --abort" per restaurar la rama original)

source: You are currently rebasing branch '%s' on '%s'.
ca: Actualment esteu rebasant la rama '%s' en '%s'.

source: You are currently rebasing.
ca: Actualment esteu rebasant.

source: (fix conflicts and then run "git rebase --continue")
ca: (arregleu els conflictes i després executeu "git rebase --continue")

source: (use "git rebase --skip" to skip this patch)
ca: (utlitizeu "git rebase --skip" per saltar aquest pedaç)

source: (use "git rebase --abort" to check out the original branch)
ca: (utilitzeu "git rebase --abort" per agafar la rama original)

source: (all conflicts fixed: run "git rebase --continue")
ca: (tots els conflictes arreglats: executeu "git rebase --continue")

source: You are currently splitting a commit while rebasing branch '%s' on '%s'.
ca: Actualment esteu dividint una comissió mentre rebasant la rama '%s' en '%s'.

source: You are currently splitting a commit during a rebase.
ca: Actualment esteu dividint una comissió durant un rebase.

source: (Once your working directory is clean, run "git rebase --continue")
ca: (Una vegada que el vostre directori de treball sigui net, executeu "git rebase --continue")

source: You are currently editing a commit while rebasing branch '%s' on '%s'.
ca: Actualment esteu editant una comissió mentre rebasant la rama '%s' en '%s'.

source: You are currently editing a commit during a rebase.
ca: Actualment esteu editant una comissió durant un rebase.

source: (use "git commit --amend" to amend the current commit)
ca: (utilitzeu "git commit --amend" per esmenar la comissió actual)

source: (use "git rebase --continue" once you are satisfied with your changes)
ca: (utilitzeu "git rebase --continue" una vegada que sigueu satisfet amb els vostres canvis)

source: You are currently cherry-picking commit %s.
ca: Actualment esteu recollint com cirera la comissió %s.

source: (fix conflicts and run "git cherry-pick --continue")
ca: (arregleu els conflictes i executeu "git cherry-pick --continue")

source: (all conflicts fixed: run "git cherry-pick --continue")
ca: (tots els conflictes arreglats: executeu "git cherry-pick --continue")

source: (use "git cherry-pick --abort" to cancel the cherry-pick operation)
ca: (utilitzeu "git cherry-pick --abort" per cancel·lar l'operació de recull de cireres)

source: You are currently reverting commit %s.
ca: Actualment esteu revertint la comissió %s.

source: (fix conflicts and run "git revert --continue")
ca: (arregleu els conflictes i executeu "git revert --continue")

source: (all conflicts fixed: run "git revert --continue")
ca: (tots els conflictes arreglats: executeu "git revert --continue")

source: (use "git revert --abort" to cancel the revert operation)
ca: (utilitzeu "git revert --abort" per cancel·lar l'operació de reversió)

source: You are currently bisecting, started from branch '%s'.
ca: Actualment esteu bisecant, heu començat des de la rama '%s'.

source: You are currently bisecting.
ca: Actualment esteu bisecant.

source: (use "git bisect reset" to get back to the original branch)
ca: (utilitzeu "git bisect reset" per tornar a la rama original)

source: On branch
ca: En la rama

source: rebase in progress; onto
ca: rebase en progrés; en

source: HEAD detached at
ca: HEAD separat a

source: HEAD detached from
ca: HEAD separat de

source: Not currently on any branch.
ca: Actualment no en cap rama.

source: Initial commit
ca: Comissió inicial

source: Untracked files
ca: Fitxers no seguits

source: Ignored files
ca: Fitxers ignorats

source: It took %.2f seconds to enumerate untracked files. 'status -uno' may speed it up, but you have to be careful not to forget to add new files yourself (see 'git help status').
ca: Ha trigat %.2f segons en enumerar fitxers no seguits. 'status -uno' pot accelerar-ho, però heu de tenir cuidat de no oblidar afegir fitxers nous per vós mateix (veu 'git help status').

source: Untracked files not listed%s
ca: Fitxers no seguits no llistats%s

source: (use -u option to show untracked files)
ca: (utilitzeu l'opció -u per mostrar fitxers no seguits)

source: No changes
ca: Sense canvis

source: no changes added to commit (use "git add" and/or "git commit -a")
ca: cap canvi afegit que cometre (afegeix "git add" o "git commit -a")

source: no changes added to commit
ca: cap canvi afegit que cometre

source: nothing added to commit but untracked files present (use "git add" to track)
ca: res afegit que cometre però fitxers no seguits estan presents (utilitzeu "git add" per seguir-los)

source: nothing added to commit but untracked files present
ca: res afegit que cometre però fitxers no seguits estan presents

source: nothing to commit (create/copy files and use "git add" to track)
ca: res que cometre (creeu/copieu fitxers i utilitzeu "git add" per seguir-los)

source: nothing to commit
ca: res que cometre

source: nothing to commit (use -u to show untracked files)
ca: res que cometre (utilitzeu -u per mostrar fitxers no seguits)

source: nothing to commit, working directory clean
ca: res que cometre, directori de treball net

source: HEAD (no branch)
ca: HEAD (sense rama)

source: Initial commit on
ca: Comissió inicial en

source: gone
ca: no està

source: behind
ca: darrere

source: failed to unlink '%s'
ca: s'ha fallat al desenllaçar '%s'

source: git add [options] [--] <pathspec>...
ca: git add [opcions] [--] <especificació-de-ruta>...

source: unexpected diff status %c
ca: estat de diff inesperat %c

source: updating files failed
ca: s'ha fallat al actualitzar els fitxers

source: remove '%s'
ca: treu '%s'

source: Unstaged changes after refreshing the index:
ca: Canvis no allistats després d'actualitzar l'índex:

source: Could not read the index
ca: No s'ha pogut llegir l'índex

source: Could not open '%s' for writing.
ca: No s'ha pogut obrir '%s' per a escriptura.

source: Could not write patch
ca: No s'ha pogut escriure el pedaç

source: Could not stat '%s'
ca: No s'ha pogut fer stat a '%s'

source: Empty patch. Aborted.
ca: Pedaç buit. Avortat.

source: Could not apply '%s'
ca: No s'ha pogut aplicar '%s'

source: The following paths are ignored by one of your .gitignore files:
ca: Les rutes següents s'ignoren per un dels vostres fitxers .gitignore:

source: dry run
ca: marxa en sec

source: be verbose
ca: sigues verbós

source: interactive picking
ca: recull interactiu

source: select hunks interactively
ca: selecciona els trossos interactivament

source: edit current diff and apply
ca: edita la diferència actual i aplica

source: allow adding otherwise ignored files
ca: permet afegir fitxers que d'altra manera s'ignoren

source: update tracked files
ca: actualitza els fitxers seguits

source: record only the fact that the path will be added later
ca: registra només el fet que la ruta s'afegirà més tard

source: add changes from all tracked and untracked files
ca: afegeix els canvis de tots els fitxers seguits i no seguits

source: ignore paths removed in the working tree (same as --no-all)
ca: ignora les rutes tretes en l'arbre de treball (el mateix que --no-all)

source: don't add, only refresh the index
ca: no afegeixis, només actualitza l'índex

source: just skip files which cannot be added because of errors
ca: només salta els fitxers que no es poden afegir a causa d'errors

source: check if - even missing - files are ignored in dry run
ca: comproveu si els fitxers - encara els mancants - s'ignoran en marxa en sec

source: Use -f if you really want to add them.
ca: Utilitzeu -f si realment els voleu afegir.

source: no files added
ca: cap fitxer afegit

source: adding files failed
ca: l'afegiment de fitxers ha fallat

source: -A and -u are mutually incompatible
ca: -A i -u són mutualment incompatibles

source: Option --ignore-missing can only be used together with --dry-run
ca: L'opció --ignore-missing només es pot utilitzar junt amb --dry-run

source: Nothing specified, nothing added.
ca: Res especificat, res afegit.

source: Maybe you wanted to say 'git add .'?
ca: Potser volíeu dir 'git add .'?

source: index file corrupt
ca: fitxer d'índex malmès

source: Unable to write new index file
ca: Incapaç d'escriure un nou fitxer d'índex

source: git apply [options] [<patch>...]
ca: git apply [opcions] [<pedaç>...]

source: unrecognized whitespace option '%s'
ca: opció d'espai en blanc '%s' no reconeguda

source: unrecognized whitespace ignore option '%s'
ca: opció d'ignoral d'espai en blanc '%s' no reconeguda

source: Cannot prepare timestamp regexp %s
ca: No es pot preparar l'expressió regular de marca de temps %s

source: regexec returned %d for input: %s
ca: regexec ha retornat %d per l'entrada: %s

source: unable to find filename in patch at line %d
ca: incapaç de trobar el nom de fitxer en el pedaç a la línia %d

source: git apply: bad git-diff - expected /dev/null, got %s on line %d
ca: git apply: git-diff dolent - /dev/null esperat, %s rebut en la línia %d

source: git apply: bad git-diff - inconsistent new filename on line %d
ca: git apply: git-diff dolent - nom de fitxer nou inconsistent en la línia %d

source: git apply: bad git-diff - inconsistent old filename on line %d
ca: git apply: git-diff dolent - nom de fitxer antic inconsistent en la línia %d

source: git apply: bad git-diff - expected /dev/null on line %d
ca: git apply: git-diff dolent - /dev/null esperat en la línia %d

source: recount: unexpected line: %.*s
ca: recompte: línia inesperada: %.*s

source: patch fragment without header at line %d: %.*s
ca: fragment de pedaç sense capçalera a la línia %d: %.*s

source: git diff header lacks filename information when removing %d leading pathname component (line %d)
ca: a la capçalera de git diff li manca informació de nom de fitxer al treure %d component de nom de ruta inicial (línia %d)

source: new file depends on old contents
ca: el fitxer nou depèn dels continguts antics

source: deleted file still has contents
ca: el fitxer suprimit encara té continguts

source: corrupt patch at line %d
ca: pedaç malmès a la línia %d

source: new file %s depends on old contents
ca: el fitxer nou %s depèn dels continguts antics

source: deleted file %s still has contents
ca: el fitxer suprimit %s encara té continguts

source: ** warning: file %s becomes empty but is not deleted
ca: ** avís: el fitxer %s es buida però no es suprimeix

source: corrupt binary patch at line %d: %.*s
ca: pedaç binari malmès a la línia %d: %.*s

source: unrecognized binary patch at line %d
ca: pedaç binari no reconegut a la línia %d

source: patch with only garbage at line %d
ca: pedaç amb només escombraries a la línia %d

source: unable to read symlink %s
ca: incapaç de llegir l'enllaç simbòlic %s

source: unable to open or read %s
ca: incapaç d'obrir o llegir %s

source: invalid start of line: '%c'
ca: inici de línia no vàlid: '%c'

source: Hunk #%d succeeded at %d (offset %d line).
ca: El tros #%d ha tingut éxit a %d (desplaçament %d línia).

source: Context reduced to (%ld/%ld) to apply fragment at %d
ca: Context reduït a (%ld/%ld) per a aplicar el fragment a %d

source: while searching for: %.*s
ca: mentre cercant: %.*s

source: missing binary patch data for '%s'
ca: manca els dades de pedaç binari de '%s'

source: binary patch does not apply to '%s'
ca: el pedaç binari no s'aplica a '%s'

source: binary patch to '%s' creates incorrect result (expecting %s, got %s)
ca: el pedaç binari a '%s' crea un resultat incorrecte (esperant %s, %s rebut)

source: patch failed: %s:%ld
ca: el pedaç ha fallat: %s:%ld

source: cannot checkout %s
ca: no es pot agafar %s

source: read of %s failed
ca: la lectura de %s ha fallat

source: path %s has been renamed/deleted
ca: la ruta %s s'ha canviat de nom/suprimit

source: %s: does not exist in index
ca: %s: no existeix en l'índex

source: %s: does not match index
ca: %s: no coincideix amb l'índex

source: removal patch leaves file contents
ca: el pedaç de treta deixa els continguts dels fitxers

source: %s: wrong type
ca: %s: tipus erroni

source: %s has type %o, expected %o
ca: %s és del tipus %o, %o esperat

source: %s: already exists in index
ca: %s: ja existeix en l'índex

source: %s: already exists in working directory
ca: %s: ja existeix en el directori de treball

source: new mode (%o) of %s does not match old mode (%o)
ca: el mode nou (%o) de %s no coincideix amb el mode antic (%o)

source: new mode (%o) of %s does not match old mode (%o) of %s
ca: el mode nou (%o) de %s no coincideix amb el mode antic (%o) de %s

source: %s: patch does not apply
ca: %s: el pedaç no aplica

source: Checking patch %s...
ca: Comprovant el pedaç %s...

source: make_cache_entry failed for path '%s'
ca: make_cache_entry ha fallat per a la ruta '%s'

source: unable to remove %s from index
ca: incapaç de treure %s de l'índex

source: corrupt patch for submodule %s
ca: pedaç corrupte per al submòdul %s

source: unable to stat newly created file '%s'
ca: incapaç de fer stat al fitxer novament creat '%s'

source: unable to create backing store for newly created file %s
ca: incapaç de crear un magatzem de recolzament per al fitxer novament creat %s

source: unable to add cache entry for %s
ca: incapaç d'afegir una entrada de cau per a %s

source: closing file '%s'
ca: tancant el fitxer '%s'

source: unable to write file '%s' mode %o
ca: incapaç d'escriure el fitxer '%s' mode %o

source: Applied patch %s cleanly.
ca: El pedaç %s s'ha aplicat netament.

source: internal error
ca: error intern

source: Applying patch %%s with %d reject...
ca: Aplicant el pedaç %%s amb %d rebuig

source: truncating .rej filename to %.*s.rej
ca: truncant el nom del fitxer .rej a %.*s.rej

source: Hunk #%d applied cleanly.
ca: El tros #%d s'ha aplicat netament.

source: Rejected hunk #%d.
ca: S'ha rebutjat el tros #%d.

source: unrecognized input
ca: entrada no reconegut

source: unable to read index file
ca: incapaç de llegir el fitxer d'índex

source: path
ca: ruta

source: don't apply changes matching the given path
ca: no apliquis canvis que coincideixen amb la ruta donada

source: apply changes matching the given path
ca: aplica els canvis que coincideixen amb la ruta donada

source: num
ca: número

source: remove <num> leading slashes from traditional diff paths
ca: treu <nombre> barres obliqües inicials de les rutes de diferència tradicionals

source: ignore additions made by the patch
ca: ignora afegiments fets pel pedaç

source: instead of applying the patch, output diffstat for the input
ca: en lloc d'aplicar el pedaç, emet les estadístiques de diferència de l'entrada

source: show number of added and deleted lines in decimal notation
ca: mostra el nombre de línies afegides i suprimides en notació decimal

source: instead of applying the patch, output a summary for the input
ca: en lloc d'aplicar el pedaç, emet un resum de l'entrada

source: instead of applying the patch, see if the patch is applicable
ca: en lloc d'aplicar el pedaç, veges si el pedaç és aplicable

source: make sure the patch is applicable to the current index
ca: assegura que el pedaç sigui aplicable a l'índex actual

source: apply a patch without touching the working tree
ca: aplica un pedaç sense tocar l'arbre de treball

source: also apply the patch (use with --stat/--summary/--check)
ca: aplica el pedaç també (utilitzeu amb --stat/--summary/--check)

source: attempt three-way merge if a patch does not apply
ca: intenta una fusió de tres vies si el pedaç no s'aplica

source: build a temporary index based on embedded index information
ca: construeix un índex temporal basat en la informació d'índex incrustada

source: paths are separated with NUL character
ca: rutes es separen amb el caràcter NUL

source: ensure at least <n> lines of context match
ca: assegura que almenys <n> línies de context coincideixin

source: action
ca: acció

source: detect new or modified lines that have whitespace errors
ca: detecta línies noves o modificades que tenen errors d'espai en blanc

source: ignore changes in whitespace when finding context
ca: ignora els canvis d'espai en blanc al cercar context

source: apply the patch in reverse
ca: aplica el pedaç al revés

source: don't expect at least one line of context
ca: no esperis almenys una línia de context

source: leave the rejected hunks in corresponding *.rej files
ca: deixa els trossos rebutjats en fitxers *.reg coresspondents

source: allow overlapping hunks
ca: permet trossos encavalcants

source: tolerate incorrectly detected missing new-line at the end of file
ca: tolera una línia nova incorrectament detectada al final del fitxer

source: do not trust the line counts in the hunk headers
ca: no confiïs en els recomptes de línia en les capçaleres dels trossos

source: root
ca: arrel

source: prepend <root> to all filenames
ca: anteposa <arrel> a tots els noms de fitxer

source: --3way outside a repository
ca: --3way fora d'un repositori

source: --index outside a repository
ca: --index fora d'un repositori

source: --cached outside a repository
ca: --cached fora d'un repositori

source: can't open patch '%s'
ca: no es pot obrir el pedaç '%s'

source: squelched %d whitespace error
ca: %d error d'espai en blanc omès

source: %d line adds whitespace errors.
ca: %d línia afegeix errors d'espai en blanc.

source: could not create archive file '%s'
ca: no es pot crear el fitxer d'arxiu '%s'

source: could not redirect output
ca: no s'ha pogut redirigir la sortida

source: git archive: Remote with no URL
ca: git archive: Remot sense URL

source: git archive: expected ACK/NAK, got EOF
ca: git archive: ACK/NAK esperat, EOF rebut

source: git archive: NACK %s
ca: git archive: %s NACK

source: remote error: %s
ca: error remot: %s

source: git archive: protocol error
ca: git archive: error de protocol

source: git archive: expected a flush
ca: git archive: rentada esperada

source: perform 'git bisect next'
ca: realitza 'git bisect next'

source: update BISECT_HEAD instead of checking out the current commit
ca: actualitza BISECT_HEAD en lloc d'agafar la comissió actual

source: git blame [options] [rev-opts] [rev] [--] file
ca: git blame [opcions] [opcions-de-revisió] [revisió] [--] fitxer

source: [rev-opts] are documented in git-rev-list(1)
ca: les [opcions-de-revisió] estàn documentades en git-rev-list(1)

source: Show blame entries as we find them, incrementally
ca: Mostra les entrades de culpa mentre les trobem, incrementalment

source: Show blank SHA-1 for boundary commits (Default: off)
ca: Mostra SHA-1 blanc en comissions de frontera (Per defecte: desactivat)

source: Do not treat root commits as boundaries (Default: off)
ca: No tractis les comissions d'arrel com límits (Per defecte: desactivat)

source: Show work cost statistics
ca: Mostra les estadístiques de preu de treball
