Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: Show output score for blame entries
ca: Mostra la puntuació de sortida de les entrades de culpa

source: Show original filename (Default: auto)
ca: Mostra el nom de fitxer original (Per defecte: automàtic)

source: Show original linenumber (Default: off)
ca: Mostra el número de línia original (Per defecte: desactivat)

source: Show in a format designed for machine consumption
ca: Presenta en un format dissenyat per consumpció per màquina

source: Show porcelain format with per-line commit information
ca: Mostra el format de porcellana amb informació de comissió per línia

source: Use the same output mode as git-annotate (Default: off)
ca: Utilitza el mateix mode de sortida que git-annotate (Per defecte: desactivat)

source: Show raw timestamp (Default: off)
ca: Mostra la marca de temps crua (Per defecte: desactivat)

source: Show long commit SHA1 (Default: off)
ca: Mostra l'SHA1 de comissió llarg (Per defecte: desactivat)

source: Suppress author name and timestamp (Default: off)
ca: Omet el nom d'autor i la marca de temps (Per defecte: desactivat)

source: Show author email instead of name (Default: off)
ca: Mostra l'adreça de correu electrònic de l'autor en lloc del nom (Per defecte: desactivat)

source: Ignore whitespace differences
ca: Ignora les diferencies d'espai en blanc

source: Spend extra cycles to find better match
ca: Gasta cicles extres per a trobar una coincidència millora

source: Use revisions from <file> instead of calling git-rev-list
ca: Utilitza les revisions de <file> en lloc d'invocar git-rev-list

source: Use <file>'s contents as the final image
ca: Utilitza els continguts de <file> com l'imatge final

source: score
ca: puntuació

source: Find line copies within and across files
ca: Troba còpies de línia dins i a través de fitxers

source: Find line movements within and across files
ca: Troba moviments de línia dins i a través de fitxers

source: Process only line range n,m, counting from 1
ca: Processa només el rang de línies n,m, contant des de 1

source: 4 years, 11 months ago
ca: fa 4 anys, 11 mesos

source: git branch [options] [-r | -a] [--merged | --no-merged]
ca: git branch [opcions] [-r | -a] [--merged | --no-merged]

source: git branch [options] [-l] [-f] <branchname> [<start-point>]
ca: git branch [opcions] [-l] [-f] <nom-de-rama> [<punt-inicial>]

source: git branch [options] [-r] (-d | -D) <branchname>...
ca: git branch [opcions] [-r] (-d | -D) <nom-de-rama>...

source: git branch [options] (-m | -M) [<oldbranch>] <newbranch>
ca: git branch [opcions] (-m | -M) [<rama-antiga>] <rama-nova>

source: deleting branch '%s' that has been merged to '%s', but not yet merged to HEAD.
ca: suprimint la rama '%s' que s'ha fusionat a '%s', però encara no fusionat a HEAD.

source: not deleting branch '%s' that is not yet merged to '%s', even though it is merged to HEAD.
ca: no suprimint la rama '%s' que encara no s'ha fusionat a '%s', encara que està fusionat a HEAD.

source: Couldn't look up commit object for '%s'
ca: No s'ha pogut trobar l'objecte de comissió de '%s'

source: The branch '%s' is not fully merged. If you are sure you want to delete it, run 'git branch -D %s'.
ca: La rama '%s' no està totalment fusionada. Si esteu segur que la voleu suprimir, executeu 'git branch -D %s'.

source: Update of config-file failed
ca: L'actualització del fitxer de configuració ha fallat

source: cannot use -a with -d
ca: no es pot utilitzar -a amb -d

source: Couldn't look up commit object for HEAD
ca: No s'ha pogut trobar l'objecte de comissió de HEAD

source: Cannot delete the branch '%s' which you are currently on.
ca: No es pot suprimir la rama '%s' en que esteu actualment.

source: remote branch '%s' not found.
ca: rama remota '%s' no trobada.

source: branch '%s' not found.
ca: rama '%s' no trobada

source: Error deleting remote branch '%s'
ca: Error al suprimir la rama remota '%s'

source: Error deleting branch '%s'
ca: Error al suprimir la rama '%s'

source: Deleted remote branch %s (was %s).
ca: S'ha suprimit la rama remota %s (ha estat %s).

source: Deleted branch %s (was %s).
ca: S'ha suprimit la rama %s (ha estat %s).

source: branch '%s' does not point at a commit
ca: la rama '%s' no assenyala una comissió

source: [%s: gone]
ca: [%s: no està]

source: [%s: behind %d]
ca: [%s: darrere per %d]

source: [behind %d]
ca: [darrere de %d]

source: [%s: ahead %d]
ca: [%s: davant per %d]

source: [ahead %d]
ca: [davant per %d]

source: [%s: ahead %d, behind %d]
ca: [%s: davant %d, darrere %d]

source: [ahead %d, behind %d]
ca: [davant %d, darrere %d]

source: **** invalid ref ****
ca: **** referència invàlida ****

source: (no branch, rebasing %s)
ca: (cap rama, rebasant %s)

source: (no branch, bisect started on %s)
ca: (cap rama, bisecció començada en %s)

source: (detached from %s)
ca: (separat de %s)

source: (no branch)
ca: (cap rama)

source: object '%s' does not point to a commit
ca: l'objecte '%s' no assenyala cap comissió

source: some refs could not be read
ca: algunes referències no s'han pogut llegir

source: cannot rename the current branch while not on any.
ca: no es pot canviar el nom de la rama actual mentre no estar en ninguna.

source: Invalid branch name: '%s'
ca: Nom de rama invàlid: '%s'

source: Branch rename failed
ca: El canvi de nom de rama ha fallat

source: Renamed a misnamed branch '%s' away
ca: S'ha canviat el nom de la rama malanomenada '%s'

source: Branch renamed to %s, but HEAD is not updated!
ca: S'ha canviat el nom de la rama a %s, però HEAD no està actualitzat!

source: Branch is renamed, but update of config-file failed
ca: La ramà està canviada de nom, però l'actualització del fitxer de configuració ha fallat

source: malformed object name %s
ca: nom d'objecte %s malformat

source: could not write branch description template: %s
ca: no s'ha pogut escriure la plantilla de descripció de rama: %s

source: Generic options
ca: Opcions genèriques

source: show hash and subject, give twice for upstream branch
ca: mostra el hash i el tema, doneu dos vegades per la rama font

source: suppress informational messages
ca: omet els missatges informatius

source: set up tracking mode (see git-pull(1))
ca: configura el mode de seguiment (veu git-pull(1))

source: change upstream info
ca: canvia la informació de font

source: use colored output
ca: utilitza sortida colorada

source: act on remote-tracking branches
ca: actua en rames amb seguiment remot

source: commit
ca: comissió

source: print only branches that contain the commit
ca: imprimeix només les rames que continguin la comissió

source: Specific git-branch actions:
ca: Accions de git-branch específiques:

source: list both remote-tracking and local branches
ca: llista ambdós les rames amb seguiment remot i les locals

source: delete fully merged branch
ca: suprimeix la rama si completament fusionada

source: delete branch (even if not merged)
ca: suprimeix la rama (encara que no estigui fusionada)

source: move/rename a branch and its reflog
ca: mou/canvia de nom una rama i el seu registre de referència

source: move/rename a branch, even if target exists
ca: mou/canvia de nom una rama, encara que el destí existeixi

source: list branch names
ca: llista els noms de rama

source: create the branch's reflog
ca: crea el registre de referència de la rama

source: edit the description for the branch
ca: edita la descripció de la rama

source: force creation (when already exists)
ca: força creació (quan ja existeix)

source: print only not merged branches
ca: imprimeix només les rames sense fusionar

source: print only merged branches
ca: imprimeix només les rames fusionades

source: list branches in columns
ca: llista les rames en columnes

source: Failed to resolve HEAD as a valid ref.
ca: S'ha fallat al resoldre HEAD com referència vàlida.

source: HEAD not found below refs/heads!
ca: HEAD no trobat baix refs/heads!

source: --column and --verbose are incompatible
ca: --column i --verbose són incompatibles

source: branch name required
ca: cal el nom de rama

source: Cannot give description to detached HEAD
ca: No es pot donar descripció a un HEAD separat

source: cannot edit description of more than one branch
ca: no es pot editar la descripció de més d'una rama

source: No commit on branch '%s' yet.
ca: Encara cap comissió en la rama '%s'.

source: No branch named '%s'.
ca: Cap rama amb nom '%s'.

source: too many branches for a rename operation
ca: massa rames per a una operació de canvi de nom

source: too many branches to set new upstream
ca: massa rames per a establir una nova font

source: could not set upstream of HEAD to %s when it does not point to any branch.
ca: no s'ha pogut establir la font de HEAD com %s quan no assenyala cap rama.

source: no such branch '%s'
ca: cap rama així '%s'

source: branch '%s' does not exist
ca: la rama '%s' no existeix

source: too many branches to unset upstream
ca: massa rames per a desestablir la font

source: could not unset upstream of HEAD when it does not point to any branch.
ca: no s'ha pogut desestablir la font de HEAD quan no assenyala cap rama.

source: Branch '%s' has no upstream information
ca: La rama '%s' no té informació de font

source: it does not make sense to create 'HEAD' manually
ca: no té sentit crear 'HEAD' manualment

source: -a and -r options to 'git branch' do not make sense with a branch name
ca: les opcions -a i -r a 'git branch' no tenen sentit amb un nom de rama

source: The --set-upstream flag is deprecated and will be removed. Consider using --track or --set-upstream-to
ca: La bandera --set-upstream està desaprovada i es traurà. Considereu utilitzar --track o --set-upstream-to

source: If you wanted to make '%s' track '%s', do this:
ca: Si volíeu fer '%s' seguir '%s', feu això:

source: %s is okay
ca: %s està bé

source: Need a repository to create a bundle.
ca: Cal un repositori per fer un embolic.

source: Need a repository to unbundle.
ca: Cal un repositori per desembolicar.

source: git cat-file (-t|-s|-e|-p|<type>|--textconv) <object>
ca: git cat-file (-t|-s|-e|-p|<tipus>|--textconv) <objecte>

source: git cat-file (--batch|--batch-check) < <list_of_objects>
ca: git cat-file (--batch|--batch-check) < <llista_de_objectes>

source: <type> can be one of: blob, tree, commit, tag
ca: <tipus> pot ser un de: blob, tree, commit, tag

source: show object type
ca: mostra el tipus de l'objecte

source: show object size
ca: mostra la mida de l'objecte

source: exit with zero when there's no error
ca: surt amb zero quan no hi ha error

source: pretty-print object's content
ca: imprimeix bellament el contingut de l'objecte

source: for blob objects, run textconv on object's content
ca: en els objectes de blob, executa textconv en el contingut de l'objecte

source: show info and content of objects fed from the standard input
ca: mostra la informació i contingut dels objectes rebuts de l'entrada estàndard

source: show info about objects fed from the standard input
ca: mostra informació sobre els objectes rebuts de l'entrada estàndard

source: git check-attr [-a | --all | attr...] [--] pathname...
ca: git check-attr [-a | --all | atribut...] [--] nom-de-ruta...

source: git check-attr --stdin [-z] [-a | --all | attr...] < <list-of-paths>
ca: git check-attr --stdin [-z] [-a | --all | atribut...] < <llista-de-rutes>

source: report all attributes set on file
ca: informa de tots els atributs establerts en el fitxer

source: use .gitattributes only from the index
ca: utilitza .gitattributes només des de l'índex

source: read file names from stdin
ca: llegeix els noms de fitxer de stdin

source: terminate input and output records by a NUL character
ca: termina els registres d'entrada i de salida per un caràcter NUL

source: suppress progress reporting
ca: omet el reportatge de progrés

source: show non-matching input paths
ca: mostra les rutes d'entrada que no coincideixen

source: ignore index when checking
ca: ignora l'índex al comprovar

source: cannot specify pathnames with --stdin
ca: no es pot especificar noms de ruta amb --stdin

source: -z only makes sense with --stdin
ca: -z només té sentit amb --stdin

source: no path specified
ca: cap ruta especificada

source: --quiet is only valid with a single pathname
ca: --quiet només és vàlid amb un nom de ruta solter

source: cannot have both --quiet and --verbose
ca: no es pot tenir ambdós --quiet i --verbose

source: --non-matching is only valid with --verbose
ca: --non-matching és vàlid només amb --verbose

source: git check-mailmap [options] <contact>...
ca: git check-mailmap [opcions] <contacte>...

source: also read contacts from stdin
ca: també llegeix els contactes des de stdin

source: unable to parse contact: %s
ca: incapaç d'analitzar el contacte: %s

source: no contacts specified
ca: cap contacte especificat

source: git checkout-index [options] [--] [<file>...]
ca: git checkout-index [opcions] [--] [<fitxer>...]

source: check out all files in the index
ca: agafa tots els fitxers en l'índex

source: force overwrite of existing files
ca: força la sobreescriptura de fitxers existents

source: no warning for existing files and files not in index
ca: cap avís per a fitxers existents i fitxers no en l'índex

source: don't checkout new files
ca: no agafis fitxers nous

source: update stat information in the index file
ca: actualitza la informació d'estadístiques en el fitxer d'índex

source: read list of paths from the standard input
ca: llegeix la llista de rutes des de l'entrada estàndard

source: write the content to temporary files
ca: escriu el contingut a fitxers temporals

source: string
ca: cadena

source: when creating files, prepend <string>
ca: al crear fitxers, anteposa <cadena>

source: copy out the files from named stage
ca: copia els fitxers des de l'etapa anomenada

source: git checkout [options] <branch>
ca: git checkout [opcions] <rama>

source: git checkout [options] [<branch>] -- <file>...
ca: git checkout [opcions] [<rama>] -- <fitxer>...

source: path '%s' does not have our version
ca: la ruta '%s' no té la versió nostra

source: path '%s' does not have their version
ca: la ruta '%s' no té la versió seva

source: path '%s' does not have all necessary versions
ca: la ruta '%s' no té totes les versions necessàries

source: path '%s' does not have necessary versions
ca: la ruta '%s' no té les versions necessàries

source: path '%s': cannot merge
ca: ruta '%s': no es pot fusionar

source: Unable to add merge result for '%s'
ca: Incapaç d'afegir el resultat de fusió per a '%s'

source: '%s' cannot be used with updating paths
ca: '%s' no es pot utilitzar al actualitzar rutes

source: '%s' cannot be used with %s
ca: '%s' no es pot utilitzar amb %s

source: Cannot update paths and switch to branch '%s' at the same time.
ca: No es pot actualitzar les rutes i canviar a la rama '%s' a la vegada.

source: corrupt index file
ca: fitxer d'índex corrupte

source: path '%s' is unmerged
ca: la ruta '%s' està sense fusionar

source: you need to resolve your current index first
ca: heu de resoldre el vostre índex actual primer

source: Can not do reflog for '%s'
ca: No es pot fer reflog per a '%s'

source: HEAD is now at
ca: HEAD ara està a

source: Reset branch '%s'
ca: Restableix la rama '%s'

source: Already on '%s'
ca: Ja en '%s'

source: Switched to and reset branch '%s'
ca: Rama '%s' agafat i restablit

source: Switched to a new branch '%s'
ca: Rama nova '%s' agafada

source: Switched to branch '%s'
ca: Rama '%s' agafada

source: ... and %d more.
ca: ... i %d més.

source: Warning: you are leaving %d commit behind, not connected to any of your branches: %s
ca: Avís: esteu deixant %d comissió darrere, no connectada a qualsevulla de les vostres rames: %s

source: If you want to keep them by creating a new branch, this may be a good time to do so with: git branch new_branch_name %s
ca: Si els voleu retenir per crear una rama nova, ara pot ser una hora bona per fer això amb: git branch new_branch_name %s

source: internal error in revision walk
ca: error intern en el passeig per revisions

source: Previous HEAD position was
ca: La posició de HEAD anterior ha estat

source: You are on a branch yet to be born
ca: Esteu en una rama que encara ha de naixer

source: only one reference expected, %d given.
ca: només una referència esperada, %d donades.

source: invalid reference: %s
ca: referència invàlida: %s

source: reference is not a tree: %s
ca: la referéncia no és un arbre: %s

source: paths cannot be used with switching branches
ca: les rutes no es poden utilitzar amb canvi de rama

source: '%s' cannot be used with switching branches
ca: '%s' no es pot utilitzar amb canvi de rama

source: '%s' cannot be used with '%s'
ca: '%s' no es pot utilitzar amb '%s'

source: Cannot switch branch to a non-commit '%s'
ca: No es pot canviar la rama a un no comissió '%s'

source: branch
ca: rama

source: create and checkout a new branch
ca: crea i agafa una rama nova

source: create/reset and checkout a branch
ca: crea/restableix i agafa una rama

source: create reflog for new branch
ca: Crea un registre de referència per a la rama nova

source: detach the HEAD at named commit
ca: separa el HEAD a la comissió anomenada

source: set upstream info for new branch
ca: estableix la informació de font de la rama nova

source: new-branch
ca: nova-rama

source: new unparented branch
ca: nova rama sense pares

source: checkout our version for unmerged files
ca: agafa la versió nostra de fitxers sense fusionar

source: checkout their version for unmerged files
ca: agafa la versió seva de fitxers sense fusionar

source: force checkout (throw away local modifications)
ca: agafa a la força (descarta qualsevulles modificacions locals)

source: perform a 3-way merge with the new branch
ca: realitza una fusió de 3 vies amb la rama nova

source: update ignored files (default)
ca: actualitza els fitxers ignorats (per defecte)

source: style
ca: estil

source: conflict style (merge or diff3)
ca: estil de conflicte (fusió o diff3)

source: do not limit pathspecs to sparse entries only
ca: no limitis les especificacions de ruta a entrades escasses només

source: second guess 'git checkout no-such-branch'
ca: dubta 'git checkout cap-rama-així'

source: -b, -B and --orphan are mutually exclusive
ca: -b, -B i --orphan són mutualment exclusius

source: --track needs a branch name
ca: --track necessita un nom de rama

source: Missing branch name; try -b
ca: Manca el nom de rama; proveu -b

source: invalid path specification
ca: especificació de ruta invàlida

source: Cannot update paths and switch to branch '%s' at the same time. Did you intend to checkout '%s' which can not be resolved as commit?
ca: No es pot actualitzar rames i canviar a la rama '%s' a la vegada. Volíeu agafar '%s' la qual no es pot resoldre com comissió?

source: git checkout: --detach does not take a path argument '%s'
ca: git checkout: --detach no accepta un paràmetre de ruta '%s'

source: git checkout: --ours/--theirs, --force and --merge are incompatible when checking out of the index.
ca: git checkout: --ours/--theirs, --force i --merge són incompatibles al agafar de l'índex.

source: git clean [-d] [-f] [-i] [-n] [-q] [-e <pattern>] [-x | -X] [--] <paths>...
ca: git clean [-d] [-f] [-i] [-n] [-q] [-e <patró>] [-x | -X] [--] <rutes>...

source: Removing %s
ca: Traient %s

source: Would remove %s
ca: Trauria %s

source: Skipping repository %s
ca: Saltant el repositori %s

source: Would skip repository %s
ca: Saltaria el repositori %s

source: failed to remove %s
ca: s'ha fallat al treure %s

source: Prompt help: 1 - select a numbered item foo - select item based on unique prefix - (empty) select nothing
ca: Ajuda d'avís: 1 - selecciona un ítem numerat foo - selecciona un ítem basat en un prefix únic - (buit) selecciona res

source: Prompt help: 1 - select a single item 3-5 - select a range of items 2-3,6-9 - select multiple ranges foo - select item based on unique prefix -... - unselect specified items * - choose all items - (empty) finish selecting
ca: Ajuda d'avís: 1 - selecciona un ítem solter 3-5 - selecciona un rang d'ítems 2-3,6-9 - selecciona múltiples rangs foo - selecciona un ítem basat en un prefix únic -... - desselecciona els ítems seleccionats * - tria tots els ítems - (buit) termina la selecció

source: Huh (%s)?
ca: Perdó (%s)?

source: Input ignore patterns>>
ca: Introduïu patrons que ignorar>>

source: WARNING: Cannot find items matched by: %s
ca: AVÍS: No es pot trobar ítems que coincideixen amb: %s

source: Select items to delete
ca: Selecciona els ítems que suprimir

source: remove %s?
ca: treure %s?

source: Bye.
ca: Adéu.

source: clean - start cleaning filter by pattern - exclude items from deletion select by numbers - select items to be deleted by numbers ask each - confirm each deletion (like "rm -i") quit - stop cleaning help - this screen ? - help for prompt selection
ca: clean - comença a netejar filter by pattern - exclou ítems de supressió select by numbers - selecciona ítems que suprimir per números ask each - confirma cada supressió (com a "rm -i") quit - deixa de netejar help - aquesta pantalla ? - ajuda per selecció de l'avís

source: *** Commands ***
ca: *** Ordres ***

source: What now
ca: Què ara

source: Would remove the following item:
ca: Trauria l'ítem següent:

source: No more files to clean, exiting.
ca: No hi ha més fitxers que netejar; sortint.

source: do not print names of files removed
ca: no imprimeixis els noms dels fitxers trets

source: force
ca: força

source: interactive cleaning
ca: neteja interactiva

source: remove whole directories
ca: treu directoris enters

source: pattern
ca: patró

source: add <pattern> to ignore rules
ca: afegiu <patró> per ignorar les regles

source: remove ignored files, too
ca: treu els fitxers ignorats, també

source: remove only ignored files
ca: treu només els fitxers ignorats

source: -x and -X cannot be used together
ca: -x i -X no es poden utilitzar junts

source: clean.requireForce set to true and neither -i, -n, nor -f given; refusing to clean
ca: clean.requireForce estaberta a veritat i ni -i, -n ni -f donat; refusant netejar

source: clean.requireForce defaults to true and neither -i, -n, nor -f given; refusing to clean
ca: clean.requireForce és per defecte veritat i ni -i, -n ni -f donat; refusant netejar

source: git clone [options] [--] <repo> [<dir>]
ca: git clone [opcions] [--] <repositori> [<directori>]

source: force progress reporting
ca: força l'informe de progrés

source: don't create a checkout
ca: no fes una agafada

source: create a bare repository
ca: crea un repositori nu

source: create a mirror repository (implies bare)
ca: crea un repositori reflectit (implica nu)

source: to clone from a local repository
ca: per a clonar des d'un repositori local

source: don't use local hardlinks, always copy
ca: no utilitzeu enllaços durs locals, sempre copia

source: setup as shared repository
ca: configura com repositori compartit

source: initialize submodules in the clone
ca: initialitza els submòduls en el clon

source: template-directory
ca: directori-de-plantilla

source: directory from which templates will be used
ca: directori del qual les plantilles s'utilitzaran

source: reference repository
ca: repositori de referència

source: name
ca: nom

source: use <name> instead of 'origin' to track upstream
ca: utilitza <nom> en lloc de 'origin' per seguir la font

source: checkout <branch> instead of the remote's HEAD
ca: agafa <rama> en lloc del HEAD del remot

source: path to git-upload-pack on the remote
ca: ruta a git-upload-pack en el remot

source: depth
ca: profunditat

source: create a shallow clone of that depth
ca: crea un clon superficial de tal profunditat

source: clone only one branch, HEAD or --branch
ca: cona només una rama, HEAD o --branch

source: gitdir
ca: directori de git

source: separate git dir from working tree
ca: separa el directori de git de l'arbre de treball
