Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: key=value
ca: calu=valor

source: set config inside the new repository
ca: estableix la configuració dins del repositori nou

source: reference repository '%s' is not a local repository.
ca: el repositori de referència '%s' no és un repositori local.

source: reference repository '%s' is shallow
ca: el repositori de referència '%s' és superficial

source: reference repository '%s' is grafted
ca: el repositori de referència '%s' és empeltat

source: failed to create directory '%s'
ca: s'ha fallat al crear el directori '%s'

source: failed to stat '%s'
ca: s'ha fallat al fer stat a '%s'

source: %s exists and is not a directory
ca: %s existeix i no és un directori

source: failed to stat %s
ca: s'ha fallat al fer stat a '%s'

source: failed to create link '%s'
ca: s'ha fallat al crear l'enllaç '%s'

source: failed to copy file to '%s'
ca: s'ha fallat al copiar el fitxer a '%s'

source: done.
ca: fet.

source: Clone succeeded, but checkout failed. You can inspect what was checked out with 'git status' and retry the checkout with 'git checkout -f HEAD'
ca: La clonació ha tingut éxit, però l'agafada ha fallat. Podeu inspeccionar què s'ha agafat amb 'git status' i reintentar l'agafada amb 'git checkout -f HEAD'

source: Could not find remote branch %s to clone.
ca: No s'ha pogut trobar la rama remota %s per a clonar.

source: Checking connectivity...
ca: Provant connectivitat...

source: remote did not send all necessary objects
ca: el remot no ha enviat tots els objectes necessaris

source: remote HEAD refers to nonexistent ref, unable to checkout.
ca: el HEAD remot es refereix a una referència que no existeix; incapaç d'agafar.

source: unable to checkout working tree
ca: incapaç d'agafar l'arbre de treball

source: Too many arguments.
ca: Massa paràmetres.

source: You must specify a repository to clone.
ca: Heu d'especificar un repositori que clonar.

source: --bare and --origin %s options are incompatible.
ca: les opcions --bare i --origin %s són incompatibles.

source: --bare and --separate-git-dir are incompatible.
ca: --bare i --separate-git-dir són incompatibles.

source: repository '%s' does not exist
ca: el repositori '%s' no existeix

source: depth %s is not a positive number
ca: la profunditat %s no és nombre positiu

source: destination path '%s' already exists and is not an empty directory.
ca: la ruta destí '%s' ja existeix i no és un directori buit.

source: working tree '%s' already exists.
ca: l'arbre de treball '%s' ja existeix.

source: could not create leading directories of '%s'
ca: no s'ha pogut crear els directoris inicials de '%s'

source: could not create work tree dir '%s'.
ca: no s'ha pogut crear el directori d'arbre de treball '%s'.

source: Cloning into bare repository '%s'...
ca: Clonant al repositori nu '%s'...

source: Cloning into '%s'...
ca: Clonant a '%s'...

source: --depth is ignored in local clones; use file:// instead.
ca: --depth s'ignora en clons locals; utilitzeu file:// en lloc.

source: source repository is shallow, ignoring --local
ca: el repositori font és superficial, ignorant --local

source: --local is ignored
ca: --local s'ignora

source: Don't know how to clone %s
ca: No es sap com clonar %s

source: Remote branch %s not found in upstream %s
ca: La rama remota %s no es troba en la font %s

source: You appear to have cloned an empty repository.
ca: Sembla que heu clonat un repositori buit.

source: git column [options]
ca: git column [opcions]

source: lookup config vars
ca: cerca els variables de configuració

source: layout to use
ca: pla que utilitzar

source: Maximum width
ca: Amplada màxima

source: Padding space on left border
ca: Espai d'encoixinada en el marge esquerre

source: Padding space on right border
ca: Espai d'encoixinada en el marge dret

source: Padding space between columns
ca: Espai d'encoixinada entre columnes

source: --command must be the first argument
ca: --command ha de ser el primer paràmetre

source: git commit [options] [--] <pathspec>...
ca: git commit [opcions] [--] <especificació-de-ruta>...

source: git status [options] [--] <pathspec>...
ca: git status [opcions] [--] <especificació-de-ruta>...

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly: git config --global user.name "Your Name" git config --global user.email you@example.com After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
ca: S'han configurat el vostre nom i adreça de correu electrònic automàticament basats en el vostre nom d'usuari i nom de host. Si us plau, comproveu que siguin correctes. Podeu suprimir aquest missatge per establir-los explícitament: git config --global user.name "El Vostre Nom" git config --global user.email tu@example.com Després de fer això, podeu arreglar la identitat utilitzada per a aquesta comissió amb: git commit --amend --reset-author

source: You asked to amend the most recent commit, but doing so would make it empty. You can repeat your command with --allow-empty, or you can remove the commit entirely with "git reset HEAD^".
ca: Heu demanat esmenar la comissió més recent, però fer això la feria buida. Podeu repetir el vostre ordre amb --allow-empty, o podeu treure la comissió per complet amb "git reset HEAD^".

source: The previous cherry-pick is now empty, possibly due to conflict resolution. If you wish to commit it anyway, use: git commit --allow-empty
ca: El recull de cireres previ ja està buit, possiblement a causa de resolució de conflicte. Si el voleu cometre de totes maneres, utilitzeu: git commit --allow-empty

source: Otherwise, please use 'git reset'
ca: D'altra manera, si us plau, utilitzeu 'git reset'

source: If you wish to skip this commit, use: git reset Then "git cherry-pick --continue" will resume cherry-picking the remaining commits.
ca: Si voleu saltar aquesta comissió, utilitzeu: git reset Llavors "git cherry-pick --continue" reprendrà recollint com cireres les comissions restants.

source: failed to unpack HEAD tree object
ca: s'ha fallat al desempaquetar l'objecte d'arbre HEAD

source: unable to create temporary index
ca: incapaç de crear un índex temporal

source: interactive add failed
ca: l'afegiment interactiu ha fallat

source: unable to write new_index file
ca: incapaç d'escriure el fitxer new_index

source: cannot do a partial commit during a merge.
ca: no es pot fer una comissió parcial durant una fusió.

source: cannot do a partial commit during a cherry-pick.
ca: no es pot fer una comissió parcial durant un recull de cireres.

source: cannot read the index
ca: no es pot llegir l'índex

source: unable to write temporary index file
ca: incapaç d'escriure un fitxer d'índex temporal

source: invalid commit: %s
ca: comissió invàlida: %s

source: malformed --author parameter
ca: paràmetre --author malformat

source: invalid date format: %s
ca: format de data invàlid: %s

source: Malformed ident string: '%s'
ca: Cadena d'identificació malformada: '%s'

source: unable to select a comment character that is not used in the current commit message
ca: incapaç de seleccionar un caràcter de comentari que no sigui utilitzat en el missatge de comissió actual

source: could not lookup commit %s
ca: no s'ha pogut trobar la comissió %s

source: (reading log message from standard input)
ca: (llegint el missatge de registre de l'entrada estàndard)

source: could not read log from standard input
ca: no s'ha pogut llegir de l'entrada estàndard

source: could not read log file '%s'
ca: no s'ha pogut llegir el fitxer de registre '%s'

source: could not read MERGE_MSG
ca: no s'ha pogut llegir MERGE_MSG

source: could not read SQUASH_MSG
ca: no s'ha pogur llegir SQUASH_MSG

source: could not read '%s'
ca: no s'ha pogut llegir '%s'

source: could not write commit template
ca: no s'ha pogut escriure la plantilla de comissió

source: It looks like you may be committing a merge. If this is not correct, please remove the file %s and try again.
ca: Sembla que podeu estar cometent una fusió. Si això no és correcte, si us plau, treu el fitxer %s i intenteu de nou.

source: It looks like you may be committing a cherry-pick. If this is not correct, please remove the file %s and try again.
ca: Sembla que podeu estar cometent un recull de cireres. Si això no és correcte, si us plau treu el fitxer %s i intenteu de nou.

source: Please enter the commit message for your changes. Lines starting with '%c' will be ignored, and an empty message aborts the commit.
ca: Si us plau, introduïu el missatge de comissió dels vostres canvis. S'ignoraran les línies començant amb '%c', i un missatge de comissió buit avorta la comissió.

source: Please enter the commit message for your changes. Lines starting with '%c' will be kept; you may remove them yourself if you want to. An empty message aborts the commit.
ca: Si us plau, introduïu el missatge de comissió dels vostres canvis. Es retindran les línies començants amb '%c'; podeu treure'ls per vós mateix si voleu. Un missatge buit avorta la comissió.

source: %sAuthor: %.*s <%.*s>
ca: %sAutor: %.*s <%.*s>

source: %sDate: %s
ca: %sData: %s

source: %sCommitter: %.*s <%.*s>
ca: %sComitent: %.*s <%.*s>

source: Cannot read index
ca: No es pot llegir l'índex

source: Error building trees
ca: Error al construir arbres

source: Please supply the message using either -m or -F option.
ca: Si us plau, proveïu el missatge utilitzant l'opció o -m o l'opció -F.

source: No existing author found with '%s'
ca: Cap autor existent trobat amb '%s'

source: Invalid untracked files mode '%s'
ca: Mode de fitxers no seguits invàlid '%s'

source: --long and -z are incompatible
ca: --long i -z són incompatibles

source: Using both --reset-author and --author does not make sense
ca: Utilitzar ambdós --reset-author i --author no té sentit

source: You have nothing to amend.
ca: No teniu res que esmenar.

source: You are in the middle of a merge -- cannot amend.
ca: Esteu en el medi d'una fusió -- no es pot esmenar.

source: You are in the middle of a cherry-pick -- cannot amend.
ca: Esteu en el medi d'una cherry-pick -- no es pot esmenar.

source: Options --squash and --fixup cannot be used together
ca: Les opcions --squash i --fixup no es poden utilitzar junts

source: Only one of -c/-C/-F/--fixup can be used.
ca: Només un de -c/-C/-F/--fixup es pot utilitzar.

source: Option -m cannot be combined with -c/-C/-F/--fixup.
ca: L'opció -m no es pot combinar amb -c/-C/-F/--fixup.

source: --reset-author can be used only with -C, -c or --amend.
ca: --reset-author només es pot utilitzar amb -C, -c o --amend.

source: Only one of --include/--only/--all/--interactive/--patch can be used.
ca: Només un de --include/--only/--all/--interactive/--patch es pot utilitzar.

source: No paths with --include/--only does not make sense.
ca: --include/--only no té sentit sense ruta.

source: Clever... amending the last one with dirty index.
ca: Intel·ligent... esmenant el últim amb índex brut

source: Explicit paths specified without -i or -o; assuming --only paths...
ca: Rutes explícites especificades sense -i o -o; presumint rutes --only...

source: Invalid cleanup mode %s
ca: Mode de neteja invàlid %s

source: Paths with -a does not make sense.
ca: -a no té sentit amb rutes.

source: show status concisely
ca: mostra l'estat concisament

source: show branch information
ca: mostra la informació de rama

source: machine-readable output
ca: sortida llegible per màquina

source: show status in long format (default)
ca: mostra l'estat en format llarg (per defecte)

source: terminate entries with NUL
ca: termina les entrades amb NUL

source: show untracked files, optional modes: all, normal, no. (Default: all)
ca: mostra els fitxers no seguits, modes opcional: all, normal, no. (Per defecte: all)

source: show ignored files
ca: mostra els fitxers ignorats

source: when
ca: quan

source: ignore changes to submodules, optional when: all, dirty, untracked. (Default: all)
ca: ignora els canvis als submòduls, opcional quan: all, dirty, untracked. (Per defecte: all)

source: list untracked files in columns
ca: mostra els fitxers no seguits en columnes

source: couldn't look up newly created commit
ca: no s'ha pogut trobar la comissió novament creat

source: could not parse newly created commit
ca: no s'ha pogut analitzar la comissió novament creat

source: detached HEAD
ca: HEAD separat

source: (root-commit)
ca: (comissió d'arrel)

source: suppress summary after successful commit
ca: omet el resum després d'una comissió reexita

source: show diff in commit message template
ca: mostra la diferència en la plantilla de missatge de comissió

source: Commit message options
ca: Opcions de missatge de comissió

source: read message from file
ca: llegiu el missatge des d'un fitxer

source: author
ca: autor

source: override author for commit
ca: autor corregit de la comissió

source: date
ca: data

source: override date for commit
ca: data corregida de la comissió

source: message
ca: missatge

source: commit message
ca: missatge de comissió

source: reuse and edit message from specified commit
ca: reutilitza i edit el missatge de la comissió especificada

source: reuse message from specified commit
ca: reutilitza el missatge de la comissió especificada

source: use autosquash formatted message to fixup specified commit
ca: utilitza el missatge formatat d'aixafada automàtica per arreglar la comissió especificada

source: use autosquash formatted message to squash specified commit
ca: utilitza el missatge formatat d'aixafada automàtica per aixafar la comissió especificada

source: the commit is authored by me now (used with -C/-c/--amend)
ca: l'autor de la comissió ja sóc jo (utilitzat amb -C/-c/--amend)

source: add Signed-off-by:
ca: afegeix Signed-off-by:

source: use specified template file
ca: utilitza el fitxer de plantilla especificat

source: force edit of commit
ca: edició de la comissió a la força

source: default
ca: per defecte

source: how to strip spaces and #comments from message
ca: com despullar els espais i #comentaris del missatge

source: include status in commit message template
ca: inclou l'estat en la plantilla de missatge de comissió

source: key-id
ca: ID de clau

source: GPG sign commit
ca: firma la comissió amb GPG

source: Commit contents options
ca: Opcions dels continguts de les comissions

source: commit all changed files
ca: comet tots els fitxers canviats

source: add specified files to index for commit
ca: afegeix els fitxers especificats a l'índex per a cometre

source: interactively add files
ca: afegeix els fitxers interactivament

source: interactively add changes
ca: afegeix els canvis interactivament

source: commit only specified files
ca: comet només els fitxers especificats

source: bypass pre-commit hook
ca: evita el ganxo de precomissió

source: show what would be committed
ca: mostra què es cometria

source: amend previous commit
ca: esmena la comissió anterior

source: bypass post-rewrite hook
ca: evita el ganxo de postreescriure

source: ok to record an empty change
ca: bé registrar un canvi buit

source: ok to record a change with an empty message
ca: bé registrar un canvi amb missatge buit

source: could not parse HEAD commit
ca: no s'ha pogut analitzar la comissió HEAD

source: could not open '%s' for reading
ca: no s'ha pogut obrir '%s' per lectura

source: Corrupt MERGE_HEAD file (%s)
ca: Fitxer MERGE_HEAD corrupte (%s)

source: could not read MERGE_MODE
ca: no s'ha pogut llegir MERGE_MODE

source: could not read commit message: %s
ca: no s'ha pogut llegir el missatge de comissió: %s

source: Aborting commit; you did not edit the message.
ca: Avortant la comissió; no heu editat el missatge.

source: Aborting commit due to empty commit message.
ca: Avortant la comissió a causa d'un missatge de comissió buit.

source: failed to write commit object
ca: s'ha fallat al escriure l'objecte de comissió

source: cannot lock HEAD ref
ca: no es pot bloquejar la referència HEAD

source: cannot update HEAD ref
ca: no es pot actualitzar la referència HEAD

source: Repository has been updated, but unable to write new_index file. Check that disk is not full or quota is not exceeded, and then "git reset HEAD" to recover.
ca: S'ha actualitzat el repositori, però no es pot escriure el fitxer new_index. Comproveu que el disc no estigui ple i la quota no estigui excedit, i després "git reset HEAD" per recuperar.

source: git config [options]
ca: git config [opcions]

source: Config file location
ca: Ubicació del fitxer de configuració

source: use global config file
ca: utilitza el fitxer de configuració global

source: use system config file
ca: utilitza el fitxer de configuració del sistema

source: use repository config file
ca: utilitza el fitxer de configuració del repositori

source: use given config file
ca: utilitza el fitxer de configuració donat

source: blob-id
ca: ID de blob

source: read config from given blob object
ca: llegeix la configuració de l'objecte de blob donat

source: Action
ca: Acció

source: get value: name [value-regex]
ca: obtén valor: nom [regex-de-valors]

source: get all values: key [value-regex]
ca: obtén tots els valors: clau [regex-de-valors]

source: get values for regexp: name-regex [value-regex]
ca: obtén valors de regexp: regex-de-noms [regex-de-valors]

source: get value specific for the URL: section[.var] URL
ca: obtén el valor especific al URL: secció[.variable] URL

source: replace all matching variables: name value [value_regex]
ca: reemplaça tots els variables que coincideixen: nom valor [regex_de_valors]

source: add a new variable: name value
ca: afegeix un variable nou: nom valor

source: remove a variable: name [value-regex]
ca: treu un variable: nom [regex-de-valors]

source: remove all matches: name [value-regex]
ca: treu totes les coincidències: nom [regex-de-valors]

source: rename section: old-name new-name
ca: canvia el nom de secció: nom-antic nom-nou

source: remove a section: name
ca: treu una secció: nom

source: list all
ca: llista tots

source: open an editor
ca: obre un editor

source: slot
ca: ranura

source: find the color configured: [default]
ca: troba el color configurat: [per defecte]

source: find the color setting: [stdout-is-tty]
ca: troba l'ajust de color: [stdout-és-tty]

source: Type
ca: Tipus

source: value is "true" or "false"
ca: valor és "true" o "false"

source: value is decimal number
ca: valor és un nombre decimal

source: value is --bool or --int
ca: valor és --bool o --int

source: value is a path (file or directory name)
ca: valor és un path (nom de fitxer o directori)

source: Other
ca: Altre

source: terminate values with NUL byte
ca: termina els valors amb un octet NUL

source: respect include directives on lookup
ca: respecta les directives d'inclusió al cercar

source: print sizes in human readable format
ca: imprimeix les mides en un format llegible per humans

source: git describe [options] <commit-ish>*
ca: git describe [opcions] <comissió>*

source: git describe [options] --dirty
ca: git describe [opcions] --dirty

source: annotated tag %s not available
ca: l'etiqueta anotada %s no és disponible

source: annotated tag %s has no embedded name
ca: l'etiqueta anotada %s no té nom incrustat

source: tag '%s' is really '%s' here
ca: l'etiqueta '%s' realment és '%s' aquí

source: Not a valid object name %s
ca: %s no és un nom d'objecte vàlid

source: %s is not a valid '%s' object
ca: %s no és un objecte de '%s' vàlid

source: no tag exactly matches '%s'
ca: cap etiqueta coincideix exactament amb '%s'

source: searching to describe %s
ca: cercant per descriure %s

source: finished search at %s
ca: cerca terminada a %s

source: No annotated tags can describe '%s'. However, there were unannotated tags: try --tags.
ca: Cap etiqueta anotada pot descriure '%s'. No obstant, hi havia etiquetes no anotades: proveu --tags.

source: No tags can describe '%s'. Try --always, or create some tags.
ca: Cap etiqueta pot descriure '%s'. Proveu --always, o creeu algunes etiquetes.

source: traversed %lu commits
ca: %lu comissions travessades

source: more than %i tags found; listed %i most recent gave up search at %s
ca: s'ha trobat més de %i etiquetes: s'ha llistat les %i més recents cerca renunciada a %s

source: find the tag that comes after the commit
ca: troba l'etiqueta que vingui després de la comissió

source: debug search strategy on stderr
ca: estratègia de cerca de depuració en stderr

source: use any ref
ca: utilitza qualsevulla referència

source: use any tag, even unannotated
ca: utilitza qualsevulla etiqueta, encara les sense anotar

source: always use long format
ca: sempre utilitza el format llarg

source: only follow first parent
ca: només segueix el primer pare

source: only output exact matches
ca: emet només coincidències exactes

source: consider <n> most recent tags (default: 10)
ca: considera les <n> etiquetes més recents (per defecte: 10)

source: only consider tags matching <pattern>
ca: només considera les etiquetes que coincideixen amb <patró>

source: show abbreviated commit object as fallback
ca: mostra l'objecte de comissió abreviat com retrocediment

source: mark
ca: marca

source: append <mark> on dirty working tree (default: "-dirty")
ca: annexa <marca> en l'arbre de treball brut (per defecte: "-dirty")

source: --long is incompatible with --abbrev=0
ca: --long és incompatible amb --abbrev=0

source: No names found, cannot describe anything.
ca: Cap nom trobat, no es pot descriure res.

source: --dirty is incompatible with commit-ishes
ca: --dirty és incompatible amb les comissions

source: '%s': not a regular file or symlink
ca: '%s': no és un fitxer regular ni enllaç simbòlic

source: invalid option: %s
ca: opció invàlida: %s

source: Not a git repository
ca: No és un repositori de git

source: invalid object '%s' given.
ca: objecte invàlid '%s' donat.

source: more than two blobs given: '%s'
ca: més de dos blobs donats: '%s'

source: unhandled object '%s' given.
ca: objecte no manejat '%s' donat.

source: git fast-export [rev-list-opts]
ca: git fast-export [opcions-de-llista-de-revisions]

source: show progress after <n> objects
ca: mostra el progrés després de <n> objectes

source: select handling of signed tags
ca: selecciona el manejament de les etiquetes firmades

source: select handling of tags that tag filtered objects
ca: selecciona el manejament de les etiquetes que etiqueten objectes filtrats

source: Dump marks to this file
ca: Bolcar les marques a aquest fitxer

source: Import marks from this file
ca: Importa marques d'aquest fitxer

source: Fake a tagger when tags lack one
ca: Fingeix un etiquetador quan als etiquetes lis manca un

source: Output full tree for each commit
ca: Imprimeix l'arbre complet per cada comissió

source: Use the done feature to terminate the stream
ca: Utilitza la característica done per terminar el corrent

source: Skip output of blob data
ca: Salta l'emissió de dades de blob

source: refspec
ca: especificació de referència

source: Apply refspec to exported refs
ca: Aplica l'especificació de referència a les referències exportades

source: git fetch [<options>] [<repository> [<refspec>...]]
ca: git fetch [<opcions>] [<repositori> [<especificació-de-referència>...]]

source: git fetch [<options>] <group>
ca: git fetch [<opcions>] <grup>

source: git fetch --multiple [<options>] [(<repository> | <group>)...]
ca: git fetch --multiple [<opcions>] [(<repositori> | <grup>)...]

source: git fetch --all [<options>]
ca: git fetch --all [<opcions>]

source: fetch from all remotes
ca: obtén de tots els remots

source: append to .git/FETCH_HEAD instead of overwriting
ca: annexa a .git/FETCH_HEAD en lloc de sobreescriure

source: path to upload pack on remote end
ca: ruta a que pujar el paquet en el costat remot
