Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: Remote branch:%s
ca: Rama remota:%s

source: (status not queried)
ca: (estat no consultat)

source: Local branch configured for 'git pull':
ca: Rama local configurada per a 'git pull':

source: Local refs will be mirrored by 'git push'
ca: 'git push' reflectira les referències locals

source: Local ref configured for 'git push'%s:
ca: Referència local configurada per a 'git push'%s:

source: set refs/remotes/<name>/HEAD according to remote
ca: estableix refs/remotes/<name>/HEAD segons el remot

source: delete refs/remotes/<name>/HEAD
ca: suprimeix refs/remotes/<name>/HEAD

source: Cannot determine remote HEAD
ca: No es pot determinar el HEAD remot

source: Multiple remote HEAD branches. Please choose one explicitly with:
ca: Múltiples rames de HEAD remotes. Si us plau, trieu una explícitament amb:

source: Could not delete %s
ca: No s'ha pogut suprimir %s

source: Not a valid ref: %s
ca: No és una referència vàlida: %s

source: Could not setup %s
ca: No s'ha pogut configurar %s

source: %s will become dangling!
ca: %s es tornarà en penjant!

source: %s has become dangling!
ca: %s s'ha tornat en penjant!

source: Pruning %s
ca: Podant %s

source: * [would prune] %s
ca: * [podaria] %s

source: * [pruned] %s
ca: * [podat] %s

source: prune remotes after fetching
ca: poda els remots després d'obtenir-los

source: No such remote '%s'
ca: Cap remot així '%s'

source: add branch
ca: afegeix rama

source: no remote specified
ca: cap remot especificat

source: manipulate push URLs
ca: manipula els URL de pujada

source: add URL
ca: afegeix URL

source: delete URLs
ca: suprimeix URLs

source: --add --delete doesn't make sense
ca: --add --delete no té sentit

source: Invalid old URL pattern: %s
ca: Patró d'URL antic invàlid: %s

source: No such URL found: %s
ca: Cap URL així trobat: %s

source: Will not delete all non-push URLs
ca: Suprimirà tots els URL no de pujada

source: be verbose; must be placed before a subcommand
ca: sigues verbós; s'ha de col·locar abans d'un subordre

source: git repack [options]
ca: git repack [opcions]

source: pack everything in a single pack
ca: empaqueta tot en un paquet solter

source: same as -a, and turn unreachable objects loose
ca: el mateix que -a, i solta els objectes inabastables

source: remove redundant packs, and run git-prune-packed
ca: tragueu els paquets redundants, i executeu git-prune-packed

source: pass --no-reuse-delta to git-pack-objects
ca: passa --no-resuse-delta a git-pack-objects

source: pass --no-reuse-object to git-pack-objects
ca: passa --no-reuse-object a git-pack-objects

source: do not run git-update-server-info
ca: no executis git-update-server-info

source: pass --local to git-pack-objects
ca: passa --local a git-pack-objects

source: write bitmap index
ca: escriu índex de mapa de bits

source: approxidate
ca: aproximat

source: with -A, do not loosen objects older than this
ca: amb -A, no soltis objectes majors que aquest

source: size of the window used for delta compression
ca: mida de la ventana utilitzada per compressió de deltes

source: bytes
ca: octets

source: same as the above, but limit memory size instead of entries count
ca: ex mateix que l'anterior, però limita la mida de memòria en lloc del recompte d'entrades

source: limits the maximum delta depth
ca: limita la profunditat màxima dels deltes

source: maximum size of each packfile
ca: mida màxima de cada fitxer de paquet

source: repack objects in packs marked with .keep
ca: reempaqueta els objectes en paquets marcats amb .keep

source: removing '%s' failed
ca: la treta de '%s' ha fallat

source: git replace [-f] <object> <replacement>
ca: git replace [-f] <objecte> <reemplaçament>

source: git replace [-f] --edit <object>
ca: git replace [-f] --edit <objecte>

source: git replace [-f] --graft <commit> [<parent>...]
ca: git replace [-f] --graft <comissió> [<pare>...]

source: git replace -d <object>...
ca: git replace -d <objecte>...

source: git replace [--format=<format>] [-l [<pattern>]]
ca: git replace [--format=<format>] [-l [<patró>]]

source: Not a valid object name: '%s'
ca: No és un nom d'objecte vàlid: '%s'

source: bad mergetag in commit '%s'
ca: etiqueta de fusió dolenta en la comissió '%s'

source: malformed mergetag in commit '%s'
ca: etiqueta de fusió malformada en la comissió '%s'

source: original commit '%s' contains mergetag '%s' that is discarded; use --edit instead of --graft
ca: la comissió original '%s' conté l'etiqueta de fusió '%s' que es descarta; utilitzeu --edit en lloc de --graft

source: the original commit '%s' has a gpg signature.
ca: la comissió original '%s' té una firma gpg.

source: the signature will be removed in the replacement commit!
ca: la firma es traurà en la comissió de reemplaçament!

source: could not write replacement commit for: '%s'
ca: no s'ha pogut escriure la comissió de reemplaçament per a: '%s'

source: list replace refs
ca: llista les referències reemplaçades

source: delete replace refs
ca: suprimeix les referències reemplaçades

source: edit existing object
ca: edita un objecte existent

source: change a commit's parents
ca: canvia els pares d'una comissió

source: replace the ref if it exists
ca: reemplaça la referència si existeix

source: do not pretty-print contents for --edit
ca: no imprimeixis bellament els continguts per a --edit

source: use this format
ca: utilitza aquest format

source: register clean resolutions in index
ca: registre les resolucions netes en l'índex

source: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<commit>]
ca: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<comissió>]

source: git reset [-q] <tree-ish> [--] <paths>...
ca: git reset [-q] <arbre> [--] <rutes>...

source: git reset --patch [<tree-ish>] [--] [<paths>...]
ca: git reset --patch [<arbre>] [--] [<rutes>...]

source: mixed
ca: mixt

source: soft
ca: suau

source: hard
ca: dur

source: merge
ca: fusió

source: keep
ca: reteniment

source: You do not have a valid HEAD.
ca: No teniu un HEAD vàlid.

source: Failed to find tree of HEAD.
ca: S'ha fallat al trobar l'arbre de HEAD.

source: Failed to find tree of %s.
ca: S'ha fallat al trobar l'arbre de %s.

source: HEAD is now at %s
ca: HEAD ara està a %s

source: Cannot do a %s reset in the middle of a merge.
ca: No es pot fer un restabliment de %s en el medi d'una fusió.

source: be quiet, only report errors
ca: calla, només informa d'errors

source: reset HEAD and index
ca: restableix HEAD i l'índex

source: reset only HEAD
ca: restablex només HEAD

source: reset HEAD, index and working tree
ca: restableix HEAD, l'índex i l'arbre de treball

source: reset HEAD but keep local changes
ca: restableix HEAD però reté els canvis locals

source: record only the fact that removed paths will be added later
ca: registre només el fet de que les rutes tretes s'afegiran després

source: Failed to resolve '%s' as a valid revision.
ca: S'ha fallat al resoldre '%s' com revisió vàlida.

source: Could not parse object '%s'.
ca: No s'ha pogut analitzar l'objecte '%s'.

source: Failed to resolve '%s' as a valid tree.
ca: S'ha fallat al resoldre '%s' com arbre vàlid.

source: --patch is incompatible with --{hard,mixed,soft}
ca: --patch és incompatible amb --{hard,mixed,soft}

source: --mixed with paths is deprecated; use 'git reset -- <paths>' instead.
ca: --mixed amb rutes es desaprovat; utilitzeu 'git reset -- <paths>' en lloc.

source: Cannot do %s reset with paths.
ca: No es pot fer reinici de %s amb rutes.

source: %s reset is not allowed in a bare repository
ca: reset de %s no és permet en un repositori nu

source: -N can only be used with --mixed
ca: -N només es pot utilitzar amb --mixed

source: Unstaged changes after reset:
ca: Canvis no allistats després de restabliment:

source: Could not reset index file to revision '%s'.
ca: No s'ha pogut restablir el fitxer d'índex a la revisió '%s'.

source: Could not write new index file.
ca: No s'ha pogut escriure el fitxer d'índex nou.

source: git rev-parse --parseopt [options] -- [<args>...]
ca: git rev-parse --parseopt [opcions] -- [<paràmetres>...]

source: keep the `--` passed as an arg
ca: reté el `--` passat com paràmetre

source: stop parsing after the first non-option argument
ca: deixa d'analitzar després del primer paràmetre no d'opció

source: output in stuck long form
ca: emet en forma llarga enganxada

source: git rev-parse --parseopt [options] -- [<args>...] or: git rev-parse --sq-quote [<arg>...] or: git rev-parse [options] [<arg>...] Run "git rev-parse --parseopt -h" for more information on the first usage.
ca: git rev-parse --parseopt [opcions] -- [<paràmetres>...] or: git rev-parse --sq-quote [<paràmetre>...] or: git rev-parse [opcions] [<paràmetre>...] Executeu "git rev-parse --parseopt -h" per més informació sobre l'ús inicial.

source: git revert [options] <commit-ish>...
ca: git revert [opcions] <comissió>...

source: git revert <subcommand>
ca: git revert <subordre>

source: git cherry-pick [options] <commit-ish>...
ca: git cherry-pick [opcions] <comissió>...

source: git cherry-pick <subcommand>
ca: git cherry-pick <subordre>

source: %s: %s cannot be used with %s
ca: %s: %s no es pot utilitzar amb %s

source: end revert or cherry-pick sequence
ca: termina la seqüència de reversió o recull de cireres

source: resume revert or cherry-pick sequence
ca: reprèn la seqüència de reversió o recull de cireres

source: cancel revert or cherry-pick sequence
ca: cancel·la la seqüència de reversió o recull de cireres

source: don't automatically commit
ca: no cometis automàticament

source: edit the commit message
ca: edita el missatge de comissió

source: parent number
ca: número de pare

source: merge strategy
ca: estratègia de fusió

source: option
ca: opció

source: option for merge strategy
ca: opció d'estratègia de fusió

source: append commit name
ca: nom de la comissió que annexar

source: allow fast-forward
ca: permet l'avanç ràpid

source: preserve initially empty commits
ca: preserva les comissions inicialment buides

source: allow commits with empty messages
ca: permet les comissions amb missatges buits

source: keep redundant, empty commits
ca: retén les comissions redundants i buides

source: program error
ca: error de programa

source: revert failed
ca: la reversió ha fallat

source: cherry-pick failed
ca: el recull de cireres ha fallat

source: git rm [options] [--] <file>...
ca: git rm [opcions] [--] <fitxer>...

source: the following submodule (or one of its nested submodules) uses a .git directory:
ca: el submòdul següent (o un dels seus submòduls niats) utilitza un directori .git:

source: (use 'rm -rf' if you really want to remove it including all of its history)
ca: (utilitzeu 'rm -rf' si realment voleu treure'l, inclòs tota la seva història)

source: the following file has staged content different from both the file and the HEAD:
ca: el fitxer següent té contingut allistat diferent d'ambdós el fitxer i el HEAD:

source: (use -f to force removal)
ca: (utilitzeu -f per forçar la treta)

source: the following file has changes staged in the index:
ca: el fitxer següent té canvis allistats en l'índex:

source: (use --cached to keep the file, or -f to force removal)
ca: (utilitzeu --cached per desar el fitxer, o -f per forçar la treta)

source: the following file has local modifications:
ca: el fitxer següent té modificacions locals:

source: do not list removed files
ca: no llistis els fitxers trets

source: only remove from the index
ca: només treu de l'índex

source: override the up-to-date check
ca: passa per dalt la comprovació d'actualització

source: allow recursive removal
ca: permet treta recursiva

source: exit with a zero status even if nothing matched
ca: surt amb estat zero encara que res hagi coincidit

source: not removing '%s' recursively without -r
ca: no trent '%s' recursivament sense -r

source: git rm: unable to remove %s
ca: git rm: incapaç de treure %s

source: git shortlog [<options>] [<revision range>] [[--] [<path>...]]
ca: git shortlog [<opcions>] [<rang de revisions>] [[--] [<ruta>...]]

source: Missing author: %s
ca: Manca l'autor: %s

source: sort output according to the number of commits per author
ca: ordena la sortida segons el nombre de comissions per autor

source: Suppress commit descriptions, only provides commit count
ca: Omet les descripcions de comissió, només proveeix el recompte de comissions

source: Show the email address of each author
ca: Mostra l'adreça de correu electrònic de cada autor

source: Linewrap output
ca: Ajusta les línies de la sortida

source: git show-branch [-a|--all] [-r|--remotes] [--topo-order | --date-order] [--current] [--color[=<when>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<rev> | <glob>)...]
ca: git show-branch [-a|--all] [-r|--remotes] [--topo-order | --date-order] [--current] [--color[=<when>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<revisió> | <glob>)...]

source: git show-branch (-g|--reflog)[=<n>[,<base>]] [--list] [<ref>]
ca: git show-branch (-g|--reflog)[=<n>[,<base>]] [--list] [<referència>]

source: show remote-tracking and local branches
ca: mostra les rames amb seguiment remot i les locals

source: show remote-tracking branches
ca: mostra les rames amb seguiment remot

source: color '*!+-' corresponding to the branch
ca: colora '*!+-' corresponent a la rama

source: show <n> more commits after the common ancestor
ca: mostra <n> comissions després de l'avantpassat comú

source: synonym to more=-1
ca: sinònim de more=-1

source: suppress naming strings
ca: omet l'anomenament de cadenes

source: include the current branch
ca: inclou la rama actual

source: name commits with their object names
ca: anomena les comissions amb els seus noms d'objecte

source: show possible merge bases
ca: mostra els bases de fusió possibles

source: show refs unreachable from any other ref
ca: mostra les referències inabastables de qualsevulla altra referència

source: show commits in topological order
ca: mostra les comissions en ordre topològic

source: show only commits not on the first branch
ca: mostra només les comissions no en la primera rama

source: show merges reachable from only one tip
ca: mostra les fusions abastables de només una punta

source: topologically sort, maintaining date order where possible
ca: ordena topològicament, mantenint l'ordre de dates on possible

source: show <n> most recent ref-log entries starting at base
ca: mostra les <n> entrades més recents començant al base

source: git show-ref [-q|--quiet] [--verify] [--head] [-d|--dereference] [-s|--hash[=<n>]] [--abbrev[=<n>]] [--tags] [--heads] [--] [pattern*]
ca: git show-ref [-q|--quiet] [--verify] [--head] [-d|--dereference] [-s|--hash[=<n>]] [--abbrev[=<n>]] [--tags] [--heads] [--] [patró*]

source: git show-ref --exclude-existing[=pattern] < ref-list
ca: git show-ref --exclude-existing[=pattern] < llista-de-referències

source: only show tags (can be combined with heads)
ca: mostra només les etiquetes (pot combinar-se amb heads)

source: only show heads (can be combined with tags)
ca: mostra només els caps (pot combinar-se amb etiquetes)

source: stricter reference checking, requires exact ref path
ca: comprovació de referència més estricta, requereix la ruta de referència exacta

source: show the HEAD reference, even if it would be filtered out
ca: mostra la referència HEAD, encara que es filtraria

source: dereference tags into object IDs
ca: dereferencia les etiquetes a IDs d'objecte

source: only show SHA1 hash using <n> digits
ca: mostra el hash SHA1 només utilitzant <n> xifres

source: do not print results to stdout (useful with --verify)
ca: no imprimeixis els resultats a stdout (útil amb --verify)

source: show refs from stdin that aren't in local repository
ca: mostra les referència de stdin que no estan en el repositori local

source: git symbolic-ref [options] name [ref]
ca: git symbolic-ref [opcions] nom [referència]

source: git symbolic-ref -d [-q] name
ca: git symbolic-ref -d [-q] nom

source: suppress error message for non-symbolic (detached) refs
ca: omet el missatge d'error de referències no simbòliques (separades)

source: delete symbolic ref
ca: suprimeix la referència simbòlica

source: shorten ref output
ca: escurça la sortida de referències

source: reason
ca: raó

source: reason of the update
ca: raó de l'actualització

source: git tag [-a|-s|-u <key-id>] [-f] [-m <msg>|-F <file>] <tagname> [<head>]
ca: git tag [-a|-s|-u <key-id>] [-f] [-m <missatge>|-F <fitxer>] <nom-d'etiqueta> [<cap>]

source: git tag -d <tagname>...
ca: git tag -d <nom-d'etiqueta>...

source: git tag -l [-n[<num>]] [--contains <commit>] [--points-at <object>] [<pattern>...]
ca: git tag -l [-n[<nombre>]] [--contains <comissió>] [--points-at <objecte>] [<patró>...]

source: git tag -v <tagname>...
ca: git tag -v <nom-d'etiqueta>...

source: malformed object at '%s'
ca: objecte malformat a '%s'

source: tag name too long: %.*s...
ca: nom d'etiqueta massa llarg: %.*s...

source: tag '%s' not found.
ca: etiqueta '%s' no trobada

source: Deleted tag '%s' (was %s)
ca: L'etiqueta '%s' s'ha suprimit (ha estat %s)

source: could not verify the tag '%s'
ca: no s'ha pogut verificar l'etiqueta '%s'

source: Write a message for tag: %s Lines starting with '%c' will be ignored.
ca: Escrui el missatge de l'etiqueta: %s Les línies que comencen amb '%c' s'ignoraran.

source: Write a message for tag: %s Lines starting with '%c' will be kept; you may remove them yourself if you want to.
ca: Escriu el missatge de l'etiqueta: %s Les línies començant amb '%c' es retindran; podeu treure'ls per vós mateix si voleu.

source: unsupported sort specification '%s'
ca: especificació d'ordenació '%s' no suportat

source: unsupported sort specification '%s' in variable '%s'
ca: especificació d'ordenació '%s' no suportat en el variable '%s'

source: unable to sign the tag
ca: incapaç de firmar l'etiqueta

source: unable to write tag file
ca: incapaç d'escriure el fitxer d'etiqueta

source: bad object type.
ca: tipus d'objecte dolent.

source: tag header too big.
ca: capçalera d'etiqueta massa gran.

source: no tag message?
ca: cap missatge d'etiqueta?

source: The tag message has been left in %s
ca: S'ha deixat el missatge de l'etiqueta en %s

source: switch 'points-at' requires an object
ca: l'opció 'points-at' requereix un objecte

source: malformed object name '%s'
ca: nom d'objecte malformat '%s'

source: list tag names
ca: llista els noms d'etiqueta

source: print <n> lines of each tag message
ca: imprimeix <n> línies de cada missatge d'etiqueta

source: delete tags
ca: suprimeix etiquetes

source: verify tags
ca: verifica etiquetes

source: Tag creation options
ca: Opcions de creació d'etiquetes

source: annotated tag, needs a message
ca: etiqueta anotada, necessita un missatge

source: tag message
ca: missatge d'etiqueta

source: annotated and GPG-signed tag
ca: etiqueta anotada i firmada per GPG

source: use another key to sign the tag
ca: utilitza altra clau per firmar l'etiqueta

source: replace the tag if exists
ca: reempaça l'etiqueta si existeix

source: show tag list in columns
ca: mostra la llista d'etiquetes en columnes

source: sort tags
ca: ordena les etiquetes

source: Tag listing options
ca: Opcions de llistament d'etiquetes

source: print only tags that contain the commit
ca: imprimeix només les etiquetes que continguin la comissió

source: print only tags of the object
ca: imprimeix només les etiquets de l'objecte

source: --column and -n are incompatible
ca: --column i -n són incompatibles

source: --sort and -n are incompatible
ca: --sort i -n són incompatibles

source: -n option is only allowed with -l.
ca: es permet l'opció -n només amb -l.

source: --contains option is only allowed with -l.
ca: es permet l'opció --contains només amb -l.

source: --points-at option is only allowed with -l.
ca: es permet --points-at option només amb -l.

source: only one -F or -m option is allowed.
ca: només una opció -F o -m es permet.

source: too many params
ca: massa paràmetres

source: '%s' is not a valid tag name.
ca: '%s' no és un nom d'etiqueta vàlid.

source: tag '%s' already exists
ca: l'etiqueta '%s' ja existeix

source: %s: cannot lock the ref
ca: %s: no es pot bloquejar la referència

source: %s: cannot update the ref
ca: %s: no es pot actualitzar la referència

source: Updated tag '%s' (was %s)
ca: Etiqueta '%s' actualitzada (ha estat %s)

source: Unpacking objects
ca: Desempaquetant objectes

source: git update-index [options] [--] [<file>...]
ca: git update-index [opcions] [--] [<fitxer>...]

source: continue refresh even when index needs update
ca: continua l'actualització encara que l'índex necessiti una actualització

source: refresh: ignore submodules
ca: actualitza: ignora els submòduls

source: do not ignore new files
ca: no ignoris fitxers nous

source: let files replace directories and vice-versa
ca: deixa que els fitxer reemplacin els directoris i viceversa

source: notice files missing from worktree
ca: nota els fitxers mancants de l'arbre de treball

source: refresh even if index contains unmerged entries
ca: actualitza encara que l'índex contingui entrades no fusionades

source: refresh stat information
ca: actualitza la informació d'estadístiques

source: like --refresh, but ignore assume-unchanged setting
ca: com --refresh, però ignora l'ajust assume-unchanged

source: <mode>,<object>,<path>
ca: <mode>,<objecte>,<ruta>

source: add the specified entry to the index
ca: afegeix l'entrada especificada a l'índex

source: override the executable bit of the listed files
ca: passa per dalt el bit executable dels fitxers llistats

source: mark files as "not changing"
ca: marca els fitxers com "not changing"

source: clear assumed-unchanged bit
ca: neteja el bit assumed-unchanged

source: mark files as "index-only"
ca: marca els fitxers com "index-only"

source: clear skip-worktree bit
ca: neteja el bit skip-worktree

source: add to index only; do not add content to object database
ca: només afegeix a l'índex; no afegeixis el contingut al base de dades d'objectes

source: remove named paths even if present in worktree
ca: treu les rutes anomenades encara que estiguin presents en l'arbre de treball

source: with --stdin: input lines are terminated by null bytes
ca: amb --stdin: les línies d'entrada es terminen per octets nuls

source: read list of paths to be updated from standard input
ca: llegeix la llista de rutes que actualitzar des de l'entrada estàndard

source: add entries from standard input to the index
ca: afegeix les entrades de l'entrada estàndard a l'índex

source: repopulate stages #2 and #3 for the listed paths
ca: reemplena les etapes #2 i #3 per a les rutes llistades

source: only update entries that differ from HEAD
ca: només actualitza les entrades que difereixin de HEAD

source: ignore files missing from worktree
ca: ignora els fitxers que manquin a l'arbre de treball

source: report actions to standard output
ca: informa de les accions en la sortida estàndard

source: (for porcelains) forget saved unresolved conflicts
ca: (per porcellanes) oblida't dels conflictes no resolts ni desats

source: write index in this format
ca: escriu l'índex en aquest format

source: enable or disable split index
ca: habilita o deshabilita l'índex dividit

source: git update-ref [options] -d <refname> [<oldval>]
ca: git update-ref [opcions] -d <nom-de-referència> [<valor-antic>]

source: git update-ref [options] <refname> <newval> [<oldval>]
ca: git update-ref [opcions] <nom-de-referència> <valor-nou> [<valor-antic>]

source: git update-ref [options] --stdin [-z]
ca: git update-ref [opcions] --stdin [-z]

source: delete the reference
ca: suprimeix la referència

source: update <refname> not the one it points to
ca: actualitza <nom de referència>, no la a que assenyali
