Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: replace existing notes
ca: reemplaça notes existents

source: Cannot add notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
ca: No es pot afegir les notes. S'ha trobat notes existents de l'objecte %s. Utilitza '-f' per sobreescriure les notes existents.

source: Overwriting existing notes for object %s
ca: Sobreescrivint les notes existents de l'objecte %s

source: read objects from stdin
ca: llegeix els objects des de stdin

source: load rewriting config for <command> (implies --stdin)
ca: carrega configuració de reescriptura per a <ordre> (implica --stdin)

source: too few parameters
ca: massa pocs paràmetres

source: Cannot copy notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
ca: No es pot copiar les notes. S'ha trobat notes existents de l'objecte %s. Utilitza '-f' per sobreescriure les notes existents.

source: Missing notes on source object %s. Cannot copy.
ca: Manquen notes en l'objecte font %s. No es pot copiar.

source: The -m/-F/-c/-C options have been deprecated for the 'edit' subcommand. Please use 'git notes add -f -m/-F/-c/-C' instead.
ca: S'han desaprovat les opcions -m/-F/-c/-C del subordre 'edit'. Si us plau, utilitzeu 'git notes add -f -m/-F/-c/-C' en lloc.

source: General options
ca: Opcions generals

source: Merge options
ca: Opcions de fusió

source: resolve notes conflicts using the given strategy (manual/ours/theirs/union/cat_sort_uniq)
ca: resol conflictes de nota utilitzant l'estratègia donada (manual/ours/theirs/union/cat_sort_uniq)

source: Committing unmerged notes
ca: Cometent les notes sense fusionar

source: finalize notes merge by committing unmerged notes
ca: finalitza la fusió de notes per cometre les notes sense fusionar

source: Aborting notes merge resolution
ca: Avortant la resolució de fusió de notes

source: abort notes merge
ca: avorta fusió de notes

source: Object %s has no note
ca: L'objecte %s no té cap nota

source: attempt to remove non-existent note is not an error
ca: L'intent de treure una nota no existent no és un error

source: read object names from the standard input
ca: llegeix els noms d'objecte des de l'entrada estàndard

source: notes-ref
ca: referència de notes

source: use notes from <notes_ref>
ca: utilitza les notes de <referència de notes>

source: Unknown subcommand: %s
ca: Subordre desconegut: %s

source: git pack-objects --stdout [options...] [< ref-list | < object-list]
ca: git pack-objects --stdout [opcions...] [< llista-de-referències | < llista-de-objectes]

source: git pack-objects [options...] base-name [< ref-list | < object-list]
ca: git pack-objects [opcions...] base-name [< llista-de-referències | < llista-de-objectes]

source: deflate error (%d)
ca: error de deflació (%d)

source: Writing objects
ca: Escrivint objectes

source: disabling bitmap writing, as some objects are not being packed
ca: deshabilitant l'escriptura de mapes de bits, perquè alguns objectes no s'estan empaquetant

source: Compressing objects
ca: Comprimint objectes

source: unsupported index version %s
ca: versió d'índex no suportada %s

source: bad index version '%s'
ca: versió d'índex dolenta '%s'

source: option %s does not accept negative form
ca: l'opció %s no accepta el forma negatiu

source: unable to parse value '%s' for option %s
ca: incapaç d'analitzar el valor '%s' per a l'opció %s

source: do not show progress meter
ca: no mostris l'indicador de progrés

source: show progress meter
ca: mostra indicador de progrés

source: show progress meter during object writing phase
ca: mostra indicador de progrés durant el fase d'escriptura d'objectes

source: similar to --all-progress when progress meter is shown
ca: similar a --all-progress quan l'indicador de progrés es mostra

source: version[,offset]
ca: versió[,desplaçament]

source: write the pack index file in the specified idx format version
ca: escriu el fitxer d'índex de paquet en la versió de format d'índex especificada

source: maximum size of each output pack file
ca: mida màxima de cada fitxer de paquet de sortida

source: ignore borrowed objects from alternate object store
ca: ignora els objectes prestats d'un emmagatzemament d'objectes alternatiu

source: ignore packed objects
ca: ignora objectes empaquetats

source: limit pack window by objects
ca: limita la finestra de paquete per objectes

source: limit pack window by memory in addition to object limit
ca: limita la finestra de paquet per memòria a més del límit d'objectes

source: maximum length of delta chain allowed in the resulting pack
ca: longitud màxima de la cadena de deltes permesa en el paquet resultat

source: reuse existing deltas
ca: reutilitza deltes existents

source: reuse existing objects
ca: reutilitza objectes existents

source: use OFS_DELTA objects
ca: utilitza objectes OFS_DELTA

source: use threads when searching for best delta matches
ca: utilitza fils al cercar les millores coincidències de delta

source: do not create an empty pack output
ca: no creis una emissió de paquet buida

source: read revision arguments from standard input
ca: llegeix els paràmetres de revisió des de l'entrada estàndard

source: limit the objects to those that are not yet packed
ca: limita els objectes als que encara no s'hagin empaquetat

source: include objects reachable from any reference
ca: inclou els objectes abastables de qualsevulla referència

source: include objects referred by reflog entries
ca: inclou els objectes referits per entrades del registre de referències

source: output pack to stdout
ca: emet el paquet a stdout

source: include tag objects that refer to objects to be packed
ca: inclou els objectes d'etiqueta que refereixin als objectes que empaquetar

source: keep unreachable objects
ca: reté objectes inabastables

source: time
ca: hora

source: unpack unreachable objects newer than <time>
ca: desempaquetar els objectes inabastables més nous que <hora>

source: create thin packs
ca: crea paquets prims

source: ignore packs that have companion .keep file
ca: ignora els paquets que tinguin un fitxer .keep de company

source: pack compression level
ca: nivell de compressió de paquet

source: do not hide commits by grafts
ca: no amaguis les comissions per empelt

source: use a bitmap index if available to speed up counting objects
ca: utilitza un índex de mapa de bits, si disponible, per accelerar el recompte d'objectes

source: write a bitmap index together with the pack index
ca: escriu un índex de mapa de bits junt amb l'índex de paquet

source: Counting objects
ca: Comptant objectes

source: git pack-refs [options]
ca: git pack-refs [opcions]

source: pack everything
ca: empaqueta tot

source: prune loose refs (default)
ca: poda referències soltes (per defecte)

source: Removing duplicate objects
ca: Traient objectes duplicats

source: git prune [-n] [-v] [--expire <time>] [--] [<head>...]
ca: git prune [-n] [-v] [--expire <hora>] [--] [<cap>...]

source: do not remove, show only
ca: no treguis, només mostra

source: report pruned objects
ca: informa d'objectes podats

source: expire objects older than <time>
ca: caduca els objectes majors que <hora>

source: git push [<options>] [<repository> [<refspec>...]]
ca: git push [<options>] [<repositori> [<especificació-de-referència>...]]

source: tag shorthand without <tag>
ca: abreviatura d'etiqueta sense <etiqueta>

source: --delete only accepts plain target ref names
ca: --delete només accepta noms de referència destí senzells

source: To choose either option permanently, see push.default in 'git help config'.
ca: Per triar qualsevulla opció permanentment, veu push.default en 'git help config'.

source: The upstream branch of your current branch does not match the name of your current branch. To push to the upstream branch on the remote, use git push %s HEAD:%s To push to the branch of the same name on the remote, use git push %s %s %s
ca: La rama font de la vostra rama actual no coincideix amb el nom de la vostra rama actual. Per pujar-la a la rama font en el remot, utilitzeu git push %s HEAD:%s Per pujar a la rama de la mateixa nom en el remot, utilitzeu git push %s %s %s

source: You are not currently on a branch. To push the history leading to the current (detached HEAD) state now, use git push %s HEAD:<name-of-remote-branch>
ca: Actualment no esteu en una rama. Per pujar la història que condueix a l'estat actual (HEAD separat) ara, utilitzeu git push %s HEAD:<nom-de-rama-remota>

source: The current branch %s has no upstream branch. To push the current branch and set the remote as upstream, use git push --set-upstream %s %s
ca: La rama actual %s no té rama font. Per pujar la rama actual i estableix el remot com font, utilitzeu git push --set-upstream %s %s

source: The current branch %s has multiple upstream branches, refusing to push.
ca: La rama actual %s té múltiples rames fonts, refusant pujar.

source: You are pushing to remote '%s', which is not the upstream of your current branch '%s', without telling me what to push to update which remote branch.
ca: Esteu pujant al remot '%s', que no és la font de la vostra rama actual '%s', sense dir-me què pujar per actualitzar quina rama remota.

source: push.default is unset; its implicit value has changed in Git 2.0 from 'matching' to 'simple'. To squelch this message and maintain the traditional behavior, use: git config --global push.default matching To squelch this message and adopt the new behavior now, use: git config --global push.default simple When push.default is set to 'matching', git will push local branches to the remote branches that already exist with the same name. Since Git 2.0, Git defaults to the more conservative 'simple' behavior, which only pushes the current branch to the corresponding remote branch that 'git pull' uses to update the current branch. See 'git help config' and search for 'push.default' for further information. (the 'simple' mode was introduced in Git 1.7.11. Use the similar mode 'current' instead of 'simple' if you sometimes use older versions of Git)
ca: push.default no està estabert; el seu valor implícit s'ha canviat en Git 2.0 de 'matching' a 'simple'. Per suprimir aquest missatge i mantenir el compartament tradicional, utilitzeu: git config --global push.default matching Per suprimir aquest missatge i adoptar el comportament nou ara, utilitzeu: git config --global push.default simple Quan push.default és 'matching', git pujarà les rames locals a les rames remotes que ja existeixen amb el mateix nom. Des de Git 2.0, Git per defecte té el comportament més conservatiu 'simple', que només puja la rama actual a la rama corresponent que 'git pull' utilitza per actualitzar la rama actual. Veu 'git help config' i cerqueu 'push.default' per més informació. (s'ha introduït el mode 'simple' en Git 1.7.11. Utilitzeu el mode similar 'current' en lloc de 'simple' si a vegades utilitzeu versions més antigues de Git)

source: You didn't specify any refspecs to push, and push.default is "nothing".
ca: No heu especificat cap especificació de referència que pujar, i push.default és "nothing".

source: Updates were rejected because the tip of your current branch is behind its remote counterpart. Integrate the remote changes (e.g. 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ca: S'han rebutjat les actualitzacions perquè el punt de la vostra rama actual està darrerre de la seva contrapart remota. Integreu els canvis remots (per exemple, 'git pull ...') abans de pujar de nou. Veu la 'Nota sobre avances ràpids' en 'git push --help' per detalls.

source: Updates were rejected because a pushed branch tip is behind its remote counterpart. Check out this branch and integrate the remote changes (e.g. 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ca: S'han rebutjat les actualitzacions perquè un punt de rama pujada està darrere de la seva contraparte remota. Agafeu aquesta rama i integreu els canvis remots (per exemple, 'git pull ...') abans de pujar de nou. Veu la 'Nota sobre avances ràpids' en 'git push --help' per detalls.

source: Updates were rejected because the remote contains work that you do not have locally. This is usually caused by another repository pushing to the same ref. You may want to first integrate the remote changes (e.g., 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ca: S'han rebutjat les actualitzacions perquè el remot conté treball que no teniu localment. Això usualment es causa per altre repositori havent pujant a la mateixa referència. Podeu voler primer integar els canvis remots (per exemple, 'git pull ...') abans de pujar de nou. Veu la 'Nota sobre avances ràpids' en 'git push --help' per detalls.

source: Updates were rejected because the tag already exists in the remote.
ca: S'han rebutjat les actualitzacions perquè l'etiqueta ja existeix en el remot.

source: You cannot update a remote ref that points at a non-commit object, or update a remote ref to make it point at a non-commit object, without using the '--force' option.
ca: No podeu actualitzar una referència remota que assenyala un objecte no de comissió, ni actualitzar una referència remota per fer que assenyali un objecte no de comissió, sense utilitzar l'opció '--force'.

source: Pushing to %s
ca: Pujant a %s

source: failed to push some refs to '%s'
ca: s'ha fallat al pujar algunes referències a '%s'

source: bad repository '%s'
ca: repositori dolent '%s'

source: No configured push destination. Either specify the URL from the command-line or configure a remote repository using git remote add <name> <url> and then push using the remote name git push <name>
ca: Cap destí de pujada configurada. O especifiqueu l'URL des de la línia d'ordres o configura un repositori remot utilitzant git remote add <name> <url> i després pujeu utilitzant el nom remot git push <name>

source: --all and --tags are incompatible
ca: --all i --tags són incompatibles

source: --all can't be combined with refspecs
ca: --all no es pot combinar amb especificacions de referència

source: --mirror and --tags are incompatible
ca: --mirror i --tags són incompatibles

source: --mirror can't be combined with refspecs
ca: --mirror no es pot combinar amb especificacions de referència

source: --all and --mirror are incompatible
ca: --all i --mirror són incompatibles

source: repository
ca: repositori

source: push all refs
ca: envia totes les referències

source: mirror all refs
ca: reflecteix totes les referències

source: delete refs
ca: suprimeix les referències

source: push tags (can't be used with --all or --mirror)
ca: envia les etiquetes (no es pot utilitzar amb --all o --mirror)

source: force updates
ca: força actualitzacions

source: refname>:<expect
ca: nom-de-referència>:<esperat

source: require old value of ref to be at this value
ca: requereix que el valor antic de la referència sigui d'aquest valor

source: check
ca: comprova

source: control recursive pushing of submodules
ca: controla la pujada recursiva de submòduls

source: use thin pack
ca: utilitza el paquet prim

source: receive pack program
ca: programa que rep els paquets

source: set upstream for git pull/status
ca: estableix la font per a git pull/status

source: prune locally removed refs
ca: poda les referències localment tretes

source: bypass pre-push hook
ca: evita el ganxo de prepujada

source: push missing but relevant tags
ca: puja les etiquetes mancants però relevants

source: --delete is incompatible with --all, --mirror and --tags
ca: --delete és incompatible amb --all, --mirror i --tags

source: --delete doesn't make sense without any refs
ca: --delete no té sentit sense referències

source: git read-tree [[-m [--trivial] [--aggressive] | --reset | --prefix=<prefix>] [-u [--exclude-per-directory=<gitignore>] | -i]] [--no-sparse-checkout] [--index-output=<file>] (--empty | <tree-ish1> [<tree-ish2> [<tree-ish3>]])
ca: git read-tree [[-m [--trivial] [--aggressive] | --reset | --prefix=<prefix>] [-u [--exclude-per-directory=<ignoral-de-git>] | -i]] [--no-sparse-checkout] [--index-output=<fitxer>] (--empty | <arbre1> [<arbre2> [<arbre3>]])

source: write resulting index to <file>
ca: escriu l'índex resultant al <fitxer>

source: only empty the index
ca: només buida l'índex

source: Merging
ca: Fusionant

source: perform a merge in addition to a read
ca: realitza una fusió a més d'una lectura

source: 3-way merge if no file level merging required
ca: fusió de 3 vies si no cal fusió a la nivell de fitxers

source: 3-way merge in presence of adds and removes
ca: fusió de 3 vies en presència d'afegiments i tretes

source: same as -m, but discard unmerged entries
ca: el mateix que -m, però descarta les entrades no fusionades

source: <subdirectory>/
ca: <subdirectori>/

source: read the tree into the index under <subdirectory>/
ca: llegiu l'arbre a l'índex baix <subdirectori>/

source: update working tree with merge result
ca: actualitza l'arbre de treball amb el resultat de fusió

source: gitignore
ca: ignoral de git

source: allow explicitly ignored files to be overwritten
ca: permet que els fitxers explícitament ignorats es sobreescriguin

source: don't check the working tree after merging
ca: no comprovis l'arbre de treball després de fusionar

source: don't update the index or the work tree
ca: no actualitzis l'índex ni l'arbre de treball

source: skip applying sparse checkout filter
ca: salta l'aplicació del filtre d'agafament escàs

source: debug unpack-trees
ca: depura unpack-trees

source: %s' for '%s' is not a valid timestamp
ca: %s' per '%s' no és una marca de temps vàlida

source: '%s' is not a valid timestamp
ca: '%s' no és una marca de temps vàlida

source: git remote add [-t <branch>] [-m <master>] [-f] [--tags|--no-tags] [--mirror=<fetch|push>] <name> <url>
ca: git remote add [-t <rama>] [-m <mestre>] [-f] [--tags|--no-tags] [--mirror=<fetch|push>] <nom> <url>

source: git remote rename <old> <new>
ca: git remote rename <antic> <nou>

source: git remote remove <name>
ca: git remote remove <nom>

source: git remote set-head <name> (-a | --auto | -d | --delete |<branch>)
ca: git remote set-head <nom> (-a | --auto | -d | --delete |<rama>)

source: git remote [-v | --verbose] show [-n] <name>
ca: git remote [-v | --verbose] show [-n] <nom>

source: git remote prune [-n | --dry-run] <name>
ca: git remote prune [-n | --dry-run] <nom>

source: git remote [-v | --verbose] update [-p | --prune] [(<group> | <remote>)...]
ca: git remote [-v | --verbose] update [-p | --prune] [(<grup> | <remot>)...]

source: git remote set-branches [--add] <name> <branch>...
ca: git remote set-branches [--add] <nom> <rama>...

source: git remote set-url [--push] <name> <newurl> [<oldurl>]
ca: git remote set-url [--push] <nom> <url-nou> [<url-antic>]

source: git remote set-url --add <name> <newurl>
ca: git remote set-url --add <nom> <url nou>

source: git remote set-url --delete <name> <url>
ca: git remote set-url --delete <nom> <url>

source: git remote add [<options>] <name> <url>
ca: git remote add [<opcions>] <nom> <url>

source: git remote set-head <name> (-a | --auto | -d | --delete | <branch>)
ca: git remote set-head <nom> (-a | --auto | -d | --delete | <rama>)

source: git remote set-branches <name> <branch>...
ca: git remote set-branches <nom> <rama>...

source: git remote set-branches --add <name> <branch>...
ca: git remote set-branches --add <nom> <rama>...

source: git remote show [<options>] <name>
ca: git remote show [<opcions>] <nom>

source: git remote prune [<options>] <name>
ca: git remote prune [<opcions>] <nom>

source: git remote update [<options>] [<group> | <remote>]...
ca: git remote update [<opcions>] [<grup> | <remot>]...

source: Updating %s
ca: Actualitzant %s

source: --mirror is dangerous and deprecated; please use --mirror=fetch or --mirror=push instead
ca: --mirror és peligrós i desaprovat; si us plau, utilitzeu --mirror=fetch o --mirror=push en lloc

source: unknown mirror argument: %s
ca: paràmetre de reflexió desconegut: %s

source: fetch the remote branches
ca: obtén les rames remotes

source: import all tags and associated objects when fetching
ca: importa totes les etiquetes i tos els objectes al obtenir

source: or do not fetch any tag at all (--no-tags)
ca: o no obtén cap etiqueta (--no-tags)

source: branch(es) to track
ca: rames que seguir

source: master branch
ca: rama mestre

source: set up remote as a mirror to push to or fetch from
ca: estableix remot com mirall a que pujar o de que obtenir

source: specifying a master branch makes no sense with --mirror
ca: especificar una rama mestra no té sentit amb --mirror

source: specifying branches to track makes sense only with fetch mirrors
ca: especificar rames que seguir té sentit només amb miralls d'obteniment

source: remote %s already exists.
ca: el remot %s ja existeix.

source: '%s' is not a valid remote name
ca: '%s' no és un nom de remot vàlid

source: Could not setup master '%s'
ca: No s'ha pogut configurar el mestre '%s'

source: more than one %s
ca: més d'un %s

source: Could not get fetch map for refspec %s
ca: No s'ha pogut obtenir el mapa d'obteniment de l'especificació de referència %s

source: (matching)
ca: (coincident)

source: (delete)
ca: (suprimir)

source: Could not append '%s' to '%s'
ca: No s'ha pogut annexar '%s' a '%s'

source: No such remote: %s
ca: Cap remot així: %s

source: Could not rename config section '%s' to '%s'
ca: No s'ha pogut canviar el nom de la secció de configuració '%s' a '%s'

source: Could not remove config section '%s'
ca: No s'ha pogut treure la secció de configuració '%s'

source: Not updating non-default fetch refspec %s Please update the configuration manually if necessary.
ca: No actualitzant l'especificació de referències d'obteniment no per defecte %s Si us plau, actualitzeu la configuració manualment si és necessari.

source: Could not append '%s'
ca: No s'ha pogut annexar '%s'

source: Could not set '%s'
ca: No s'ha pogut establir '%s'

source: deleting '%s' failed
ca: la supressió de '%s' ha fallat

source: creating '%s' failed
ca: la creació de '%s' ha fallat

source: Could not remove branch %s
ca: No s'ha pogut treure la rama %s

source: Note: A branch outside the refs/remotes/ hierarchy was not removed; to delete it, use:
ca: Nota: Una rama fora de la jerarquia refs/remotes/ no s'ha tret; per suprimir-la, utilitzeu:

source: new (next fetch will store in remotes/%s)
ca: nou (el pròxim obteniment emmagatzemarà en remotes/%s)

source: tracked
ca: seguit

source: stale (use 'git remote prune' to remove)
ca: ranci (utilitzeu 'git remote prune' per treure)

source: invalid branch.%s.merge; cannot rebase onto > 1 branch
ca: branch.%s.merge invàlid; no es pot rebasar en > 1 rama

source: rebases onto remote %s
ca: es rebasa en el remot %s

source: merges with remote %s
ca: es fusiona amb el remot %s

source: and with remote
ca: i amb el remot

source: merges with remote %s
ca: es fusiona amb el remot %s

source: and with remote
ca: i amb el remot

source: create
ca: crea

source: delete
ca: suprimeix

source: up to date
ca: actualitzat

source: fast-forwardable
ca: avanç ràpid possible

source: local out of date
ca: local no actualitzat

source: %-*s forces to %-*s (%s)
ca: %-*s força a %-*s (%s)

source: %-*s pushes to %-*s (%s)
ca: %-*s puja a %-*s (%s)

source: %-*s forces to %s
ca: %-*s força a %s

source: %-*s pushes to %s
ca: %-*s puja a %s

source: do not query remotes
ca: no consultis els remots

source: * remote %s
ca: * remot %s

source: Fetch URL: %s
ca: URL d'obteniment: %s

source: (no URL)
ca: (sense URL)

source: Push URL: %s
ca: URL de pujada: %s

source: HEAD branch: %s
ca: Rama de HEAD: %s

source: HEAD branch (remote HEAD is ambiguous, may be one of the following):
ca: Rama de HEAD (el HEAD remot és ambigu, pot ser un dels següents):
