Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: stdin has NUL-terminated arguments
ca: stdin té paràmetres terminats per NUL

source: read updates from stdin
ca: llegeix actualitzacions des de stdin

source: update the info files from scratch
ca: actualitza els fitxers d'informació des de zero

source: git verify-commit [-v|--verbose] <commit>...
ca: git verify-commit [-v|--verbose] <comissió>...

source: print commit contents
ca: imprimeix els continguts de la comissió

source: git verify-pack [-v|--verbose] [-s|--stat-only] <pack>...
ca: git verify-pack [-v|--verbose] [-s|--stat-only] <paquet>...

source: verbose
ca: verbós

source: show statistics only
ca: mostra només estadístiques

source: git verify-tag [-v|--verbose] <tag>...
ca: git verify-tag [-v|--verbose] <etiqueta>...

source: print tag contents
ca: imprimeix els continguits de l'etiqueta

source: write tree object for a subdirectory <prefix>
ca: escriu l'objecte d'arbre per a un subdirectori <prefix>

source: only useful for debugging
ca: només útil per la depuració

source: 'git help -a' and 'git help -g' lists available subcommands and some concept guides. See 'git help <command>' or 'git help <concept>' to read about a specific subcommand or concept.
ca: 'git help -a' i 'git help -g' llisten subordres disponibles i algunes guies de concepte. Veu 'git help <command>' o 'git help <concept>' per llegir sobre un subordre o concepte específic.

source: expiry-date
ca: data-de-caducitat

source: no-op (backward compatibility)
ca: operació nul·la (compatibilitat amb versions anteriors)

source: be more verbose
ca: siguis més verbós

source: be more quiet
ca: siguis més callat

source: use <n> digits to display SHA-1s
ca: utilitza <n> xifres per presentar els SHA-1

source: Add file contents to the index
ca: Afegeix els continguts de fitxers a l'índex

source: Find by binary search the change that introduced a bug
ca: Troba per cerca binària el canvi que ha introduït un defecte

source: List, create, or delete branches
ca: Llista, crea o suprimeix rames

source: Checkout a branch or paths to the working tree
ca: Agafa una rama o unes rutes a l'arbre de treball

source: Clone a repository into a new directory
ca: Clona un repositori a un directori nou

source: Record changes to the repository
ca: Registre els canvis al repositori

source: Show changes between commits, commit and working tree, etc
ca: Mostra els canvis entre comissions, la comissió i l'arbre de treball, etc

source: Download objects and refs from another repository
ca: Baixa objectes i referències d'altre repositori

source: Print lines matching a pattern
ca: Imprimeix les línies coincidents amb un patró

source: Create an empty Git repository or reinitialize an existing one
ca: Crea un repositori de Git buit o reinicialitza un existent

source: Show commit logs
ca: Mostra els registres de comissió

source: Join two or more development histories together
ca: Uneix dos o més històries de desenvolupament

source: Move or rename a file, a directory, or a symlink
ca: Mou o canvia de nom un fitxer, directori, o enllaç simbòlic

source: Fetch from and integrate with another repository or a local branch
ca: Obté de i integra con altre repositori o una rama local

source: Update remote refs along with associated objects
ca: Actualitza les referències remotes juntes amb els objectes associats

source: Forward-port local commits to the updated upstream head
ca: Avança les comissions locals al cap font actualitzat

source: Reset current HEAD to the specified state
ca: Restableix el HEAD actual a l'estat especificat

source: Remove files from the working tree and from the index
ca: Treu fitxers de l'arbre de treball i de l'índex

source: Show various types of objects
ca: Mostra diversos tipus d'objectes

source: Show the working tree status
ca: Mostra l'estat de l'arbre de treball

source: Create, list, delete or verify a tag object signed with GPG
ca: Crea, llista, suprimeix o verifica un objecte d'etiqueta firmat amb GPG

source: You need to set your committer info first
ca: Cal establir la vostra informació de comitent primer

source: You seem to have moved HEAD since the last 'am' failure. Not rewinding to ORIG_HEAD
ca: Sembla que heu mot HEAD després de l'última fallada de 'am'. No rebobinant a ORIG_HEAD

source: When you have resolved this problem, run "$cmdline --continue". If you prefer to skip this patch, run "$cmdline --skip" instead. To restore the original branch and stop patching, run "$cmdline --abort".
ca: Quan heu resolt aquest problema, executeu "$cmdline --continue". Si preferiu saltar aquest pedaç, executeu "$cmdline --skip" en lloc. Per restaurar la rama original i deixar d'apedaçar, executeu "$cmdline --abort".

source: Cannot fall back to three-way merge.
ca: No es pot retrocedir a una fusió de 3 vies.

source: Repository lacks necessary blobs to fall back on 3-way merge.
ca: Al repositori li manquen els blobs necessaris per a retrocedir a una fusió de 3 vies.

source: Using index info to reconstruct a base tree...
ca: Utilitzant la informació d'índex per reconstruir un arbre base...

source: Did you hand edit your patch? It does not apply to blobs recorded in its index.
ca: Heu editat el vostre pedaç a mà? No s'aplica als blobs recordats en el seu índex.

source: Falling back to patching base and 3-way merge...
ca: Retrocedint a apedaçar el base i fusionar de 3 vies...

source: Failed to merge in the changes.
ca: S'ha fallat al fusionar els canvis.

source: Only one StGIT patch series can be applied at once
ca: només una sèrie de pedaços StGIT es pot aplicar a la vegada

source: Patch format $patch_format is not supported.
ca: El format de pedaç $patch_format no és suportat.

source: Patch format detection failed.
ca: La detecció de format de pedaç ha fallat.

source: The -b/--binary option has been a no-op for long time, and it will be removed. Please do not use it anymore.
ca: Fa molt que l'opció -b/--binary no ha fet res, i es traurà. Si us plau, no l'utilitzis més.

source: previous rebase directory $dotest still exists but mbox given.
ca: un directori de rebase anterior $dotest encara existeix però s'ha donat una bústia.

source: Please make up your mind. --skip or --abort?
ca: Si us plau, preneu una decisió. --skip o --abort?

source: Stray $dotest directory found. Use "git am --abort" to remove it.
ca: Directori $dotest extraviat trobat. Utilitzeu "git am --abort" per treure'l.

source: Resolve operation not in progress, we are not resuming.
ca: Operació de resolució no en curs, no reprenem.

source: Dirty index: cannot apply patches (dirty: $files)
ca: Índex brut: no es pot aplicar pedaços (bruts: $files)

source: Patch is empty. Was it split wrong? If you would prefer to skip this patch, instead run "$cmdline --skip". To restore the original branch and stop patching run "$cmdline --abort".
ca: El pedaç és buit. S'ha dividit mal? Si preferiríeu saltar aquest pedaç, en lloc executeu "$cmdline --skip". Per restaurar la rama original i deixar d'empaquetar, executeu "$cmdline --abort".

source: Patch does not have a valid e-mail address.
ca: El pedaç no té adreça de correu electrònic vàlida.

source: cannot be interactive without stdin connected to a terminal.
ca: no es pot ser interactiu sense que stdin sigui connectat a un terminal.

source: Commit Body is:
ca: El cos de la comissió és:

source: Apply? [y]es/[n]o/[e]dit/[v]iew patch/[a]ccept all
ca: Aplica? sí [y]/[n]o/[e]dita/[v]isualitza pedaç/[a]ccepta tots

source: Applying: $FIRSTLINE
ca: Aplicant: $FIRSTLINE

source: No changes - did you forget to use 'git add'? If there is nothing left to stage, chances are that something else already introduced the same changes; you might want to skip this patch.
ca: Cap canvi - heu oblidat utilitzar 'git add'? Si no hi ha res que allistar, probablement alguna altra cosa ja ha introduït els mateixos canvis; potser voleu saltar aquest pedaç.

source: You still have unmerged paths in your index did you forget to use 'git add'?
ca: Encara teniu rutes sense fusionar en el vostre índex heu oblidat utilitzar 'git add'?

source: No changes -- Patch already applied.
ca: Sense canvis -- Pedaç ja aplicat.

source: Patch failed at $msgnum $FIRSTLINE
ca: El pedaç ha fallat a $msgnum $FIRSTLINE

source: The copy of the patch that failed is found in: $dotest/patch
ca: La còpia del pedaç que ha fallat es troba en: $dotest/patch

source: applying to an empty history
ca: aplicant a una història buida

source: You need to start by "git bisect start"
ca: Cal començar per "git bisect start"

source: Do you want me to do it for you [Y/n]?
ca: Voleu que jo el faci per vós [Y/n]?

source: unrecognised option: '$arg'
ca: opció no reconeguda: '$arg'

source: '$arg' does not appear to be a valid revision
ca: '$arg' no sembla una revisió vàlida

source: Bad HEAD - I need a HEAD
ca: HEAD dolent - Cal un HEAD

source: Checking out '$start_head' failed. Try 'git bisect reset <validbranch>'.
ca: L'agafament de '$start_head' ha fallat. Proveu 'git bisect reset <validbranch>'.

source: won't bisect on cg-seek'ed tree
ca: no es bisecarà en un arbre en que s'ha fet cg-seek

source: Bad HEAD - strange symbolic ref
ca: HEAD dolent - referència simbòlica estranya

source: Bad bisect_write argument: $state
ca: Paràmetre bisect_write dolent: $state

source: Bad rev input: $arg
ca: Introducció de revisió dolenta: $arg

source: Please call 'bisect_state' with at least one argument.
ca: Si us plau, invoqueu 'bisect_state' amb almenys un paràmetre.

source: Bad rev input: $rev
ca: Introducció de revisió dolenta: $rev

source: 'git bisect bad' can take only one argument.
ca: 'git bisect bad' pot acceptar només un paràmetre.

source: Warning: bisecting only with a bad commit.
ca: Avís: bisecant amb només comissió dolenta.

source: Are you sure [Y/n]?
ca: Esteu segur [Y/n]?

source: You need to give me at least one good and one bad revisions. (You can use "git bisect bad" and "git bisect good" for that.)
ca: Cal donar-me almenys una revisió bona i una dolenta. (Podeu utilitzar "git bisect bad" i "git bisect good" per això.)

source: You need to start by "git bisect start". You then need to give me at least one good and one bad revisions. (You can use "git bisect bad" and "git bisect good" for that.)
ca: Cal començar amb "git bisect start". Després cal donar-me almenys una revisió bona i una dolenta. (Podeu utilitzar "git bisect bad" i "git bisect good" per això.)

source: We are not bisecting.
ca: No estem bisecant.

source: '$invalid' is not a valid commit
ca: '$invalid' no és una comissió vàlida

source: Could not check out original HEAD '$branch'. Try 'git bisect reset <commit>'.
ca: No s'ha pogut agafar el HEAD original '$branch'. Proveu 'git bisect reset <comissió>'.

source: No logfile given
ca: Cap fitxer de registre donat

source: cannot read $file for replaying
ca: no es pot llegir $file per reproduir

source: ?? what are you talking about?
ca: ?? de què parleu?

source: running $command
ca: executant $command

source: bisect run failed: exit code $res from '$command' is < 0 or >= 128
ca: el pas de bisecció ha fallat: el codi de sortida $res de '$command' és < 0 o >= 128

source: bisect run cannot continue any more
ca: el pas de bisecció no pot continuar més

source: bisect run failed: 'bisect_state $state' exited with error code $res
ca: el pas de bisecció ha fallat: 'bisect_state $state' ha surt amb el codi d'error $res

source: bisect run success
ca: pas de bisecció reeixit

source: Pull is not possible because you have unmerged files. Please, fix them up in the work tree, and then use 'git add/rm <file>' as appropriate to mark resolution, or use 'git commit -a'.
ca: Baixar no és possible perquè teniu fitxers sense fusionar. Si us plau, arregleu-los en l'arbre de treball, i després utilitzeu 'git add/rm <file>' segons sigui apropiat per a marcar resolució, o utilitzeu 'git commit -a'.

source: Pull is not possible because you have unmerged files.
ca: Baixar no és possible perquè teniu fitxers sense fusionar.

source: updating an unborn branch with changes added to the index
ca: actualitzant una rama no nascuda amb canvis afegits a l'índex

source: Warning: fetch updated the current branch head. Warning: fast-forwarding your working tree from Warning: commit $orig_head.
ca: Avís: l'obteniment ha actualitzat el cap de la Avís: rama actual. avançant ràpidament el Avís: vostre arbre de treball des de la Avís: comissió $orig_head.

source: Cannot merge multiple branches into empty head
ca: No es pot fusionar múltiples rama a un cap buit

source: Cannot rebase onto multiple branches
ca: No es pot rebasar en múltiples rames

source: When you have resolved this problem, run "git rebase --continue". If you prefer to skip this patch, run "git rebase --skip" instead. To check out the original branch and stop rebasing, run "git rebase --abort".
ca: Quan heu resolt aquest problema, executeu "git rebase --continue". Si preferiu saltar aquest pedaç, executeu "git rebase --skip" en lloc. Per agafar la rama original i deixar de rebasar, executeu "git rebase --abort".

source: Applied autostash.
ca: Magatzem automàtic aplicat.

source: Cannot store $stash_sha1
ca: No es pot emmagatzemar $stash_sha1

source: Applying autostash resulted in conflicts. Your changes are safe in the stash. You can run "git stash pop" or "git stash drop" at any time.
ca: L'aplicació del magatzem automàtic ha resultat en conflictes. Els vostres canvis estan segurs el el magatzem. Podeu executar "git stash pop" o "git stash drop" en qualsevol moment.

source: The pre-rebase hook refused to rebase.
ca: El ganxo prerebase ha refusat rebasar.

source: It looks like git-am is in progress. Cannot rebase.
ca: Sembla que git-am està en curs. No es pot rebasar.

source: The --exec option must be used with the --interactive option
ca: L'opció --exec s'ha d'utilitzar amb l'opció --interactive

source: No rebase in progress?
ca: Cap rebase en curs?

source: The --edit-todo action can only be used during interactive rebase.
ca: L'acció --edit-todo només es pot utilitzar durant un rebase interactiu.

source: Cannot read HEAD
ca: No es pot llegir HEAD

source: You must edit all merge conflicts and then mark them as resolved using git add
ca: Heu d'editar tots els conflictes de fusió i després marcar-los com resolts utilitzant git add

source: Could not move back to $head_name
ca: No s'ha pogut retardar a $head_name

source: It seems that there is already a $state_dir_base directory, and I wonder if you are in the middle of another rebase. If that is the case, please try $cmd_live_rebase If that is not the case, please $cmd_clear_stale_rebase and run me again. I am stopping in case you still have something valuable there.
ca: Semla que ja hi ha altre directori $state_dir_base, i em pregonu si esteu en el medi d'altre rebase. Si això és el cas, si us plau, proveu $cmd_live_rebase Si no és el cas, si us plau, $cmd_clear_stale_rebase i executeu-me de nou. M'aturo en cas de que encara tingueu alguna cosa de valor allà.

source: invalid upstream $upstream_name
ca: font invàlida $upstream_name

source: $onto_name: there are more than one merge bases
ca: $onto_name: ja hi ha més d'un base de fusió

source: $onto_name: there is no merge base
ca: $onto_name: no hi ha base de fusió

source: Does not point to a valid commit: $onto_name
ca: No assenyala una comissió vàlida: $onto_name

source: fatal: no such branch: $branch_name
ca: fatal: cap rama així: $branch_name

source: Cannot autostash
ca: No es pot emmagatzemar automàticament

source: Created autostash: $stash_abbrev
ca: Magatzem automàtic creat: $stash_abbrev

source: Please commit or stash them.
ca: Si us plau, cometeu-los o emmagatzemeu-los.

source: Current branch $branch_name is up to date.
ca: La rama actual $branch_name està actualitzada.

source: Current branch $branch_name is up to date, rebase forced.
ca: La rama actual $branch_name està actualitzada, rebase forçat.

source: Changes from $mb to $onto:
ca: Canvis de $mb a $onto:

source: First, rewinding head to replay your work on top of it...
ca: Primer, rebobinant el cap per reproduir el vostre treball encima...

source: Fast-forwarded $branch_name to $onto_name.
ca: $branch_name avançada ràpidament a $onto_name

source: git stash clear with parameters is unimplemented
ca: git stash clear amb paràmetres no està implementat

source: You do not have the initial commit yet
ca: Encara no teniu la comissió inicial

source: Cannot save the current index state
ca: No es pot desar l'estat d'índex actual

source: Cannot save the current worktree state
ca: No es pot desar l'estat d'arbre de treball actual

source: No changes selected
ca: Cap canvi seleccionat

source: Cannot remove temporary index (can't happen)
ca: No es pot treure l'índex temporal (no es pot passar)

source: Cannot record working tree state
ca: No es pot registrar l'estat de l'arbre de treball

source: Cannot update $ref_stash with $w_commit
ca: No es pot actualitzar $ref_stash amb $w_commit

source: error: unknown option for 'stash save': $option To provide a message, use git stash save -- '$option'
ca: error: opció desconeguda de 'stash save': $option Per proveir un missatge, utilitzeu git stash save -- '$option'

source: No local changes to save
ca: Cap canvi local que desar

source: Cannot initialize stash
ca: No es pot inicialitzar el magatzem.

source: Cannot save the current status
ca: No es pot desar l'estat actual

source: Cannot remove worktree changes
ca: No es pot treure els canvis de l'arbre de treball

source: No stash found.
ca: Cap magatzem trobat.

source: Too many revisions specified: $REV
ca: Massa revisions especificades: $REV

source: $reference is not valid reference
ca: $reference no és referència vàlida

source: '$args' is not a stash-like commit
ca: '$args' no és comissió com a un magatzem

source: '$args' is not a stash reference
ca: '$args' no és referència de magatzem

source: unable to refresh index
ca: incapaç d'actualitzar l'índex

source: Cannot apply a stash in the middle of a merge
ca: No es pot aplicar un magatzem en el medi d'una fusió

source: Conflicts in index. Try without --index.
ca: Hi ha conflictes en l'índex. Proveu-lo sense --index.

source: Could not save index tree
ca: No s'ha pogut desar l'arbre d'índex

source: Cannot unstage modified files
ca: No es pot desallistar fitxers modificats

source: Index was not unstashed.
ca: L'índex no estava sense emmagatzemar.

source: Dropped ${REV} ($s)
ca: ${REV} ($s) descartada

source: ${REV}: Could not drop stash entry
ca: ${REV}: No s'ha pogut descartar l'entrada de magatzem

source: No branch name specified
ca: Cap nom de rama especificat

source: (To restore them type "git stash apply")
ca: (Per restaurar-les teclegeu "git stash apply")

source: cannot strip one component off url '$remoteurl'
ca: no es pot despullar un component de l'url '$remoteurl'

source: No submodule mapping found in .gitmodules for path '$sm_path'
ca: Cap mapatge de submòdul trobada en .gitmodules per a la ruta '$sm_path'

source: Clone of '$url' into submodule path '$sm_path' failed
ca: La clonatge de '$url' a la ruta de submòdul '$sm_path' ha fallat

source: Gitdir '$a' is part of the submodule path '$b' or vice versa
ca: El directori de git '$a' és part de la ruta de submòdul '$b' o viceversa

source: Relative path can only be used from the toplevel of the working tree
ca: La ruta relativa només es pot utilitzar des del nivell superior de l'arbre de treball

source: repo URL: '$repo' must be absolute or begin with ./|../
ca: URL de repositori: '$repo' ha de ser absolut o ha de començar amb ./|../

source: '$sm_path' already exists in the index
ca: '$sm_path' ja existeix en l'índex

source: The following path is ignored by one of your .gitignore files: $sm_path Use -f if you really want to add it.
ca: La ruta següent s'ignora per un dels vostres fitxers .gitignore: $sm_path Utilitzeu -f si realment voleu afegir-lo.

source: Adding existing repo at '$sm_path' to the index
ca: Afegint el repositori existent a '$sm_path' a l'índex

source: '$sm_path' already exists and is not a valid git repo
ca: '$sm_path' ja existeix i no és un repositori de git vàlid

source: A git directory for '$sm_name' is found locally with remote(s):
ca: Es troba un directori de git per a '$sm_name' localment amb els remots:

source: If you want to reuse this local git directory instead of cloning again from
ca: Si voleu reutilitzar aquest directori de git local en lloc de clonar de nou de

source: use the '--force' option. If the local git directory is not the correct repo
ca: utilitzeu l'opció '--force'. Si el directori de git local no és el repositori correcte

source: or you are unsure what this means choose another name with the '--name' option.
ca: o esteu insegur de què vol dir això, trieu altre nom amb l'opció '--name'.

source: Reactivating local git directory for submodule '$sm_name'.
ca: Reactivant el directori de git local per al submòdul '$sm_name'.

source: Unable to checkout submodule '$sm_path'
ca: Incapaç d'agafar el submòdul '$sm_path'

source: Failed to add submodule '$sm_path'
ca: S'ha fallat al afegir el submòdul '$sm_path'

source: Failed to register submodule '$sm_path'
ca: S'ha fallat al registrar el submòdul '$sm_path'

source: Entering '$prefix$displaypath'
ca: Entrant '$prefix$displaypath'

source: Stopping at '$prefix$displaypath'; script returned non-zero status.
ca: Aturant a '$prefix$displaypath'; l'script ha retornat un estat no zero.

source: No url found for submodule path '$displaypath' in .gitmodules
ca: Cap url trobat per a la ruta de submòdul '$displaypath' en .gitmodules

source: Failed to register url for submodule path '$displaypath'
ca: S'ha fallat al registrar l'url per a la ruta de submòdul '$displaypath'

source: Submodule '$name' ($url) registered for path '$displaypath'
ca: Submòdul '$name' ($url) registrat per a la ruta '$displaypath'

source: Failed to register update mode for submodule path '$displaypath'
ca: S'ha fallat al registrar el mode d'actualització per a la ruta de submòdul '$displaypath'

source: Use '.' if you really want to deinitialize all submodules
ca: Utilitzeu '.' si realment voleu desinicialitzar tots els submòduls

source: Submodule work tree '$displaypath' contains a .git directory
ca: L'arbre de treball de submòdul '$displaypath' conté un directori .git

source: (use 'rm -rf' if you really want to remove it including all of its history)
ca: (utilitzeu 'rm -rf' si realment voleu treure'l inclòs tota la seva història)

source: Submodule work tree '$displaypath' contains local modifications; use '-f' to discard them
ca: L'arbre de treball de submòdul '$displaypath' conté modificacions locals; utilitzeu '-f' per descartar-les

source: Cleared directory '$displaypath'
ca: S'ha netejat el directori '$displaypath'

source: Could not remove submodule work tree '$displaypath'
ca: No s'ha pogut treure l'arbre de treball de submòdul '$displaypath'

source: Could not create empty submodule directory '$displaypath'
ca: No s'ha pogut crear el directori de submòdul buit '$displaypath'

source: Submodule '$name' ($url) unregistered for path '$displaypath'
ca: Submòdul '$name' ($url) no registrat per a la ruta '$displaypath'

source: Submodule path '$displaypath' not initialized Maybe you want to use 'update --init'?
ca: Ruta de submòdul '$displaypath' no inicialitzat Potser voleu utilitzar 'update --init'?

source: Unable to find current revision in submodule path '$displaypath'
ca: Incapaç de trobar la revisió actual en la ruta de submòdul '$displaypath'

source: Unable to fetch in submodule path '$sm_path'
ca: Incapaç d'agafar en la ruta de submòdul '$sm_path'

source: Unable to fetch in submodule path '$displaypath'
ca: Incapaç d'agafar en la ruta de submòdul '$displaypath'

source: Unable to checkout '$sha1' in submodule path '$displaypath'
ca: Incapaç d'agafar '$sha1' en la ruta de submòdul '$displaypath'
