Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: show source
ca: mostra el fons

source: Use mail map file
ca: Utilitza fitxer de mapa de correu

source: decorate options
ca: opcions de decoració

source: Final output: %d %s
ca: Sortida final: %d %s

source: Could not read object %s
ca: No es pot llegir l'objecte %s

source: Unknown type: %d
ca: Tipus desconegut: %d

source: format.headers without value
ca: format.headers sense valor

source: name of output directory is too long
ca: el nom del directori de sortida és massa llarg

source: Cannot open patch file %s
ca: No es pot obrir el fitxer de pedaç %s

source: Need exactly one range.
ca: Cal exactament un rang.

source: Not a range.
ca: No és un rang.

source: Cover letter needs email format
ca: La carta de presentació necessita el format de correu electrònic

source: insane in-reply-to: %s
ca: in-reply-to boig: %s

source: git format-patch [options] [<since> | <revision range>]
ca: git format-patch [opcions] [<des de> | <rang de revisions>]

source: Two output directories?
ca: Dos directoris de sortida?

source: use [PATCH n/m] even with a single patch
ca: utilitza [PATCH n/m] encara amb un pedaç solter

source: use [PATCH] even with multiple patches
ca: utilitza [PATCH] encara amb múltiples pedaços

source: print patches to standard out
ca: imprimeix els pedaços al sortida estàndard

source: generate a cover letter
ca: genera una carta de presentació

source: use simple number sequence for output file names
ca: utilitza una seqüència de números per als noms dels fitxers de sortida

source: sfx
ca: sufix

source: use <sfx> instead of '.patch'
ca: utilitza <sufix> en lloc de '.patch'

source: start numbering patches at <n> instead of 1
ca: comença nombrant els pedaços a <n> en lloc d'1

source: mark the series as Nth re-roll
ca: marca la sèrie com la Nª llançada

source: Use [<prefix>] instead of [PATCH]
ca: Utilitza [<prefix>] en lloc de [PATCH]

source: store resulting files in <dir>
ca: emmagatzema els fitxers resultants en <directori>

source: don't strip/add [PATCH]
ca: no despullis/afegeixis [PATCH]

source: don't output binary diffs
ca: no emetis diferències binàries

source: don't include a patch matching a commit upstream
ca: no incloguis un pedaç que coincideixi amb una comissió a la font

source: show patch format instead of default (patch + stat)
ca: mostra el format de pedaç en lloc del per defecte (pedaç + estadístiques)

source: Messaging
ca: Missatgeria

source: header
ca: capçalera

source: add email header
ca: afegeix capçalera de correu electrònic

source: email
ca: correu electrònic

source: add To: header
ca: afegeix capçalera To:

source: add Cc: header
ca: afegeix capçalera Cc:

source: ident
ca: identitat

source: set From address to <ident> (or committer ident if absent)
ca: estableix l'adreça From a <identitat> (o la identitat del comitent si absent)

source: message-id
ca: ID de missatge

source: make first mail a reply to <message-id>
ca: fes el primer missatge una resposta a <ID de missatge>

source: boundary
ca: límit

source: attach the patch
ca: ajunta el pedaç

source: inline the patch
ca: posa el pedaç en el cos

source: enable message threading, styles: shallow, deep
ca: habilita l'enfilada de missatges, estils: shallow, deep

source: signature
ca: firma

source: add a signature
ca: afegeix una firma

source: add a signature from a file
ca: afegeix una firma des d'un fitxer

source: don't print the patch filenames
ca: no imprimeixis els noms de fitxer del pedaç

source: invalid ident line: %s
ca: línia d'identitat invàlida: %s

source: -n and -k are mutually exclusive.
ca: -n i -k són mutualment exclusius.

source: --subject-prefix and -k are mutually exclusive.
ca: --subject-prefix i -k són mutualment exclusius.

source: --name-only does not make sense
ca: --name-only no té sentit

source: --name-status does not make sense
ca: --name-status no té sentit

source: --check does not make sense
ca: --check no té sentit

source: standard output, or directory, which one?
ca: sortida estàndard, o directori, qual?

source: Could not create directory '%s'
ca: No s'ha pogut crear el directori '%s'

source: unable to read signature file '%s'
ca: incapaç de llegir el fitxer de firma '%s'

source: Failed to create output files
ca: S'ha fallat al crear fitxers de sortida

source: git cherry [-v] [<upstream> [<head> [<limit>]]]
ca: git cherry [-v] [<font> [<cap> [<límit>]]]

source: Could not find a tracked remote branch, please specify <upstream> manually.
ca: No s'ha pogut trobar una rama remota seguida, si us plau, especifiqueu <font> manualment.

source: Unknown commit %s
ca: Comissió desconeguda %s

source: git ls-files [options] [<file>...]
ca: git ls-files [opcions] [<fitxer>...]

source: identify the file status with tags
ca: identifica l'estat de fitxer amb etiquetes

source: use lowercase letters for 'assume unchanged' files
ca: utilitza lletres minúscules per als fitxers 'assume unchanged'

source: show cached files in the output (default)
ca: mostra els fitxers en cau en la sortida (per defecte)

source: show deleted files in the output
ca: mostra els fitxers suprimits en la sortida

source: show modified files in the output
ca: mostra els fitxers modificats en la sortida

source: show other files in the output
ca: mostra els altres fitxers en la sortida

source: show ignored files in the output
ca: mostra els fitxers ignorats en la sortida

source: show staged contents' object name in the output
ca: mostra el nom d'objecte dels continguts allistats en la sortida

source: show files on the filesystem that need to be removed
ca: mostra els fitxers en el sistema de fitxers que s'han de treure

source: show 'other' directories' name only
ca: mostra només els noms dels directoris 'other'

source: don't show empty directories
ca: no mostris directoris buits

source: show unmerged files in the output
ca: mostra els fitxers sense fusionar en la sortida

source: show resolve-undo information
ca: mostra la informació de resolució de desfet

source: skip files matching pattern
ca: salta els fitxers coincidents amb el patró

source: exclude patterns are read from <file>
ca: els patrons d'exclusió es llegeixen de <fitxer>

source: read additional per-directory exclude patterns in <file>
ca: llegeix els patrons d'exclusió per directori addicionals en <fitxer>

source: add the standard git exclusions
ca: afegeix les exclusions estàndards de git

source: make the output relative to the project top directory
ca: fes que la sortida sigui relativa al directori superior del project

source: if any <file> is not in the index, treat this as an error
ca: si qualsevol <fitxer> no està en l'índex, tracta això com error

source: tree-ish
ca: arbre

source: pretend that paths removed since <tree-ish> are still present
ca: pretenguis que les rutes tretes deprés de <arbre> encara estiguin presents

source: show debugging data
ca: mostra dades de depuració

source: git ls-tree [<options>] <tree-ish> [<path>...]
ca: git ls-tree [<opcions>] <arbre> [<ruta>...]

source: only show trees
ca: mostra només els arbres

source: recurse into subtrees
ca: recursa a subarbres

source: show trees when recursing
ca: mostra els arbres al recursar

source: terminate entries with NUL byte
ca: termina les entrades amb un octet NUL

source: include object size
ca: mida de l'objecte d'inclusió

source: list only filenames
ca: llista només noms de fitxer

source: use full path names
ca: utilitza noms de ruta compets

source: list entire tree; not just current directory (implies --full-name)
ca: llista l'arbre enter; no sol el directori actual (implica --full-name)

source: git merge [options] [<commit>...]
ca: git merge [opcions] [<comissió>...]

source: git merge [options] <msg> HEAD <commit>
ca: git merge [opcions] <missatge> HEAD <comissió>

source: switch `m' requires a value
ca: l'opció `m' requereix un valor

source: Could not find merge strategy '%s'.
ca: No s'ha pogut trobar l'estratègia de fusió '%s'.

source: Available strategies are:
ca: Les estratègies disponibles són:

source: Available custom strategies are:
ca: Les estratègies personalitzades disponibles són:

source: do not show a diffstat at the end of the merge
ca: no mostris les estadístiques de diferència al final de la fusió

source: show a diffstat at the end of the merge
ca: mostra les estadístiques de diferència al final de la fusió

source: (synonym to --stat)
ca: (sinònim de --stat)

source: add (at most <n>) entries from shortlog to merge commit message
ca: afegeix (com màxim <n>) entrades del registre curt per fusionar el missatge de comissió

source: create a single commit instead of doing a merge
ca: crea una comissió soltera en lloc de fusionar

source: perform a commit if the merge succeeds (default)
ca: realitza una comissió si la fusió té èxit (per defecte)

source: edit message before committing
ca: edita el missatge abans de cometre

source: allow fast-forward (default)
ca: permet l'avanç ràpid (per defecte)

source: abort if fast-forward is not possible
ca: avorta si l'avanç ràpid no és possible

source: Verify that the named commit has a valid GPG signature
ca: Verifica que la comissió anomenada té una firma GPG vàlida

source: strategy
ca: estratègia

source: merge strategy to use
ca: estratègia de fusió que utilitzar

source: option=value
ca: opció=valor

source: option for selected merge strategy
ca: opció per a l'estratègia de fusió seleccionada

source: merge commit message (for a non-fast-forward merge)
ca: missatge de comissió de fusió (per a una fusió no de avanç ràpid)

source: abort the current in-progress merge
ca: avorta la fusió en curs actual

source: could not run stash.
ca: no s'ha pogut executar stash.

source: stash failed
ca: L'emmagatzemament ha fallat.

source: not a valid object: %s
ca: no és un objecte vàlid: %s

source: read-tree failed
ca: read-tree ha fallat

source: (nothing to squash)
ca: (res que aixafar)

source: Squash commit -- not updating HEAD
ca: Comissió d'aixafada -- no actualitzant HEAD

source: Writing SQUASH_MSG
ca: Escrivint SQUASH_MSG

source: Finishing SQUASH_MSG
ca: Terminant SQUASH_MSG

source: No merge message -- not updating HEAD
ca: Cap missatge de fusió -- no actualitzant HEAD

source: '%s' does not point to a commit
ca: '%s' no assenyala una comissió

source: Bad branch.%s.mergeoptions string: %s
ca: Cadena branch.%s.mergeoptions dolenta: %s

source: git write-tree failed to write a tree
ca: git write-tree ha fallat al escriure un arbre

source: Not handling anything other than two heads merge.
ca: No manejant res apart de la fusió de dos caps.

source: Unknown option for merge-recursive: -X%s
ca: Opció desconeguda de merge-recursive: -X%s

source: unable to write %s
ca: incapaç d'escriure %s

source: Could not read from '%s'
ca: No s'ha pogut llegir de '%s'

source: Not committing merge; use 'git commit' to complete the merge.
ca: No comitent la fusió; utilitzeu 'git commit' per terminar la fusió.

source: Please enter a commit message to explain why this merge is necessary, especially if it merges an updated upstream into a topic branch. Lines starting with '%c' will be ignored, and an empty message aborts the commit.
ca: Si us plau, introduïu un missatge de comissió per a explicar per què aquesta fusió és necessari, especialment si fusiona una font actualitzada a una rama temàtica. S'ignoraran les línies que comencin amb '%c', i un missatge buit avorta la comissió.

source: Empty commit message.
ca: Missatge de comissió buit.

source: Wonderful.
ca: Meravellós.

source: Automatic merge failed; fix conflicts and then commit the result.
ca: La fusió automàtica ha fallat; arregleu els conflictes i després cometeu el resultat.

source: '%s' is not a commit
ca: '%s' no és una comissió

source: No current branch.
ca: Cap rama actual.

source: No remote for the current branch.
ca: Cap remot per a la rama actual.

source: No default upstream defined for the current branch.
ca: Cap font per defecte definida per a la rama actual.

source: No remote-tracking branch for %s from %s
ca: Cap rama de seguiment remot per a %s a %s

source: There is no merge to abort (MERGE_HEAD missing).
ca: No hi ha fusió que avortar (manca MERGE_HEAD).

source: You have not concluded your merge (MERGE_HEAD exists). Please, commit your changes before you can merge.
ca: No heu terminat la vostra fusió (MERGE_HEAD existeix). Si us plau, cometeu els vostres canvis abans de fusionar.

source: You have not concluded your merge (MERGE_HEAD exists).
ca: No heu terminat la vostra fusió (MERGE_HEAD existeix).

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists). Please, commit your changes before you can merge.
ca: No heu terminat el vostre recull de cireres (CHERRY_PICK_HEAD existeix). Si us plau, cometeu els vostres canvis abans de fusionar.

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists).
ca: No heu terminat el vostre recull de cireres (CHERRY_PICK_HEAD existeix).

source: You cannot combine --squash with --no-ff.
ca: No podeu combinar --squash amb --no-ff.

source: No commit specified and merge.defaultToUpstream not set.
ca: Cap comissió especificada i merge.defaultToUpstream no establert.

source: Can merge only exactly one commit into empty head
ca: Es pot fusionar només exactament una comissió a un cap buit

source: Squash commit into empty head not supported yet
ca: Aixafar una comissió a un cap buit encara no es suporta

source: Non-fast-forward commit does not make sense into an empty head
ca: Una comissió no d'avanç ràpid no té sentit a un cap buit

source: %s - not something we can merge
ca: %s - no és cosa que podem fusionar

source: Commit %s has an untrusted GPG signature, allegedly by %s.
ca: La comissió %s té una firma GPG no confiada, suposadament de %s.

source: Commit %s has a bad GPG signature allegedly by %s.
ca: La comissió %s té una firma GPG dolenta suposadament per %s.

source: Commit %s does not have a GPG signature.
ca: La comissió %s no té firma GPG.

source: Commit %s has a good GPG signature by %s
ca: La comissió %s té una firma GPG bona per %s

source: Updating %s..%s
ca: Actualizant %s..%s

source: Trying really trivial in-index merge...
ca: Intentant una fusió realment trivial en l'índex...

source: Nope.
ca: No.

source: Not possible to fast-forward, aborting.
ca: No és possible avançar ràpidament, avortant.

source: Rewinding the tree to pristine...
ca: Rebobinant l'arbre a la prístina...

source: Trying merge strategy %s...
ca: Intentant l'estratègia de fusió %s...

source: No merge strategy handled the merge.
ca: Cap estratègia de fusió ha manejat la fusió.

source: Merge with strategy %s failed.
ca: L'estratègia de fusió %s ha fallat.

source: Using the %s to prepare resolving by hand.
ca: Utilitzant el %s per preparar la resolució a mà.

source: Automatic merge went well; stopped before committing as requested
ca: La fusió automàtica ha sortit bé; aturat abans de cometre com demanat

source: git merge-base [-a|--all] <commit> <commit>...
ca: git merge-base [-a|--all] <comissió> <comissió>...

source: git merge-base [-a|--all] --octopus <commit>...
ca: git merge-base [-a|--all] --octopus <comissió>...

source: git merge-base --independent <commit>...
ca: git merge-base --independent <comissió>...

source: git merge-base --is-ancestor <commit> <commit>
ca: git merge-base --is-ancestor <comissió> <comissió>

source: git merge-base --fork-point <ref> [<commit>]
ca: git merge-base --fork-point <referència> [<comissió>]

source: output all common ancestors
ca: emet tots els avantpassats comuns

source: find ancestors for a single n-way merge
ca: troba els avantpassats per a una fusió de n vies soltera

source: list revs not reachable from others
ca: llista les revisions no abastables d'altres

source: is the first one ancestor of the other?
ca: és el primer avantpassat de l'altre?

source: find where <commit> forked from reflog of <ref>
ca: troba on <comissió> s'ha bifurcat del registre de referències de <referència>

source: git merge-file [options] [-L name1 [-L orig [-L name2]]] file1 orig_file file2
ca: git merge-file [opcions] [-L nom1 [-L original [-L nom2]]] fitxer1 fitxer_original fitxer2

source: send results to standard output
ca: envia els resultats a la sortida estàndard

source: use a diff3 based merge
ca: utilitza una fusió basada en diff3

source: for conflicts, use our version
ca: en conflictes, utilitza la versió nostra

source: for conflicts, use their version
ca: en conflictes, utilitza la versió seva

source: for conflicts, use a union version
ca: en conflictes, utilitza una versió d'unió

source: for conflicts, use this marker size
ca: en conflicte, utilitza aquesta mida de marcador

source: do not warn about conflicts
ca: no avisis de conflictes

source: set labels for file1/orig_file/file2
ca: estableix les etiquetes per a file1/orig_file/file2

source: input is NUL terminated
ca: l'entrada és terminada per NUL

source: allow missing objects
ca: permet els objectes mancants

source: allow creation of more than one tree
ca: permet la creació de més d'un arbre

source: git mv [options] <source>... <destination>
ca: git mv [opcions] <fons>... <destí>

source: force move/rename even if target exists
ca: força moviment/canvi de nom encara que el destí existeixi

source: skip move/rename errors
ca: salta els error de moviment/canvi de nom

source: Checking rename of '%s' to '%s'
ca: Comprovant el canvi de nom de '%s' a '%s'

source: bad source
ca: font dolenta

source: can not move directory into itself
ca: no es pot moure un directori al seu mateix

source: cannot move directory over file
ca: no es pot moure un directori sobre un fitxer

source: Huh? Directory %s is in index and no submodule?
ca: Perdó? El directori %s està en l'índex i no hi ha submòdul?

source: Please, stage your changes to .gitmodules or stash them to proceed
ca: Si us plau, allisteu els vostres canvis a .gitmodules o emmagatzemeu-los per a procedir

source: Huh? %.*s is in index?
ca: Perdó? %.*s està en l'índex?

source: source directory is empty
ca: el directori font està buit

source: not under version control
ca: no baix control de versions

source: destination exists
ca: el destí existeix

source: overwriting '%s'
ca: sobreescrivint '%s'

source: Cannot overwrite
ca: No es pot sobreescriure

source: multiple sources for the same target
ca: múltiples fonts per al mateix destí

source: destination directory does not exist
ca: el directori destí no existeix

source: %s, source=%s, destination=%s
ca: %s, origen=%s, destí=%s

source: Renaming %s to %s
ca: Canviant el nom de %s a %s

source: renaming '%s' failed
ca: el canvi del nom de '%s' ha fallat

source: git name-rev [options] <commit>...
ca: git name-rev [opcions] <comissió>...

source: git name-rev [options] --all
ca: git name-rev [opcions] --all

source: git name-rev [options] --stdin
ca: git name-rev [opcions] --stdin

source: print only names (no SHA-1)
ca: imprimeix només els noms (cap SHA-1)

source: only use tags to name the commits
ca: només utilitza etiquetes per anomenar les comissions

source: only use refs matching <pattern>
ca: només utilitza les referències que coincideixen amb <patró>

source: list all commits reachable from all refs
ca: llista totes les comissions abastables de totes les referències

source: read from stdin
ca: llegeix de stdin

source: allow to print `undefined` names (default)
ca: permet imprimir noms `undefined` (per defecte)

source: dereference tags in the input (internal use)
ca: dereferencia les etiquetes en l'entrada (ús intern)

source: git notes [--ref <notes_ref>] [list [<object>]]
ca: git notes [--ref <referència_de_notes>] [llista [<objecte>]]

source: git notes [--ref <notes_ref>] add [-f] [-m <msg> | -F <file> | (-c | -C) <object>] [<object>]
ca: git notes [--ref <referència_de_notes>] add [-f] [-m <missatge> | -F <fitxer> | (-c | -C) <objecte>] [<objecte>]

source: git notes [--ref <notes_ref>] copy [-f] <from-object> <to-object>
ca: git notes [--ref <referència_de_notes>] copy [-f] <d'objecte> <a-objecte>

source: git notes [--ref <notes_ref>] append [-m <msg> | -F <file> | (-c | -C) <object>] [<object>]
ca: git notes [--ref <referència_de_notes>] append [-m <missatge> | -F <fitxer> | (-c | -C) <objecte>] [<objecte>]

source: git notes [--ref <notes_ref>] edit [<object>]
ca: git notes [--ref <referència_de_notes>] edit [<objecte>]

source: git notes [--ref <notes_ref>] show [<object>]
ca: git notes [--ref <referència_de_notes>] show [<objecte>]

source: git notes [--ref <notes_ref>] merge [-v | -q] [-s <strategy> ] <notes_ref>
ca: git notes [--ref <referència_de_notes>] merge [-v | -q] [-s <estratègia> ] <referència_de_notes>

source: git notes [--ref <notes_ref>] remove [<object>...]
ca: git notes [--ref <referència_de_notes>] remove [<objecte>...]

source: git notes [--ref <notes_ref>] prune [-n | -v]
ca: git notes [--ref <referència_de_notes>] prune [-n | -v]

source: git notes [--ref <notes_ref>] get-ref
ca: git notes [--ref <referència_de_notes>] get-ref

source: git notes [list [<object>]]
ca: git notes [llista [<objecte>]]

source: git notes add [<options>] [<object>]
ca: git notes add [<opcions>] [<objecte>]

source: git notes copy [<options>] <from-object> <to-object>
ca: git notes copy [<options>] <d'objecte> <a-objecte>

source: git notes copy --stdin [<from-object> <to-object>]...
ca: git notes copy --stdin [<d'objecte> <a-objecte>]...

source: git notes append [<options>] [<object>]
ca: git notes append [<opcions>] [<objecte>]

source: git notes edit [<object>]
ca: git notes edit [<objecte>]

source: git notes show [<object>]
ca: git notes show [<objecte>]

source: git notes merge [<options>] <notes_ref>
ca: git notes merge [<opcions>] <referència_de_notes>

source: git notes merge --commit [<options>]
ca: git notes merge --commit [<opcions>]

source: git notes merge --abort [<options>]
ca: git notes merge --abort [<opcions>]

source: git notes remove [<object>]
ca: git notes remove [<objecte>]

source: git notes prune [<options>]
ca: git notes prune [<opcions>]

source: unable to start 'show' for object '%s'
ca: incapaç d'iniciar 'show' per al objecte '%s'

source: could not read 'show' output
ca: no s'ha pogut llegir la sortida de 'show'

source: failed to finish 'show' for object '%s'
ca: s'ha fallat al terminar 'show' per al objecte '%s'

source: could not create file '%s'
ca: no s'ha pogut crear el fitxer '%s'

source: Please supply the note contents using either -m or -F option
ca: Si us plau, proveïu els continguts de la nota utilitzant o l'opció -m o l'opció -F

source: Removing note for object %s
ca: Traient la nota de l'objecte %s

source: unable to write note object
ca: incapaç d'escriure l'objecte de nota

source: The note contents has been left in %s
ca: Els continguts de la nota s'han deixat en %s

source: cannot read '%s'
ca: no es pot llegir '%s'

source: could not open or read '%s'
ca: no s'ha pogut obrir ni llegir '%s'

source: Failed to resolve '%s' as a valid ref.
ca: S'ha fallat al resoldre '%s' com referència vàlida.

source: Failed to read object '%s'.
ca: S'ha fallat al llegir l'objecte '%s'.

source: Cannot read note data from non-blob object '%s'.
ca: No es pot llegir dades de node de l'objecte no de blob '%s'.

source: Malformed input line: '%s'.
ca: Línia d'entrada malformada: '%s'.

source: Failed to copy notes from '%s' to '%s'
ca: S'ha fallat al copiar les notes de '%s' a '%s'

source: too many parameters
ca: massa paràmetres

source: No note found for object %s.
ca: Cap nota trobada per a l'objecte %s.

source: note contents as a string
ca: nota els continguta com cadena

source: note contents in a file
ca: nota els continguts en un fitxer

source: object
ca: objecte

source: reuse and edit specified note object
ca: reutilitza i edita l'objecte de nota especificat

source: reuse specified note object
ca: reutilitza l'objecte de nota especificat
