Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: Submodule path '$displaypath': checked out '$sha1'
ca: Ruta de submòdul '$displaypath': agafat '$sha1'

source: Unable to rebase '$sha1' in submodule path '$displaypath'
ca: Incapaç de rebasar '$sha1' en la ruta de submòdul '$displaypath'

source: Submodule path '$displaypath': rebased into '$sha1'
ca: Ruta de submòdul '$displaypath': rebasada en '$sha1'

source: Unable to merge '$sha1' in submodule path '$displaypath'
ca: Incapaç de fusionar '$sha1' en la ruta de submòdul '$displaypath'

source: Submodule path '$displaypath': merged in '$sha1'
ca: Ruta de submòdul '$displaypath': fusionada en '$sha1'

source: Execution of '$command $sha1' failed in submodule path '$prefix$sm_path'
ca: L'execució de '$command $sha1' ha fallat en la ruta de submòdul '$prefix$sm_path'

source: Submodule path '$prefix$sm_path': '$command $sha1'
ca: Ruta de submòdul '$prefix$sm_path': '$command $sha1'

source: Failed to recurse into submodule path '$displaypath'
ca: S'ha fallat al recursar a la ruta de submòdul '$displaypath'

source: The --cached option cannot be used with the --files option
ca: L'opció --cached no es pot utilitzar amb l'opció --files

source: unexpected mode $mod_dst
ca: mode inesperat $mod_dst

source: Warn: $display_name doesn't contain commit $sha1_src
ca: Avís: $display_name no conté la comissió $sha1_src

source: Warn: $display_name doesn't contain commit $sha1_dst
ca: Avís: $display_name no conté la comissió $sha1_dst

source: Warn: $display_name doesn't contain commits $sha1_src and $sha1_dst
ca: Avís: $display_name no conté les comissions $sha1_src i $sha1_dst

source: Failed to recurse into submodule path '$sm_path'
ca: S'ha fallat al recursar a la ruta de submòdul '$sm_path'

source: Synchronizing submodule url for '$displaypath'
ca: Sincronitzant l'url de submòdul per a '$displaypath'
