Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: force overwrite of local branch
ca: força la sobreescriptura de la rama local

source: fetch from multiple remotes
ca: obtén de múltiples remots

source: fetch all tags and associated objects
ca: obtén tots les etiquetes i objectes associats

source: do not fetch all tags (--no-tags)
ca: no obtingues les etiquetes (--no-tags)

source: prune remote-tracking branches no longer on remote
ca: poda les rames amb seguiment remot que ja no estan en el remot

source: on-demand
ca: sota demanda

source: control recursive fetching of submodules
ca: controla l'obteniment recursiu de submòduls

source: keep downloaded pack
ca: desa el paquet baixat

source: allow updating of HEAD ref
ca: permet l'actualització de la referència HEAD

source: deepen history of shallow clone
ca: aprofundeix la història del clon superficial

source: convert to a complete repository
ca: converteix en un repositori complet

source: dir
ca: directori

source: prepend this to submodule path output
ca: anteposa això a la sortida de ruta del submòdul

source: default mode for recursion
ca: mode de recursivitat per defecte

source: accept refs that update .git/shallow
ca: accepta referències que actualitzin .git/shallow

source: refmap
ca: mapa de referències

source: specify fetch refmap
ca: mostra el mapa de referències d'obteniment

source: Couldn't find remote ref HEAD
ca: No s'ha pogut trobar la referència HEAD remota

source: object %s not found
ca: objecte %s no trobat

source: [up to date]
ca: [actualitzat]

source: ! %-*s %-*s -> %s (can't fetch in current branch)
ca: ! %-*s %-*s -> %s (no es pot obtenir en la rama actual)

source: [rejected]
ca: [rebutjat]

source: [tag update]
ca: [actualització d'etiqueta]

source: (unable to update local ref)
ca: (incapaç d'actualitzar la referència local)

source: [new tag]
ca: [etiqueta nova]

source: [new branch]
ca: [rama nova]

source: [new ref]
ca: [referència nova]

source: unable to update local ref
ca: incapaç d'actualitzar la referència local

source: forced update
ca: actualització forçada

source: (non-fast-forward)
ca: (sense avanç ràpid)

source: cannot open %s: %s
ca: no és pot obrir %s: %s

source: %s did not send all necessary objects
ca: %s no ha enviat tots els objectes necessaris

source: reject %s because shallow roots are not allowed to be updated
ca: rebutja %s perquè no es permet que els arrels superficials s'actualitzin

source: From %.*s
ca: De %.*s

source: some local refs could not be updated; try running 'git remote prune %s' to remove any old, conflicting branches
ca: algunes referències locals no s'han pogut actualitzar; intenteu executar 'git remote prune %s' per treure qualsevulla rama antiga o conflictiva

source: (%s will become dangling)
ca: (%s es tornarà penjant)

source: (%s has become dangling)
ca: (%s s'ha tornat penjant)

source: [deleted]
ca: [suprimit]

source: (none)
ca: (cap)

source: Refusing to fetch into current branch %s of non-bare repository
ca: Refusar obtenir a la rama actual %s d'un repositori no nu

source: Option "%s" value "%s" is not valid for %s
ca: L'opció "%s" amb valor "%s" no és vàlida per a %s

source: Option "%s" is ignored for %s
ca: S'ignora l'opció "%s" per a %s

source: Don't know how to fetch from %s
ca: No es sap com obtenir de %s

source: Fetching %s
ca: Obtenint %s

source: Could not fetch %s
ca: No s'ha pogut obtenir %s

source: No remote repository specified. Please, specify either a URL or a remote name from which new revisions should be fetched.
ca: Cap repositori remot especificat. Si us plau, especifiqueu o un URL o un nom remot del qual es deuen obtenir les revisions noves.

source: You need to specify a tag name.
ca: Necessiteu especificar un nom d'etiqueta.

source: --depth and --unshallow cannot be used together
ca: --depth i --unshallow no es poden utilitzar junts

source: --unshallow on a complete repository does not make sense
ca: --unshallow en un repositori complet no té sentit

source: fetch --all does not take a repository argument
ca: fetch --all no accepta un paràmetre de repositori

source: fetch --all does not make sense with refspecs
ca: fetch --all no té sentit amb especificacions de referència

source: No such remote or remote group: %s
ca: Cap remot o grup remot així: %s

source: Fetching a group and specifying refspecs does not make sense
ca: Obtenir un grup i especificar referències no té sentit

source: git fmt-merge-msg [-m <message>] [--log[=<n>]|--no-log] [--file <file>]
ca: git fmt-merge-msg [-m <missatge>] [--log[=<n>]|--no-log] [--file <fitxer>]

source: populate log with at most <n> entries from shortlog
ca: emplena el registre amb al màxim <n> entrades del registre curt

source: alias for --log (deprecated)
ca: àlies per --log (desaprovat)

source: use <text> as start of message
ca: utilitza <text> com inici de missatge

source: file to read from
ca: fitxer del qual llegir

source: git for-each-ref [options] [<pattern>]
ca: git for-each-ref [opcions] [<patró>]

source: quote placeholders suitably for shells
ca: posa els marcadors de posició entre cometes adequades per als terminals

source: quote placeholders suitably for perl
ca: posa els marcadors de posició entre cometes adequades per a perl

source: quote placeholders suitably for python
ca: posa els marcadors de posició entre cometes adequades per a python

source: quote placeholders suitably for tcl
ca: posa els marcadors de posició entre cometes adequades per a tcl

source: show only <n> matched refs
ca: mostra només <n> referències coincidents

source: format to use for the output
ca: format que utilitzar per a la sortida

source: key
ca: clau

source: field name to sort on
ca: nom de camp en el qual ordenar

source: Checking connectivity
ca: Comprovant connectivitat

source: Checking object directories
ca: Comprovant els directoris d'objecte

source: git fsck [options] [<object>...]
ca: git fsck [opcions] [<objecte>...]

source: show unreachable objects
ca: mostra els objects inabastable

source: show dangling objects
ca: mostra els objectes penjants

source: report tags
ca: informa de les etiquetes

source: report root nodes
ca: informa dels nodes d'arrel

source: make index objects head nodes
ca: fes els objectes d'índex nodes de cap

source: make reflogs head nodes (default)
ca: fes notes de cap de registres de referències (per defecte)

source: also consider packs and alternate objects
ca: també considera els paquets i els objectes alternatius

source: enable more strict checking
ca: habilita comprovació més estricta

source: write dangling objects in .git/lost-found
ca: escriu objectes penjants a .git/lost-found

source: show progress
ca: mostra progrés

source: Checking objects
ca: Comprovant objectes

source: git gc [options]
ca: git gc [opcions]

source: Invalid %s: '%s'
ca: %s invàlid: '%s'

source: insanely long object directory %.*s
ca: directori d'objectes increïblement llarga %.*s

source: prune unreferenced objects
ca: poda objectes sense referència

source: be more thorough (increased runtime)
ca: siguis més exhaustiu (temps d'execució augmentat)

source: enable auto-gc mode
ca: habilita mode de recollida d'escombraries automàtica

source: force running gc even if there may be another gc running
ca: força l'execució de gc encara que hi pugui haver altre gc executant

source: Auto packing the repository in background for optimum performance.
ca: Empaquetant automàticament el repositori en el fons per rendiment optim.

source: Auto packing the repository for optimum performance.
ca: Empaquetant automàticament el repositori per rendiment optim.

source: See "git help gc" for manual housekeeping.
ca: Veu "git help gc" per neteja manual.

source: gc is already running on machine '%s' pid %<PRIuMAX> (use --force if not)
ca: gc ja està executant en la màquina '%s' pid %<PRIuMAX> (utilitzeu --force si no)

source: There are too many unreachable loose objects; run 'git prune' to remove them.
ca: Hi ha massa objectes solts inabastables; executeu 'git prune' per treure'ls.

source: git grep [options] [-e] <pattern> [<rev>...] [[--] <path>...]
ca: git grep [opcions] [-e] <patró> [<revisió>...] [[--] <ruta>...]

source: grep: failed to create thread: %s
ca: grep: s'ha fallat al crear fil: %s

source: unable to read tree (%s)
ca: incapaç de llegir l'arbre (%s)

source: unable to grep from object of type %s
ca: no es pot fer grep des d'un objecte de tipus %s

source: switch `%c' expects a numerical value
ca: l'ópcio `%c' espera un valor numèric

source: cannot open '%s'
ca: no es pot obrir '%s'

source: search in index instead of in the work tree
ca: cerca en l'índex en lloc de l'arbre de treball

source: find in contents not managed by git
ca: cerca en continguts no gestionats per git

source: search in both tracked and untracked files
ca: cerca en ambdós els fitxers seguits i no seguits

source: search also in ignored files
ca: cerca en els fitxers ignorats també

source: show non-matching lines
ca: mostra les línies no coincidents

source: case insensitive matching
ca: coincidència insensible a majúscula i minúscula

source: match patterns only at word boundaries
ca: coincideix amb els patrons només als límits de paraula

source: process binary files as text
ca: processa els fitxers binaris com text

source: don't match patterns in binary files
ca: no coincideixis amb els patrons en els fitxers binaris

source: process binary files with textconv filters
ca: processa els fitxers binaris amb filtres de textconv

source: descend at most <depth> levels
ca: descendeix al màxim <profunditat> nivells

source: use extended POSIX regular expressions
ca: utilitza expressions regulars POSIX esteses

source: use basic POSIX regular expressions (default)
ca: utilitza expressions regulars POSIX bàsiques (per defecte)

source: interpret patterns as fixed strings
ca: interpreta els patrons com cadenes fixades

source: use Perl-compatible regular expressions
ca: utilitza expressions regulars compatibles amb Perl

source: show line numbers
ca: mostra els números de línia

source: don't show filenames
ca: no mostris els noms de fitxer

source: show filenames
ca: mostra els noms de fitxer

source: show filenames relative to top directory
ca: mostra els noms de fitxer relatiu al directori superior

source: show only filenames instead of matching lines
ca: mostra només els noms de fitxer en lloc de les línies coincidents

source: synonym for --files-with-matches
ca: sinònim per --files-with-matches

source: show only the names of files without match
ca: mostra només els noms dels fitxers sense coincidència

source: print NUL after filenames
ca: imprimeix NUL desprès dels noms de fitxer

source: show the number of matches instead of matching lines
ca: mostra el nombre de coincidències en lloc de les línies coincidents

source: highlight matches
ca: ressalta les coincidències

source: print empty line between matches from different files
ca: imprimeix una línia buida entre coincidències de fitxers distintes

source: show filename only once above matches from same file
ca: mostra el nom de fitxer només una vegada a dalt de les coincidències del mateix fitxer

source: show <n> context lines before and after matches
ca: mostra <n> línies de context abans i després d'una coincidència

source: show <n> context lines before matches
ca: mostra <n> línies de context abans d'una coincidència

source: show <n> context lines after matches
ca: mostra <n> línies de context després d'una coincidència

source: shortcut for -C NUM
ca: drecera per -C NUM

source: show a line with the function name before matches
ca: mostra una línia amb el nom de funció abans de les coincidències

source: show the surrounding function
ca: mostra la funció alrededor

source: read patterns from file
ca: llegeix els patrons des d'un fitxer

source: match <pattern>
ca: coincideix amb <patró>

source: combine patterns specified with -e
ca: combina els patrons especificats amb -e

source: indicate hit with exit status without output
ca: indica coincidència amb estat de sortida sense sortida de text

source: show only matches from files that match all patterns
ca: mostra només les coincidències dels fitxers que coincideixin amb tots els patrons

source: show parse tree for grep expression
ca: mostra l'arbre d'anàlisis de l'expressió de grep

source: pager
ca: paginador

source: show matching files in the pager
ca: mostra els fitxers coincidents en el paginador

source: allow calling of grep(1) (ignored by this build)
ca: permet la invocació de grep(1) (ignorat per aquesta compilació)

source: show usage
ca: mostra l'ús

source: no pattern given.
ca: cap patró donat.

source: --open-files-in-pager only works on the worktree
ca: --open-files-in-pager només funciona en l'arbre de treball

source: --cached or --untracked cannot be used with --no-index.
ca: --cached o --untracked no es pot utilitzar amb --no-index.

source: --no-index or --untracked cannot be used with revs.
ca: --no-index o --untracked no es poden utilitzar amb revisions.

source: --[no-]exclude-standard cannot be used for tracked contents.
ca: --[no-]exclude-standard no es pot utilitzar per als continguts seguits.

source: both --cached and trees are given.
ca: s'ha donat ambdós --caches i arbres.

source: git hash-object [-t <type>] [-w] [--path=<file>|--no-filters] [--stdin] [--] <file>...
ca: git hash-object [-t <tipus>] [-w] [--path=<fitxer>|--no-filters] [--stdin] [--] <fitxer>...

source: git hash-object --stdin-paths < <list-of-paths>
ca: git hash-object --stdin-paths < <llista-de-rutes>

source: type
ca: tipus

source: object type
ca: tipus d'objecte

source: write the object into the object database
ca: escriu l'objecte al base de dades d'objectes

source: read the object from stdin
ca: llegiu l'objecte des de stdin

source: store file as is without filters
ca: emmagatzema el fitxer tal com és sense filtres

source: process file as it were from this path
ca: processa el fitxer com si fos d'aquesta ruta

source: print all available commands
ca: imprimeix tots els ordres disponibles

source: print list of useful guides
ca: imprimeix la llista de guies útils

source: show man page
ca: mostra la pàgina de manual

source: show manual in web browser
ca: mostra la pàgina de manual en el navegador web

source: show info page
ca: mostra la pàgina d'informació

source: git help [--all] [--guides] [--man|--web|--info] [command]
ca: git help [--all] [--guides] [--man|--web|--info] [ordre]

source: unrecognized help format '%s'
ca: format d'ajuda no reconegut '%s'

source: Failed to start emacsclient.
ca: S'ha fallat al iniciar emacsclient.

source: Failed to parse emacsclient version.
ca: S'ha fallat al analitzar la versió d'emacsclint.

source: emacsclient version '%d' too old (< 22).
ca: la versió d'emacsclient '%d' és massa vella (< 22).

source: failed to exec '%s': %s
ca: s'ha fallat al executar '%s': %s

source: '%s': path for unsupported man viewer. Please consider using 'man.<tool>.cmd' instead.
ca: '%s': ruta d'un visualitzador de manuals no suportat. Si us plau, considereu utilitzar 'man.<tool>.cmd' en lloc.

source: '%s': cmd for supported man viewer. Please consider using 'man.<tool>.path' instead.
ca: '%s': ordre per un visualitzador de manuals suportat. Si us plau, considereu utilitzar 'man.<tool>.path' en lloc.

source: '%s': unknown man viewer.
ca: '%s': visualitzador de manuals desconegut

source: no man viewer handled the request
ca: cap visualitzador de manuals ha manejat la sol·licitud

source: no info viewer handled the request
ca: cap visualitzador d'informació ha manejat la sol·licitud

source: Defining attributes per path
ca: La definició d'atributs per ruta

source: A Git glossary
ca: Un glossari de Git

source: Specifies intentionally untracked files to ignore
ca: Especifica fitxers intencionalment no seguits que ignorar

source: Defining submodule properties
ca: La definició dels propietats de submòduls

source: Specifying revisions and ranges for Git
ca: L'especificació de revisions i rangs per a Git

source: A tutorial introduction to Git (for version 1.5.1 or newer)
ca: Una introducció tutorial a Git (per a la versió 1.5.1 o més nou)

source: An overview of recommended workflows with Git
ca: Una visió de conjunt de fluxos de treball recomanats amb Git

source: The common Git guides are:
ca: Les guies de Git comunes són:

source: usage: %s%s
ca: ús: %s%s

source: `git %s' is aliased to `%s'
ca: `git %s' és àlies a `%s'

source: unable to open %s
ca: incapaç d'obrir %s

source: object type mismatch at %s
ca: discordança de tipus d'objecte a %s

source: did not receive expected object %s
ca: no s'ha rebut l'objecte esperat %s

source: object %s: expected type %s, found %s
ca: objecte %s: tipus %s esperat, %s trobat

source: cannot fill %d byte
ca: no es pot omplir %d octet

source: early EOF
ca: EOF aviat

source: read error on input
ca: error de lectura d'entrada

source: used more bytes than were available
ca: més octets utilitzats que estaven disponibles

source: pack too large for current definition of off_t
ca: paquet massa gran per a la definició actual d'off_t

source: unable to create '%s'
ca: no es pot crear '%s'

source: cannot open packfile '%s'
ca: no es pot obrir el fitxer de paquet '%s'

source: pack signature mismatch
ca: discordança de firma de paquet

source: pack version %<PRIu32> unsupported
ca: versió de paquet %<PRIu32> no suportada

source: pack has bad object at offset %lu: %s
ca: el paquet té un objecte dolent a desplaçament %lu: %s

source: inflate returned %d
ca: la inflació ha retornat %d

source: offset value overflow for delta base object
ca: desbordament de valor de desplaçament per a l'objecte base de delta

source: delta base offset is out of bound
ca: desplaçament de base de delta està fora de límits

source: unknown object type %d
ca: tipus d'objecte desconegut %d

source: cannot pread pack file
ca: no es pot fer pread en en fitxer de paquet

source: premature end of pack file, %lu byte missing
ca: fin prematur de fitxer de paquet, manca %lu octet

source: serious inflate inconsistency
ca: inconsistència d'inflació seria

source: SHA1 COLLISION FOUND WITH %s !
ca: COL·LISIÓ SHA1 TROBAT AMB %s !

source: unable to read %s
ca: incapaç de llegir %s

source: cannot read existing object %s
ca: no es pot llegir l'objecte existent %s

source: invalid blob object %s
ca: objecte de blob invàlid %s

source: invalid %s
ca: %s invàlid

source: Error in object
ca: Error en objecte

source: Not all child objects of %s are reachable
ca: No tots els objectes fills de %s són abastables

source: failed to apply delta
ca: s'ha fallat al aplicar delta

source: Receiving objects
ca: Rebent objectes

source: Indexing objects
ca: Indexant objectes

source: pack is corrupted (SHA1 mismatch)
ca: el paquet és corromput (discordança SHA1)

source: cannot fstat packfile
ca: no es pot fer fstat en en fitxer de paquet

source: pack has junk at the end
ca: el paquet té brossa al final

source: confusion beyond insanity in parse_pack_objects()
ca: confusió més enllà de la insanitat en parse_pack_objects()

source: Resolving deltas
ca: Resolent les deltes

source: unable to create thread: %s
ca: incapaç de crear fil: %s

source: confusion beyond insanity
ca: confusió més enllà de la insanitat

source: completed with %d local objects
ca: terminat amb %d objectes locals

source: Unexpected tail checksum for %s (disk corruption?)
ca: Suma de verificació final no esperada per a %s (corrupció de disc?)

source: pack has %d unresolved delta
ca: El paquet té %d delta no resolta

source: unable to deflate appended object (%d)
ca: incapaç de desinflar l'objecte annexat (%d)

source: local object %s is corrupt
ca: l'objecte local %s és corrupte

source: error while closing pack file
ca: error al tancar el fitxer de paquet

source: cannot write keep file '%s'
ca: no es pot escriure el fitxer que retenir '%s'

source: cannot close written keep file '%s'
ca: no es pot tancar el fitxer que retenir escrit '%s'

source: cannot store pack file
ca: no es pot emmagatzemar el fitxer de paquet

source: cannot store index file
ca: no es pot emmagatzemar el fitxer d'índex

source: bad pack.indexversion=%<PRIu32>
ca: pack.indexversion=%<PRIu32> dolent

source: invalid number of threads specified (%d)
ca: nombre de fils invàlid especificat (%d)

source: no threads support, ignoring %s
ca: cap suport de fils, ignorant %s

source: Cannot open existing pack file '%s'
ca: No es pot obrir el fitxer de paquet existent '%s'

source: Cannot open existing pack idx file for '%s'
ca: No es pot obrir el fitxer d'índex de paquets existent de '%s'

source: non delta: %d object
ca: sense delta: %d objecte

source: chain length = %d: %lu object
ca: longitud de cadena = %d: %lu objecte

source: Cannot come back to cwd
ca: No es pot tornar al directori de treball actual

source: bad %s
ca: %s dolent

source: --fix-thin cannot be used without --stdin
ca: --fix-thin no es pot utilitzar sense --stdin

source: packfile name '%s' does not end with '.pack'
ca: el nom de fitxer de paquet '%s' no termina amb '.pack'

source: --verify with no packfile name given
ca: --verify donat sense nom de fitxer de paquet

source: Could not make %s writable by group
ca: No s'ha pogut fer %s escrivible pel grup

source: insanely long template name %s
ca: nom de plantilla insanament llarg %s

source: cannot stat '%s'
ca: no es pot fer stat en '%s'

source: cannot stat template '%s'
ca: no es pot fer stat en la plantilla '%s'

source: cannot opendir '%s'
ca: no es pot fer opendir en el directori '%s'

source: cannot readlink '%s'
ca: no es pot fer readlink en '%s'

source: insanely long symlink %s
ca: enllaç simbòlic insanament llarg %s

source: cannot symlink '%s' '%s'
ca: no es pot fer symlink en '%s' '%s'

source: cannot copy '%s' to '%s'
ca: no es pot copiar '%s' a '%s'

source: ignoring template %s
ca: ignorant la plantilla %s

source: insanely long template path %s
ca: enllaç ruta de plantilla %s

source: templates not found %s
ca: plantilles no trobades %s

source: not copying templates of a wrong format version %d from '%s'
ca: no copiant plantilles d'una versió de format errònia %d de '%s'

source: insane git directory %s
ca: directori de git boig %s

source: %s already exists
ca: %s ja existeix

source: unable to handle file type %d
ca: incapaç de manejar el tipus de fitxer %d

source: unable to move %s to %s
ca: incapaç de moure %s a %s

source: %s%s Git repository in %s%s
ca: %s%s repositori de Git en %s%s

source: Reinitialized existing
ca: Reinicialitzat existent

source: Initialized empty
ca: Inicialitzat buit

source: shared
ca: compartit

source: cannot tell cwd
ca: no es pot determinar el directori de treball actual

source: git init [-q | --quiet] [--bare] [--template=<template-directory>] [--shared[=<permissions>]] [directory]
ca: git init [-q | --quiet] [--bare] [--template=<directori-de-plantilla>] [--shared[=<permisos>]] [directori]

source: permissions
ca: permisos

source: specify that the git repository is to be shared amongst several users
ca: especifica que el repositori de git es compartirà entre diversos usuaris

source: be quiet
ca: calla

source: cannot mkdir %s
ca: no es pot mkdir %s

source: cannot chdir to %s
ca: no es pot chdir a %s

source: %s (or --work-tree=<directory>) not allowed without specifying %s (or --git-dir=<directory>)
ca: no es permet %s (o --work-tree=<directori>) sense especificar %s (o --git-dir=<directori>)

source: Cannot access current working directory
ca: No es pot accedir al directori de treball corrent

source: Cannot access work tree '%s'
ca: No es pot accedir al arbre de treball '%s'

source: git log [<options>] [<revision range>] [[--] <path>...]
ca: git log [<opcions>] [<rang de revisions>] [[--] <ruta>...]

source: or: git show [options] <object>...
ca: o: git show [opcions] <objecte>...

source: suppress diff output
ca: omet la sortida de diferències
