Repository: centic9/git-ppa
Catalog: po/*.po
Languages: ca

source: hint: %.*s
ca: indirecta: %.*s

source: Fix them up in the work tree, and then use 'git add/rm <file>' as appropriate to mark resolution and make a commit, or use 'git commit -a'.
ca: Arregleu-los en l'arbre de treball, i després utilitzeu 'git add/rm <fitxer>' segons sigui apropiat per marcar la resolució i feu una comissió, o utilitzeu 'git commit -a'.

source: git archive [options] <tree-ish> [<path>...]
ca: git archive [opcions] <arbre> [<ruta>...]

source: git archive --remote <repo> [--exec <cmd>] [options] <tree-ish> [<path>...]
ca: git archive --remote <repositori> [--exec <ordre>] [opcions] <arbre> [<ruta>...]

source: git archive --remote <repo> [--exec <cmd>] --list
ca: git archive --remote <repositori> [--exec <ordre>] --list

source: pathspec '%s' did not match any files
ca: L'especificació de ruta '%s' no ha concordat amb cap fitxer

source: fmt
ca: format

source: archive format
ca: format d'arxiu

source: prepend prefix to each pathname in the archive
ca: anteposa el prefix a cada nom de ruta en l'arxiu

source: file
ca: fitxer

source: write the archive to this file
ca: escriu l'arxiu a aquest fitxer

source: read .gitattributes in working directory
ca: llegeix .gitattributes en el directori de treball

source: report archived files on stderr
ca: informa de fitxers arxivats en stderr

source: store only
ca: només emmagatzemar

source: compress faster
ca: comprimeix més ràpid

source: compress better
ca: comprimeix millor

source: list supported archive formats
ca: allista els formats d'arxiu suportats

source: repo
ca: repositori

source: retrieve the archive from remote repository <repo>
ca: recupera l'arxiu del repositori remot <repositori>

source: command
ca: ordre

source: path to the remote git-upload-archive command
ca: ruta a l'ordre git-upload-archive remot

source: Negative patterns are ignored in git attributes Use '\!' for literal leading exclamation.
ca: Els patrons negatius s'ignoren en els atributes de git Utilitzeu '\!' per exclamació capdavantera literal.

source: Not setting branch %s as its own upstream.
ca: No establint la rama %s com la seva pròpia font.

source: Branch %s set up to track remote branch %s from %s by rebasing.
ca: La rama %s està configurada per seguir la rama remota %s de %s per rebasar.

source: Branch %s set up to track remote branch %s from %s.
ca: La rama %s està configurada per seguir la rama remota %s de %s.

source: Branch %s set up to track local branch %s by rebasing.
ca: La rama %s està configurada per seguir la rama local %s per rebasar.

source: Branch %s set up to track local branch %s.
ca: La rama %s està configurada per seguir la rama local %s.

source: Branch %s set up to track remote ref %s by rebasing.
ca: La rama %s està configurada per seguir la referència remota %s per rebasar.

source: Branch %s set up to track remote ref %s.
ca: La rama %s està configurada per seguir la referència remota %s.

source: Branch %s set up to track local ref %s by rebasing.
ca: La rama %s està configurada per seguir la referència local %s per rebasar.

source: Branch %s set up to track local ref %s.
ca: La rama %s està configurada per seguir la referència local %s.

source: Not tracking: ambiguous information for ref %s
ca: No seguint: informació ambigua per a la referència %s

source: '%s' is not a valid branch name.
ca: '%s' no és un nom de rama vàlid.

source: A branch named '%s' already exists.
ca: Una rama amb nom '%s' ja existeix.

source: Cannot force update the current branch.
ca: No es pot actualitzar la rama actual a la força.

source: Cannot setup tracking information; starting point '%s' is not a branch.
ca: No es pot configurar la informació de seguimiento; el punt inicial '%s' no és una rama.

source: the requested upstream branch '%s' does not exist
ca: la rama font demanada '%s' no existeix

source: If you are planning on basing your work on an upstream branch that already exists at the remote, you may need to run "git fetch" to retrieve it. If you are planning to push out a new local branch that will track its remote counterpart, you may want to use "git push -u" to set the upstream config as you push.
ca: Si planeu basar el teu treball en una rama font que ja existeix al remot, pot que necessiteu executar "git fetch" per obtenir-la. Si planeu pujar una rama local nova que seguirà la seva contrapart remota, pot que voleu utilitzar "git push -u" per establir la configuració font mentre pugeu.

source: Not a valid object name: '%s'.
ca: No és un nom d'objecte vàlid: '%s'.

source: Ambiguous object name: '%s'.
ca: Nom d'objecte ambigu: '%s'.

source: Not a valid branch point: '%s'.
ca: No és un punt de ramificació vàlid: '%s'.

source: Failed to lock ref for update
ca: S'ha fallat al bloquejar la referència per actualització

source: Failed to write ref
ca: S'ha fallat al escriure la referència

source: '%s' does not look like a v2 bundle file
ca: '%s' no sembla a un fitxer d'embolic v2

source: unrecognized header: %s%s (%d)
ca: capçalera no reconeguda: %s%s (%d)

source: could not open '%s'
ca: no s'ha pogut obrir '%s'

source: Repository lacks these prerequisite commits:
ca: Al repositori manquen aquestes comissions prerequisits:

source: revision walk setup failed
ca: la configuració del passeig per revisions ha fallat

source: The bundle contains this ref:
ca: L'embolic conté aquesta referència:

source: The bundle records a complete history.
ca: L'embolic registra una història completa.

source: The bundle requires this ref:
ca: L'embolic requereix aquesta referència:

source: rev-list died
ca: El rev-list s'ha mort

source: unrecognized argument: %s
ca: paràmetre no reconegut: %s

source: ref '%s' is excluded by the rev-list options
ca: la referència '%s' s'exclou per les opcions de rev-list

source: Refusing to create empty bundle.
ca: Refusant crear un embolic buit.

source: Could not spawn pack-objects
ca: No s'ha pogut executar el pack-objects

source: pack-objects died
ca: El pack-objects s'ha mort

source: cannot create '%s'
ca: no es pot crear '%s'

source: index-pack died
ca: L'index-pack s'ha mort

source: could not parse %s
ca: no s'ha pogut analitzar %s

source: %s %s is not a commit!
ca: %s %s no és una comissió!

source: memory exhausted
ca: memòria esgotada

source: Could not run 'git rev-list'
ca: No s'ha pogut executar 'git rev-list'

source: failed write to rev-list: %s
ca: escriptura fallada al rev-list: %s

source: failed to close rev-list's stdin: %s
ca: s'ha fallat al tancar el stdin del rev-list: %s

source: in the future
ca: en el futur

source: %lu second ago
ca: fa %lu segon

source: %lu minute ago
ca: fa %lu minut

source: %lu hour ago
ca: fa %lu hora

source: %lu day ago
ca: fa %lu dia

source: %lu week ago
ca: fa %lu setmana

source: %lu month ago
ca: fa %lu mes

source: %lu year
ca: %lu any

source: %s, %lu month ago
ca: %s, fa %lu mes

source: %lu year ago
ca: fa %lu any

source: failed to read orderfile '%s'
ca: s'ha fallat al llegir el fitxer d'ordres '%s'

source: Performing inexact rename detection
ca: Realitzant detecció inexacte de canvi de nom

source: Failed to parse dirstat cut-off percentage '%s'
ca: S'ha fallat al analitzar el percentatge limitant de dirstat '%s'

source: Unknown dirstat parameter '%s'
ca: Paràmetre de dirstat desconegut '%s'

source: Unknown value for 'diff.submodule' config variable: '%s'
ca: Valor desconegut del variable de configuració de 'diff.submodule': '%s'

source: Found errors in 'diff.dirstat' config variable: %s
ca: Errors trobat en el variable de configuració 'diff.dirstat': %s

source: external diff died, stopping at %s
ca: El diff external s'ha mort, aturant a %s

source: --follow requires exactly one pathspec
ca: --follow requereix exactament una especificació de ruta

source: Failed to parse --dirstat/-X option parameter: %s
ca: S'ha fallat al analitzar el paràmetre d'opció de --dirstat/-X: %s

source: Failed to parse --submodule option parameter: '%s'
ca: S'ha fallat al analitzar el paràmetre d'opció de --submodule: %s

source: could not run gpg.
ca: no s'ha pogut executar el gpg.

source: gpg did not accept the data
ca: El gpg no ha acceptat les dades

source: gpg failed to sign the data
ca: gpg ha fallat al firmar les dades

source: could not create temporary file '%s': %s
ca: no s'ha pogut crear el fitxer temporal '%s': %s

source: failed writing detached signature to '%s': %s
ca: s'ha fallat al escriure la firma separada a '%s': %s

source: '%s': unable to read %s
ca: '%s': incapaç de llegir %s

source: '%s': short read %s
ca: '%s': lectura corta %s

source: available git commands in '%s'
ca: ordres de git disponibles en '%s'

source: git commands available from elsewhere on your $PATH
ca: ordres de git disponibles d'altres llocs en la vostra $PATH

source: The most commonly used git commands are:
ca: Els ordres de git més freqüentment utilitzats són:

source: '%s' appears to be a git command, but we were not able to execute it. Maybe git-%s is broken?
ca: '%s' sembla un ordre git, però no hem pogut executar-lo. Pot ser que git-%s està estropejat?

source: Uh oh. Your system reports no Git commands at all.
ca: Ai. El vostre sistema no informa de cap ordre de Git.

source: WARNING: You called a Git command named '%s', which does not exist. Continuing under the assumption that you meant '%s'
ca: AVÍS: Heu invocat un ordre de Git amb nom '%s', el qual no existeix. Continuant baix l'assumpció que volíeu dir '%s'

source: in %0.1f seconds automatically...
ca: en %0.1f segons automàticament...

source: git: '%s' is not a git command. See 'git --help'.
ca: git: '%s' no és un ordre de git. Veu 'git --help'.

source: Did you mean this?
ca: Volíeu dir això?

source: failed to read the cache
ca: s'ha fallat al llegir la memòria cau

source: unable to write new index file
ca: incapaç d'escriure un nou fitxer d'índex

source: (bad commit)
ca: (comissió dolenta)

source: addinfo_cache failed for path '%s'
ca: addinfo_cache ha fallat per a la ruta '%s'

source: error building trees
ca: error al construir arbres

source: failed to create path '%s'%s
ca: s'ha fallat al crear la ruta '%s' %s

source: Removing %s to make room for subdirectory
ca: Traient %s per fer espai per al subdirectori

source: : perhaps a D/F conflict?
ca: : potser un conflicte D/F?

source: refusing to lose untracked file at '%s'
ca: refusant perdre el fitxer seguit a '%s'

source: cannot read object %s '%s'
ca: no es pot llegir l'objecte %s '%s'

source: blob expected for %s '%s'
ca: blob esperat per a %s '%s'

source: failed to open '%s'
ca: s'ha fallat al obrir '%s'

source: failed to symlink '%s'
ca: s'ha fallat al fer l'enllaç simbòlic '%s'

source: do not know what to do with %06o %s '%s'
ca: no es sap què fer amb %06o %s '%s'

source: Failed to execute internal merge
ca: S'ha fallat al executar la fusió interna

source: Unable to add %s to database
ca: Incapaç d'afegir %s al base de dades

source: unsupported object type in the tree
ca: tipus d'objecte no suportat en l'arbre

source: CONFLICT (%s/delete): %s deleted in %s and %s in %s. Version %s of %s left in tree.
ca: CONFLICTE: (%s/supressió): %s suprimit en %s i %s en %s. La versió %s de %s s'ha deixat en l'arbre.

source: CONFLICT (%s/delete): %s deleted in %s and %s in %s. Version %s of %s left in tree at %s.
ca: CONFLICTE: (%s/supressió): %s suprimit en %s i %s en %s. La versió %s de %s s'ha deixat en l'arbre a %s.

source: rename
ca: canvia de nom

source: renamed
ca: canviat de nom

source: %s is a directory in %s adding as %s instead
ca: %s és un directori en %s; afegint com %s en lloc

source: CONFLICT (rename/rename): Rename "%s"->"%s" in branch "%s" rename "%s"->"%s" in "%s"%s
ca: CONFLICTE (canvi de nom/canvi de nom): Canvi de nom "%s"->"%s" en la rama "%s" canvi de nom "%s"->"%s" en "%s"%s

source: (left unresolved)
ca: (deixat sense resolució)

source: CONFLICT (rename/rename): Rename %s->%s in %s. Rename %s->%s in %s
ca: CONFLICTE (canvi de nom/canvi de nom): Canvi de nom %s->%s en %s. Canvi de nom %s->%s en %s

source: Renaming %s to %s and %s to %s instead
ca: Canviant el nom de %s a %s i %s a %s en lloc

source: CONFLICT (rename/add): Rename %s->%s in %s. %s added in %s
ca: CONFLICTE (supressió/afegiment): Canvi de nom %s->%s en %s. %s afegit en %s

source: Adding merged %s
ca: Afegint %s fusionat

source: Adding as %s instead
ca: Afegint com %s en lloc

source: cannot read object %s
ca: no es pot llegir l'objecte %s

source: object %s is not a blob
ca: L'objecte %s no és un blob

source: modify
ca: modifica

source: modified
ca: modificat

source: content
ca: contingut

source: add/add
ca: afegeix/afegeix

source: Skipped %s (merged same as existing)
ca: %s saltat (el fusionat és igual a l'existent)

source: Auto-merging %s
ca: Autofusionant %s

source: submodule
ca: submòdul

source: CONFLICT (%s): Merge conflict in %s
ca: CONFLICTE (%s): Conflicte de fusió en %s

source: Removing %s
ca: Traient %s

source: file/directory
ca: fitxer/directori

source: directory/file
ca: directori/fitxer

source: CONFLICT (%s): There is a directory with name %s in %s. Adding %s as %s
ca: CONFLICTE (%s=: Hi ha un directori amb nom %s en %s. Afegint %s com %s

source: Adding %s
ca: Afegint %s

source: Fatal merge failure, shouldn't happen.
ca: Fallat de fusió fatal; això no ha de passar.

source: Already up-to-date!
ca: Ja actualitzat!

source: merging of trees %s and %s failed
ca: la fusió dels arbres %s i %s ha fallat

source: Unprocessed path??? %s
ca: Ruta no processat??? %s

source: Merging:
ca: Fusionant:

source: found %u common ancestor:
ca: %u avantpassat trobat:

source: merge returned no commit
ca: la fusió no ha retornat cap comissió

source: Could not parse object '%s'
ca: No s'ha pogut analitzar l'objecte '%s'

source: Unable to write index.
ca: Incapaç d'escriure l'índex.

source: Cannot commit uninitialized/unreferenced notes tree
ca: No es pot cometre un arbre de notes no inicialitzat/no referenciat

source: Bad notes.rewriteMode value: '%s'
ca: Valor de notes.rewriteMode dolent: '%s'

source: Refusing to rewrite notes in %s (outside of refs/notes/)
ca: Refusant reescriure les notes en %s (fora de refs/notes/)

source: Bad %s value: '%s'
ca: Valor dolent de %s: '%s'

source: unable to parse object: %s
ca: incapaç d'analitzar l'objecte: %s

source: usage: %s
ca: ús: %s

source: or: %s
ca: o: %s

source: global 'glob' and 'noglob' pathspec settings are incompatible
ca: els ajusts d'especificació de ruta 'glob' i 'noglob' globals són incompatibles

source: global 'literal' pathspec setting is incompatible with all other global pathspec settings
ca: l'ajust d'especificació de ruta 'literal' global és incompatible amb tots els altres ajusts d'especificació de ruta globals

source: invalid parameter for pathspec magic 'prefix'
ca: paràmetre invàlid per a la màgica d'especificació de ruta 'prefix'

source: Invalid pathspec magic '%.*s' in '%s'
ca: Màgica d'especificació de ruta invàlida '%.*s' en '%s'

source: Missing ')' at the end of pathspec magic in '%s'
ca: ')' mancant al final de la màgica d'especificació de ruta en '%s'

source: Unimplemented pathspec magic '%c' in '%s'
ca: Màgica d'especificació de ruta no implementada '%c' en '%s'

source: %s: 'literal' and 'glob' are incompatible
ca: %s: 'literal' i 'glob' són incompatibles

source: %s: '%s' is outside repository
ca: %s: '%s' està fora del repositori

source: Pathspec '%s' is in submodule '%.*s'
ca: L'especificació '%s' està en el submòdul '%.*s'

source: %s: pathspec magic not supported by this command: %s
ca: %s: aquest ordre no suporta la màgica d'especificació de ruta: %s

source: pathspec '%s' is beyond a symbolic link
ca: l'especificació de ruta '%s' està més allà d'un enllaç simbòlic

source: There is nothing to exclude from by :(exclude) patterns. Perhaps you forgot to add either ':/' or '.' ?
ca: No hi ha res que excloure per patrons :(exclusió). Potser heu oblidat afegir o ':/' o '.' ?

source: done
ca: fet

source: index.version set, but the value is invalid. Using version %i
ca: index.version establert, però el valor és invàlid. Utilitzant la versió %i

source: GIT_INDEX_VERSION set, but the value is invalid. Using version %i
ca: GIT_INDEX_VERSION establert, però el valor és invàlid. Utilitzant la versió %i

source: Cannot fetch both %s and %s to %s
ca: No és pot obtenir ambdós %s i %s a %s

source: %s usually tracks %s, not %s
ca: %s generalment segueix %s, no %s

source: %s tracks both %s and %s
ca: %s segueix ambdós %s i %s

source: Internal error
ca: Error intern

source: Your branch is based on '%s', but the upstream is gone.
ca: La teva rama està basada en '%s', però la font no està.

source: (use "git branch --unset-upstream" to fixup)
ca: (utilitzeu "git branch --unset-upstream" per arreglar)

source: Your branch is up-to-date with '%s'.
ca: La vostra rama està actualitzada amb '%s'.

source: Your branch is ahead of '%s' by %d commit.
ca: La vostra rama està davant de '%s' per %d comissions.

source: (use "git push" to publish your local commits)
ca: (utilitzeu "git push" per publicar els vostres comissions locals)

source: Your branch is behind '%s' by %d commit, and can be fast-forwarded.
ca: La vostra rama està darrere de '%s' per %d comissió, i pot avançar-se ràpidament.

source: (use "git pull" to update your local branch)
ca: (utilitzeu "git pull" per actualitzar la vostra rama local)

source: Your branch and '%s' have diverged, and have %d and %d different commit each, respectively.
ca: La vostra rama i '%s' s'han divergit, i tenen %d i %d comissió distinta cada una, respectivament.

source: (use "git pull" to merge the remote branch into yours)
ca: (utilitzeu "git pull" per fusionar la rama remota a la vostra)

source: open /dev/null failed
ca: s'ha fallat al obrir /dev/null

source: dup2(%d,%d) failed
ca: dup2(%d,%d) s'ha fallat

source: Could not open '%s' for writing
ca: No s'ha pogut obrir '%s' per a escriptura

source: Could not write to '%s'
ca: No s'ha pogut escriure al '%s'

source: after resolving the conflicts, mark the corrected paths with 'git add <paths>' or 'git rm <paths>'
ca: després de resoldre els conflictes, marqueu les rutes corregides amb 'git add <paths>' o 'git rm <paths>'

source: after resolving the conflicts, mark the corrected paths with 'git add <paths>' or 'git rm <paths>' and commit the result with 'git commit'
ca: després de resoldre els conflictes, marqueu les rutes corregides amb 'git add <paths>' o 'git rm <paths>' i cometeu el resultat amb 'git commit'

source: Could not write to %s
ca: No s'ha pogut escriure a %s

source: Error wrapping up %s
ca: Error terminant %s

source: Your local changes would be overwritten by cherry-pick.
ca: Els vostres canvis locals es sobreescriurien pel recull de cireres.

source: Your local changes would be overwritten by revert.
ca: Els vostres canvis locals es sobreescriurien per la reversió.

source: Commit your changes or stash them to proceed.
ca: Cometeu els vostres canvis o emmagatzemeu-los per procedir.

source: Failed to lock HEAD during fast_forward_to
ca: S'ha fallat al bloquejar HEAD durant fast_forward_to

source: %s: Unable to write new index file
ca: %s: Incapaç d'escriure un nou fitxer d'índex

source: Could not resolve HEAD commit
ca: No s'ha pogut resoldre la comissió HEAD

source: Unable to update cache tree
ca: Incapaç d'actualitzar l'arbre cau

source: Could not parse commit %s
ca: No s'ha pogut analitzar la comissió %s

source: Could not parse parent commit %s
ca: No s'ha pogut analitzar la comissió pare %s

source: Your index file is unmerged.
ca: El vostre fitxer d'índex està sense fusionar.

source: Commit %s is a merge but no -m option was given.
ca: La comissió %s és una fusió però cap opció -m s'ha donat.

source: Commit %s does not have parent %d
ca: La comissió %s no té pare %d

source: Mainline was specified but commit %s is not a merge.
ca: S'ha especificat la línia principal però la comissió %s no és una fusió.

source: %s: cannot parse parent commit %s
ca: %s: no es pot analitzar la comissió pare %s

source: Cannot get commit message for %s
ca: No es pot obtenir el missatge de comissió de %s

source: could not revert %s... %s
ca: no s'ha pogut revertir %s... %s

source: could not apply %s... %s
ca: no s'ha pogut aplicar %s... %s

source: empty commit set passed
ca: conjunt de comissions buit passat

source: git %s: failed to read the index
ca: git %s: s'ha fallat al llegir l'índex

source: git %s: failed to refresh the index
ca: git %s: s'ha fallat al actualitzar l'índex

source: Cannot %s during a %s
ca: No es pot %s durant un %s

source: Could not parse line %d.
ca: No s'ha pogut analitzar la línia %d.

source: No commits parsed.
ca: Cap comissió analitzada.

source: Could not open %s
ca: No s'ha pogut obrir %s

source: Could not read %s.
ca: No s'ha pogut llegir %s.

source: Unusable instruction sheet: %s
ca: Full d'instruccions inutilitzable: %s

source: Invalid key: %s
ca: Clau invàlid: %s

source: Invalid value for %s: %s
ca: Valor invàlid per a %s: %s

source: Malformed options sheet: %s
ca: Full d'opcions malformat: %s

source: a cherry-pick or revert is already in progress
ca: un recull de cireres o una reversió ja està en curs

source: try "git cherry-pick (--continue | --quit | --abort)"
ca: intenteu "git cherry-pick (--continue | --quit | --abort)"

source: Could not create sequencer directory %s
ca: No s'ha pogut crear el directori de seqüenciador %s

source: Error wrapping up %s.
ca: Error al terminar %s.

source: no cherry-pick or revert in progress
ca: cap recull de cireres o reversió en curs

source: cannot resolve HEAD
ca: no es pot resoldre HEAD

source: cannot abort from a branch yet to be born
ca: no es pot avortar des d'una rama que encara ha de nàixer

source: cannot open %s: %s
ca: no es pot obrir %s: %s

source: cannot read %s: %s
ca: no es pot llegir %s: %s

source: unexpected end of file
ca: fin de fitxer inesperat

source: stored pre-cherry-pick HEAD file '%s' is corrupt
ca: el fitxer HEAD emmagatzemat abans del recull de cirers '%s' és corrupte

source: Could not format %s.
ca: No s'ha pogut formatar %s.

source: %s: can't cherry-pick a %s
ca: %s: no es pot recollir com cirera un %s

source: %s: bad revision
ca: %s: revisió dolenta

source: Can't revert as initial commit
ca: No es pot revertir com comissió inicial

source: Can't cherry-pick into empty head
ca: No es pot recollir cireres en un cap buit

source: Git normally never creates a ref that ends with 40 hex characters because it will be ignored when you just specify 40-hex. These refs may be created by mistake. For example, git checkout -b $br $(git rev-parse ...) where "$br" is somehow empty and a 40-hex ref is created. Please examine these refs and maybe delete them. Turn this message off by running "git config advice.objectNameWarning false"
ca: Git normalment mai crea una referència que termini amb 40 caràcters hexadecimals perquè s'ignorarà quan només especifiqueu 40 caràcters hexadecimals. Aquestes referències es poden crear per error. Per exemple, git checkout -b $br $(git rev-parse ...) on "$br" és de alguna manera buit i una referència de 40 caràcters hexadecimals. Si us plau, examineu aquests referències i potser suprimiu-les. Desactiva aquest missatge per executar "git config advice.objectNameWarning false"

source: HEAD does not point to a branch
ca: HEAD no assenyala cap rama

source: No such branch: '%s'
ca: Cap rama així: '%s'

source: No upstream configured for branch '%s'
ca: Cap font configurada per a la rama '%s'

source: Upstream branch '%s' not stored as a remote-tracking branch
ca: La rama font '%s' no s'emmagatzema com rama que segueixi al remot

source: Cannot change unmerged .gitmodules, resolve merge conflicts first
ca: No es pot canviar un .gitmodules no fusionat, primer resoldreu els conflictes de fusió
